{
    "aries": "May 20, 2025- There are days when a little humility can be good for you, Aries, and this might be one of those days. It's as if the planets are talking to you about sincerity and taking you far away from the trappings of superficiality and popularity. The things that are important to you today are much deeper concepts of humanity and compassion.",
    "taurus": "May 20, 2025- Your fiery willpower can help you move mountains, Taurus. But you already know that. When it's combined with your legendary optimism, it's a powerful tool you just can't do without. Today you will reap the rewards for your hard work over the last month, in every aspect of your life. The fire that burns inside you and gives you your incredible determination has its limits. Don't misuse it.",
    "gemini": "May 20, 2025- Today could discourage even the most ardent of passions, Gemini. Even if some people say you're a bit cold, know that there's a veritable volcano burning underneath all that ice. Today you may once again find yourself at a distance from your feelings, as if you were regaining control over your emotions. Be careful about being too cynical about things.",
    "cancer": "May 20, 2025- Cancer, you should try to be tolerant of other people's social and political positions. You may have to deal with certain people whose personal plans are jeopardized by events beyond their control. Don't judge them. Don't immediately defend one viewpoint without thinking how the situation affects the other person's life.",
    "leo": "May 20, 2025- This is a day for doubts, for asking those hard questions that you need to answer. If you like to meditate, Leo, think about spending a little more time at it today. You could learn a lot about yourself. You will see the whole palette of human emotion in other people, from joy to disappointment. Where do you fit in?",
    "virgo": "May 20, 2025- It may seem that you've been accumulating a lot of excess nervous tension and stress, Virgo. Unfortunately, you won't be able to count on the people around you to make it any better. What your partner wants and what you want may not coincide. It could be time to think about reenergizing your relationship. How about planning a weekend away for just the two of you?",
    "libra": "May 20, 2025- You may feel physical and emotional tension today, Libra. Are you taking the time to care for your body? Has someone been putting a lot of pressure on you lately? Are you an emotionally satisfied person? The way you feel physically is a good indicator of your mental state. Try to go a little easier on yourself and you will see immediate benefits.",
    "scorpio": "May 20, 2025- People love to be with you because you have such natural charm, Scorpio. But today you may not feel especially charming or like talking to anyone. You may have a secret inside that's screaming to get out. If someone confides in you today, do you think you could confide in him or her, too? You should get an answer to that question today.",
    "sagittarius": "May 20, 2025- Your partner may be all over you today, Sagittarius! Are you in the mood to listen? Are you interested in some love? Probably not. You may have had a hard day and just feel like some quiet time together. You aren't up to the demands your partner may make on you. You don't need to worry about it. It happens to everyone from time to time.",
    "capricorn": "May 20, 2025- You're often moved by emotion, Capricorn. You like situations that make you feel alive. Today your love life may give you just that kind of adventurous feeling. If that's the case, don't get so far into your emotions that it becomes too much for you. There is such a concept as too much of a good thing!",
    "aquarius": "May 20, 2025- You're a helpful person, Aquarius, yet in your relationships, you often seem to confuse helping with parenting. You tend to do a lot of self-sacrificing. Today you may learn how to say no when you feel your partner has gone beyond the limits of what you can give. If you do this, you may rediscover something essential you may have lost along the way - your ego.",
    "pisces": "May 20, 2025- Everyone needs to be loved, Pisces, but it shouldn't be your only objective in life. It isn't the end of the world if your charms fall flat every once in a while. Today you may be tempted to be a little less charming and seductive with the people around you. Some may even say you aren't acting like your usual self. Ignore them. A little self-indulgence now and then never hurt anyone."
}