{
    "aries": "Jan 3, 2026- A trip that you wanted to take may have to be postponed, Aries, probably for financial reasons. You'll want to make the journey in the company of someone who's financially strapped right now. This could be disappointing, but remember that this is only a delay. You'll be able to have your vacation at a later date. Don't be afraid to start making the arrangements. By that time, your friend should have the money.",
    "taurus": "Jan 3, 2026- The need to complete an important task could have you mustering a far higher level of self-control than you're used to, Taurus. Perseverance and determination could dominate your mood, and therefore you could accomplish wonders. However, be sure to take breaks occasionally, and remember to relax from time to time. Above all, don't be so focused on your work that you forget to eat. Your work will only suffer if you neglect your body. Pace yourself!",
    "gemini": "Jan 3, 2026- A business or romantic partner could be in a rather schizoid mood today, Gemini. You'll probably spend a lot of time together, and during the course of the day your friend could jump between enthusiasm and gloom. This could drive you crazy, as you won't know how to respond. All you can do is make sure all attention stays focused on the issues at hand. This changeability should burn out by the end of the day.",
    "cancer": "Jan 3, 2026- Generally, you tend to be rather ingenious where work is concerned, Cancer, but today you may feel that the fountain of innovation has totally dried up. No matter how hard you try, you probably won't be able to muster any new ideas whatsoever. Chances are your biorhythms are low, and therefore your mind is working at a slower pace than usual. Concentrate on routine tasks today. By tomorrow your ingenuity should be back on track.",
    "leo": "Jan 3, 2026- A crisis of values may confront you today, Leo. Someone you care about might need you to do something for them that you don't feel comfortable doing, and this could put you in a tough spot. You probably won't want to do it, but your friend needs your help. Consider every possible contingency before saying yes or no. Reflect on how the results could affect both you and your friend. Only in this way can you really be fair.",
    "virgo": "Jan 3, 2026- Today you might feel a little gloomy without knowing why, Virgo, and you could spend a lot of time trying to find a reason. There probably isn't any concrete reason. It's likely that you're simply responding to low biorhythms. This is, therefore, a great day to go for a workout. This way you can get the endorphins going and feel a lot better by late afternoon. Then you should actually feel like going out and having some fun.",
    "libra": "Jan 3, 2026- A close friend or love partner you haven't seen for a while could finally make arrangements to see you, Libra. You therefore could spend much of the day in a great mood, looking forward to the encounter ahead. You'll have a lot of fascinating information to share. It might be a good idea, however, to cut your visit a little shorter than you'd like and make arrangements for another meeting. Otherwise, you might get too tired.",
    "scorpio": "Jan 3, 2026- The house might seem rather empty today, Scorpio, as most of the other members of your household are probably out and about. This is, however, a good time for you to take care of some projects of your own that you've been putting off. They might be tedious and rather boring, but think how good you'll feel when they're finally done! In the evening you might entertain some visitors. Enjoy your day.",
    "sagittarius": "Jan 3, 2026- Someone close to you might not be feeling very well, Sagittarius, and you might feel the need to remain nearby and take care of this person. By all means do this. However, bear in mind that your empathic abilities are operating at a very high level today, and therefore you could actually experience some of their discomfort. Be sure to protect yourself psychically by keeping the white light around you if you want to avoid feeling ill yourself.",
    "capricorn": "Jan 3, 2026- A goal that you may have been working toward for a long time might still seem very distant right now, Capricorn. Therefore, today you could actually find yourself giving up on it. This doesn't imply that what you want will never happen. In fact, sometimes letting go of a dream can actually cause it to manifest. Remember this when you start to brood on your lack of success so far. All is not hopeless!",
    "aquarius": "Jan 3, 2026- A member of your household may be having troubles, Aquarius, and therefore you might consider staying home from work in order to help them get through it all. Nonetheless, you have career responsibilities that you need to fulfill. Whether to stay home or go to work may be a difficult decision to make today, but be sure you weigh all possible factors. Probably your housemate will insist that all is well and send you to work.",
    "pisces": "Jan 3, 2026- An important career concern could require considerable effort on your part today in order to enable you to advance whatever it is you're trying to accomplish, Pisces. At some point during the day, you may be plagued by doubts as to your ability to do this. However, don't let this cause you to panic. All you need is to muster a little energy and stay focused on the task at hand. Believe that today you're capable of accomplishing wonders."
}