{
    "aries": "Jan 9, 2026- Are you flying today, Aries, or perhaps going somewhere by train? If so, you might meet someone fascinating on the trip. Don't be shy, and don't let pride or propriety stand in the way of striking up a conversation with this person. It will pass the time, you might learn something, and there is always the chance that you really could become friends. Relax, smile your most charming smile, and enjoy the trip.",
    "taurus": "Jan 9, 2026- Have you just bought some new equipment for your home, Taurus? This could be a new computer, a state-of-the-art entertainment system, or perhaps a new appliance. You and the other members of your household might spend much of the day trying to learn how to use it, although it could seem rather difficult. Take heart! It looks more complicated than it is. Keep trying, and don't forget to have fun!",
    "gemini": "Jan 9, 2026- An unexpected phone call, perhaps from an old friend, could come your way today, Gemini. This person is apt to have good news for you, although he or she may be in a rather melancholy mood. A long conversation could result, the outcome of which is going to change your life, albeit in a subtle way. Nonetheless, this is apt to be a day full of pleasant surprises. Enjoy it!",
    "cancer": "Jan 9, 2026- A financial windfall might be in the stars for you, Cancer. This isn't anything you would have expected. Perhaps it's a bonus, repayment of a loan you'd long since forgotten, or a settlement of some kind. Whatever it is, it will definitely be a pleasant surprise. Don't, however, spend it all in one place. Wait a few days and then consult a professional about your financial future. This could make a big difference to you. Don't throw it away.",
    "leo": "Jan 9, 2026- An exciting group activity, perhaps one involving a number of your friends, could take place today, Leo. Your mind may be going a thousand miles an hour throughout the day. Ideas will be exchanged, stimulating conversations should take place, and you could meet some interesting new people. Someone you meet, however, has an agenda too. Be discriminating about whom you agree to meet with later.",
    "virgo": "Jan 9, 2026- Surprising and very fortunate events could take place today, Virgo. This could be an advancement that you weren't expecting. The introduction of an interesting new person or the beginning of an exciting new project could raise your pulse. The day should therefore pass by very quickly. Tonight you may want to share your excitement with your partner or another family member.",
    "libra": "Jan 9, 2026- Are you in an especially adventurous mood, Libra? This is the sort of day when you can try just about anything new and still come out in one piece. Why not enroll in a marathon, take rock-climbing lessons, or drive to a place you've never been to before? Wherever you end up, you should find peace and a heightened state of awareness. Don't hesitate. If what you have in mind involves minimal risk, go for it!",
    "scorpio": "Jan 9, 2026- Study of the occult sciences, whether historical or hands-on experiments, should prove fascinating and enlightening for you today, Scorpio. Astrology, alchemy, numerology, or herbalism are all intriguing fields, and your mind should be especially attuned to them. One warning: beware of unethical teachers. You may or may not read the works of one, but nonetheless hang on to a little skepticism. Even on days like this, don't believe everything you read or hear.",
    "sagittarius": "Jan 9, 2026- The opportunity to take a trip by air, perhaps at someone else's expense, could come to you today, Sagittarius. This might be business related or it could be educational in some way. This is a good day to travel or make the arrangements for it. The journey promises to be an exciting one that you'll remember for a long time. Do what you have to in order to get it all together and then go for it! Enjoy your day.",
    "capricorn": "Jan 9, 2026- Some rather bizarre dreams could come to you tonight, Capricorn. The symbols may include people or objects that you would never have thought of consciously in a hundred years. Nonetheless, they do have meaning for you right now. Sit down and make a list of the symbols and events in the dream, then try to analyze what they mean to you. Your dream is trying to tell you something important. Make the most of it.",
    "aquarius": "Jan 9, 2026- Do you have plans to go to a party tonight, Aquarius? Don't cancel them. If you're single, an exciting new potential love partner might be introduced to you, and you could spend the entire evening together. If you're already involved, someone could come on the scene who could prove a valuable business contact and might even form a partnership with you. Unless you're too tired to move, get up and go! You won't regret it!",
    "pisces": "Jan 9, 2026- Some unexpected changes could happen today, Pisces. You could find yourself confronting the prospect of having to get used to some new and totally state-of-the-art equipment that you've never used before. Don't panic. You'll do fine, you'll be a real whiz once you get used to it. Try to focus your mind on this for now and learn as much as you can. You can do it!"
}