{
    "aries": "May 22, 2025- Upsets and disappointments on the part of a family member could have the household in an uproar. Problems with household equipment could throw a monkey wrench into everyone's routine. On days like this, it's best for everyone to get out and distract themselves. Movies, sporting events, and museums can help relieve the stress.",
    "taurus": "May 22, 2025- Today you may need to contact a lot of people, Taurus, but the process could be frustrating. People may not be home, messages might not be delivered, or your equipment might not work properly. Unless it's urgent, it might be better to wait until tomorrow to try to reach them. You could end up too stressed otherwise.",
    "gemini": "May 22, 2025- Conflict over money could get in the way of your usual cordial relationships, Gemini. Attention to the household budget is definitely needed. Unexpected events may require some immediate purchases that you hadn't planned on. They might require some scrimping, but you should be able to minimize the need if you plan carefully. Don't make yourself crazy over anything today. You will get through it!",
    "cancer": "May 22, 2025- Your mother and father, or a couple you're particularly close to, could visit you today, Cancer. Plan some distractions like movies or videos, or invite some other people over. Talking with this couple alone might result in heated discussions that accomplish nothing but get everyone worked up and stressed. Whatever happens, don't let it get you down. Everyone should feel better tomorrow.",
    "leo": "May 22, 2025- This isn't a good day to go out, Leo. Traffic is probably awful. Don't trust any gossip that comes your way! It's probably passed through at least half a dozen people and retains little, if any, of the facts. Someone might be passing along rumors for their own reasons, so believe nothing you hear without checking it out.",
    "virgo": "May 22, 2025- Some unusual events could cause you to feel discontented from your life and contemplate some big changes, Virgo. Money matters might need attention and could prove frustrating. Outrageous ideas for improving your financial status could come to mind. Make a list of options, then wait a few days before making serious plans. This isn't the day to start anything new.",
    "libra": "May 22, 2025- Recent activities have suddenly made you bored with your job and the people you deal with. You may feel restless and contemplate changes to your professional life, Libra. This could be appropriate now, but it might not. It's best to look at your options logically and practically. Don't be afraid to ask family and friends for their opinions.",
    "scorpio": "May 22, 2025- A lack of time to pursue your spiritual and intellectual interests could weigh on your mind today, Scorpio. Gloom might descend on you, as if responsibilities of the moment are too much for you. Try to be the observer. If a friend came to you for advice with your problem, what would you say? Take your own advice. You might also want to consider streamlining your activities.",
    "sagittarius": "May 22, 2025- An unexpected setback could interfere with reaching a long-term goal as soon as you'd hoped. Don't let it get you down, Sagittarius. A little innovative thought and extra planning could get you back on track. This is a day best spent alone, working on projects of your own. You're likely to be restless in the company of others. On the upside, good money news could just about make your day!",
    "capricorn": "May 22, 2025- Your partner's family obligations could interfere with things you wanted to do together, Capricorn. Your desire to help could also get in the way of other responsibilities. The best way to handle days like today is to plan carefully. There's always a way to squeeze it all in. This may be what you have to do.",
    "aquarius": "May 22, 2025- A delay in receiving a communication from a distant place could prove frustrating today, Aquarius. You may be looking forward to a vacation, but responsibilities that suddenly crop up could postpone the trip. This probably won't be necessary, but some adjustments need to be made before you can both do what you want and fulfill your responsibilities, too.",
    "pisces": "May 22, 2025- Frustration could be the word for today. If you've made plans to meet a close friend or lover, Pisces, don't count on it happening. Unexpected events might force a postponement. Problems with schedules could have you playing phone tag. This also isn't a good day to work on creative or artistic projects. The results you want could prove elusive. Spend the day reading!"
}