{
    "aries": "May 13, 2025- You may be asking certain questions about your feelings, Aries. Do you know about the trap that many people get caught up in - feeling so close to their partners that they often forget themselves? Sometimes it's easy to confuse your feelings with this kind of self-denial. Today you need to think about how this affects your life.",
    "taurus": "May 13, 2025- Nothing can hold back your flame for long, Taurus. You have a hard time resting your body and recharging your batteries. At the moment, you're probably still going through a deep transformation that won't allow you to slow down. Take the time to meditate and get in touch with your feelings. What is it you really want out of life?",
    "gemini": "May 13, 2025- You can be known for needing a lot of love, but you will never admit that to yourself, much less anyone else. Sometimes it seems as if you like feeling emotionally frustrated. Today is the perfect day to meditate about whether or not this is true of you. Do you talk to other people about your emotional needs?",
    "cancer": "May 13, 2025- You probably aren't worried about being conventional in your relationships, Cancer. In fact, conventionality is often what causes you problems. If you're wondering what morality is and what it's based on, this is a good day to think about these questions.",
    "leo": "May 13, 2025- You may not be very precise. Your motto seems to be \"everything is relative.\" However, paying attention to details doesn't necessarily mean that you lose sight of the fundamentals. Your friends could tell you that. If you're an artist, you might make an effort today to be clearer in your expression and a little more down to Earth.",
    "virgo": "May 13, 2025- This isn't a good time to make any big relationship decisions. If you're thinking about starting a relationship, moving in together, or getting married, you may feel a bit troubled by your decision, Virgo. Take advantage of the day to reevaluate things objectively. There may be some issues to resolve before you go any further.",
    "libra": "May 13, 2025- Today you may feel like something is holding you back, Libra. Everything was going just fine until now. If you believe the stream of chatter in your head today, you will be regressing in every area of your life! For example, you may be afraid to go any further in your relationship because of your past failures. Use this time to lay the past to rest.",
    "scorpio": "May 13, 2025- You may be looking for some new values in your personal life, Scorpio. You're no longer interested in superficial or frivolous relationships. You need to meet different kinds of people and select friends who are really worth keeping. Don't worry if you feel like taking a step back to get some perspective, because this is the time to do it. Relationships are too important to neglect.",
    "sagittarius": "May 13, 2025- You may want to take a little trip into your past to visit some old friends, Sagittarius. You could find yourself daydreaming through your good and bad memories. This is an excellent period to break with some of the more negative ties to your past. If your partner is a little worried about you going back in time at the moment, reassure him or her.",
    "capricorn": "May 13, 2025- If you're concerned about the love that certain close people have for you, you shouldn't try to compensate by being clingy or overly affectionate. This period is about keeping your distance and putting your relationships into perspective to see what they're really worth to you, Capricorn. Someone may ask you for an even stronger commitment over the next few months.",
    "aquarius": "May 13, 2025- This isn't the time to make any more of a commitment to your relationship, Aquarius. You aren't satisfied with your attitude toward things lately. Don't forget that your partner's characteristics may have something to do with it! You have two months to take care of things. Take advantage of this reevaluation period. It doesn't happen that often.",
    "pisces": "May 13, 2025- Today you might want to think about getting things straight with the people close to you. It's possible you haven't dealt with any problems you had in your relationships last month, Pisces. It's time to look at things again. You may have hidden certain things from yourself. You need to be much more honest about what you want in your personal life."
}