{
    "aries": "Jan 20, 2026- Today you and your family or a group of friends might spend most of the day out and about, Aries. You might spend the day outdoors, or possibly attend a concert or festival of some kind. This should be a very happy day for you, as you're likely to be feeling especially close to those around you. Your relationships appear to be quite secure, as does your career and financial situation. Enjoy your day.",
    "taurus": "Jan 20, 2026- A class, lecture, or workshop could prove fascinating and stimulating for you today, Taurus. Plans for travel to a distant state or foreign country, perhaps in the company of friends or family members, could be confirmed, which should make you feel really good! Your relationships seem warm, supportive, and stable, even those with people who live far away from you. Have fun!",
    "gemini": "Jan 20, 2026- If you've been thinking of buying a home or otherwise purchasing real estate, Gemini, this is the day to start the ball rolling or finalize the deal, depending on your situation. Investments in property planned at this time should continue to increase steadily in value. However, make sure this is the right investment for you before committing to anything. Otherwise, you might be stuck with something you don't like for a long time.",
    "cancer": "Jan 20, 2026- A festive social event could either start or consolidate a love relationship, which could last for a long time. New and interesting people could come into your life, Cancer, bringing stimulating conversation and useful information. Someone you haven't seen for a while could also appear on the scene, making for a joyful reunion. A project you've been working on, either job related or personal, could finally be completed. Enjoy your day.",
    "leo": "Jan 20, 2026- Today you should be experiencing a strong feeling of satisfaction and contentment with your life, Leo. Business and financial matters continue to go well, and your home life especially appears to be secure and stable. You might be considering investing some of your resources in your home. Any new romantic relationships begun at this time could well last for a long time, so make sure you really like the person before committing!",
    "virgo": "Jan 20, 2026- Business transactions taking place in your near neighborhood should prove sensible and satisfying today, Virgo. You should be feeling pretty financially secure right now, as career and money matters continue to go well for you. Contact with friends, neighbors, and relatives should be open, congenial, and honest. Relationships of all kinds are apt to be pretty stable. In the evening, take a brisk walk near your home.",
    "libra": "Jan 20, 2026- If you're into gardening or in any way working with the land, you're likely to spend a lot of time doing it today, Libra. A friend or family member could help. Anything planted today is likely to grow and thrive, so don't worry about seeds that don't sprout. You might spend a bit too much time doing it, however. Work only until you're pleasantly tired, then quit for the day; otherwise, you might burn yourself out.",
    "scorpio": "Jan 20, 2026- A warm and loving communication could come today from a longtime friend or romantic partner. This could be the high point of your day, Scorpio, especially since a letter or delivery you've been waiting on for a while still might not come. An older relative or neighbor might come to your door wanting advice about something. Children could prove particularly inspiring at this time, as you're especially attuned to them now. Enjoy!",
    "sagittarius": "Jan 20, 2026- If you've been thinking about starting a garden, this is a great day to do it, since anything relating to the land you begin today is likely to thrive. Doubts about your financial security might be on your mind, Sagittarius. They're probably misplaced, because you should continue to do well. However, your doubts can serve a purpose in that they could inspire you to take steps to ensure that your situation continues. Go to it!",
    "capricorn": "Jan 20, 2026- Family and friends may gather for an intimate get-together at your home or perhaps at the home of a neighbor. At some point, expect an exciting phone call. You should be feeling pretty secure in relationships of all kinds, Capricorn, from business partnerships to close friends to love partners. Information provided by someone else could give you some ideas as to how to fix up your house in a new and different way.",
    "aquarius": "Jan 20, 2026- A close friend or lover could share a secret with you today, Aquarius. An older person could be in the news, perhaps an author or politician you particularly admire. You, yourself, could feel inspired to work on a creative project of some kind, although the downside might be that you keep working at it for too long and could well exhaust yourself. Remember to take breaks. You need to relax a little and remember to take time out to eat.",
    "pisces": "Jan 20, 2026- Someone you've known for a long time but haven't seen for a while could suddenly come back into the picture, Pisces. He or she could attend a social event of some kind or actually drop in to visit your family. Friendships and group affiliations could prove supportive and satisfying right now and you should feel pretty secure with them. This is a great time to sign up for classes, particularly those involving the arts."
}