{
    "aries": "Mar 22, 2025- This day will be filled with many exciting surprises for you, Aries. Approach it with gratitude and you will be amazed at the number of things that just naturally seem to flow your way. Your generous heart will be rewarded in unexpected ways. Old friends are likely to show up. Open yourself up to conversations. Act spontaneously and with a great deal of passion.",
    "taurus": "Mar 22, 2025- There's a larger trend operating in your life, Taurus. It's asking you to break the rules and enter a new realm - a new mindset or way of living. Today that trend comes into focus, as emotional outbursts call attention to the changes. Your heart may want to go one way while your brain wants to go another. Take deep breaths and infuse a wave of calm into the situation before you proceed.",
    "gemini": "Mar 22, 2025- Pour yourself a comforting cup of tea today, Gemini. Take a hot shower or a long bath. In short, pamper yourself. You may be picking up on the extra tension of the people around you. Be conscious of this and make a mental note to strip away the garbage that others dump on you. You're a sensitive individual. Pat yourself on the back and look out for sudden moves from others.",
    "cancer": "Mar 22, 2025- It may be that people are a bit upset by some of your recent actions or words, Cancer. The offhand remark you made a couple weeks ago is catching up to you. What you may consider friendly, lighthearted sparring may actual do a bit of damage to someone's sensitive emotions, especially today. Think before you speak. Others might not have as tough a skin as they seem to have.",
    "leo": "Mar 22, 2025- This is an exciting day for you, Leo. You can accomplish quite a bit. Your intuition is especially acute and your sensitivity is strong. Computers might irritate you today. It's possible to get all worked up if your laptop crashes. Save your work often. Keep in mind that it's just a machine. Don't let it get the better of you.",
    "virgo": "Mar 22, 2025- You might be a bit jittery, even without caffeine, Virgo. Sudden actions may cause people to freak out, since people will be on edge in general today anyway. Save the surprises for another time. If you need to tell your boss that you're going on vacation for a little while, now isn't the time. There's a rough edge to the astral energy. Relax to soothe your soul.",
    "libra": "Mar 22, 2025- Things may be coming at you from all angles today, Libra. Sooner or later you will be forced to take action. It may seem like the walls of the room are slowly caving in. The pressure is building and the air is getting stagnant. Go out for a run. Exercise will help you release some of that pressure you feel.",
    "scorpio": "Mar 22, 2025- You may be excited about an idea today, Scorpio, but unfortunately no one else may be. You spring up with enthusiasm only to smack into a brick wall. One side of you may be communicative and witty while the other is confused. The two sides aren't really connecting well, so perhaps you should just lay low. Hold on to your ideas, and save their presentation for a later day.",
    "sagittarius": "Mar 22, 2025- Much of today will be a continuation of yesterday, but with perhaps a bit more intensity for you, Sagittarius. There's an added buzz in the air, like static on a radio. This background noise may not provide the best environment to work in, but you should be able to navigate with no problem. Tune out the chatter and move on.",
    "capricorn": "Mar 22, 2025- Today is one of those days when you might feel like four people have a hold of each of your limbs, Capricorn. The people are tugging and you're getting stretched in every direction. Someone wants you to go there, someone wants you to come here. Take some time out for yourself and clearly state your needs to others. Make it known what the best situation for you would be.",
    "aquarius": "Mar 22, 2025- There's an emotional intensity inside you today that's squirming to find a way out, Aquarius. Sudden outbursts are likely, so take care to hold your temper in check. Surround yourself with good friends who can support your erratic feelings. Don't be clingy. Seek friends who are thoughtful listeners, not permanent crutches. They may be feeling the same strong tension and don't need an extra burden.",
    "pisces": "Mar 22, 2025- Today may have some crazy emotional ups and downs, Pisces. There seems to be an intense cloud seeping into every part of your day. Don't try to fool people. They will see right through you. Bursts of positive energy will pop out of nowhere to remind you of your more important purpose. Try not to get so bogged down in the heaviness of the day that you fail to spot opportunities that arise."
}