{
    "aries": "Mar 19, 2025- Check and double-check any information that comes your way today, Aries. There's deception and discontent in the air, which is an unfortunate combination under any circumstances. Research before you judge. Gossip is likely to fly around the office. Run for cover when necessary. You don't want to get involved in this particular round of office politics.",
    "taurus": "Mar 19, 2025- Don't take your bank or portfolio statement at face value today, Taurus. Financial errors are likely. Someone may want you to see things from his or her viewpoint, which may not be based on fact. Check and double-check important figures that cross your desk. You're the only one you can trust to truly work in your best interests. It's time to put your mind to use and work on your own behalf.",
    "gemini": "Mar 19, 2025- You won't feel particularly social today, Gemini. You'd be happiest at home with a good book, a good meal, and no contact with the outside world. Alas, such solitude isn't always possible. You may have to balance your need for isolation with obligations to colleagues. Part of your grumpiness might be due to a physical imbalance. Make it an early night and you will wake tomorrow with a new attitude.",
    "cancer": "Mar 19, 2025- All isn't quiet at home today, Cancer. There's tension in the air. You can't shake the feeling that someone is lying. You're a peacemaker by nature, so your inclination is to suppress your suspicions. In this instance, your instincts are right. The person withholding information is doing it for your own good and will come to you once the situation has been resolved. You can all laugh about it then.",
    "leo": "Mar 19, 2025- It's strange how past incidents can still cause such pain in the present. Today you may feel overwhelmed by memories of a particularly traumatic incident. No one is more surprised than you by your reaction. You felt sure you'd addressed this issue and put it behind you. Apparently there's still work to be done, Leo.",
    "virgo": "Mar 19, 2025- It's apparent that something underhanded and unethical is occurring at your job today, Virgo. Co-workers could try to manipulate situations and take advantage of proprietary information to use to their own benefit. Steer clear of office politics and refrain from participating in any gossip. Trust your instincts. You know who can and who can't be trusted.",
    "libra": "Mar 19, 2025- Don't trust anyone today, not even people you consider friends, Libra. There are indications of deception all around, especially at work. Someone may be keeping something from you or even manipulating information to his or her own advantage. Be sure to check the facts of any situation. Don't take anyone's word for anything. This is a good day to take your own advice rather than someone else's.",
    "scorpio": "Mar 19, 2025- Don't trust anything related to money or contracts today, Scorpio. This isn't a good day to enter into any kind of contract, whether it's starting an investment program, negotiating a salary, or changing banks. There's a lot of miscommunication and misunderstanding in the air. You may think you understand what you're signing, but you may not. Save legal and financial matters for another day.",
    "sagittarius": "Mar 19, 2025- This isn't the day for contracts or legal work of any kind, Sagittarius. You may think you understand everything about a document, but it's likely you don't. The atmosphere is ripe for misinformation and misunderstanding. You will be well served today if you keep to yourself and do your work carefully and systematically. The legal documents can wait for another day.",
    "capricorn": "Mar 19, 2025- Trust your instincts regarding anyone you meet today, Capricorn. There are unethical people around, and one of them may enter your circle. Entering into legal contracts or business or personal partnerships of any kind is absolutely out of the question. Don't even go to renew your driver's license, as you're likely to fail the eye exam! Stay home and save contracts and bureaucracy for another day.",
    "aquarius": "Mar 19, 2025- If you wake up this morning and feel glued to the bed, perhaps that's where you should spend the day, Aquarius. You've been working hard and long these past few weeks. It only makes sense that your body would rebel eventually. This is a day for rest and relaxation. The office will survive without you. Call in sick and then turn off the phone. You're likely to sleep better than you have in a long time.",
    "pisces": "Mar 19, 2025- Pay attention today, Pisces. There may be some unethical behavior occurring at work, and it could trigger some long-buried anger. You may have difficulty keeping your emotions in check, but you need to. Honest communication is the only way you can get through this day. Once you've calmed down, you might want to approach the person who's behaving irresponsibly."
}