{
    "aries": "Dec 10, 2025- Your private life is probably in the throes of great change. This change is likely related to profound transformations that are taking place in your behavior, in particular your nervousness. If your daily or family life seems stifling to you, there's no need to take your frustrations out on loved ones. Look for answers inside.",
    "taurus": "Dec 10, 2025- It wouldn't be surprising if you enrolled in a class that's very different from your normal activities. For example, a surfer may get a sudden urge to learn about computers, or a technology guru might take up flower arranging. Those who think they have you all figured out will be taken off guard by your new spontaneity and sense of adventure.",
    "gemini": "Dec 10, 2025- Some of the planetary movements are currently helping you understand that the best place to discover treasure isn't always where other people tell you to look. If people are urging you to get interested in activities that don't interest most people, including you, pay them no heed. You'll discover treasure all on your own provided you follow your own calling.",
    "cancer": "Dec 10, 2025- No one's more forward thinking than you now. You're in tune with new inventions and trends, and you may have an irresistible desire to join an avant-garde group. The old way of doing things seems old, and you no longer want any part of it. You can't stand working according to the old principles any more. You're in a heated frame of mind. Be careful about stirring conflict.",
    "leo": "Dec 10, 2025- You couldn't be in a better position in your personal life. The time is ripe to thumb your nose at your demons for the last time. Complexes, guilt, and fears of all kinds are gone. It could even be that the radical \"housecleaning\" you'll undertake will affect your professional career as you become aware of how much you've been underestimating yourself.",
    "virgo": "Dec 10, 2025- Today's forecast is excellent for you. The celestial bodies can't help but smile on the tempestuous energy of your character. You would be advised to act on your strong intuition. But be prudent in the execution of your actions lest your impulsive spirit stop you from taking recommended precautions.",
    "libra": "Dec 10, 2025- Devote your energies to human psychology today. It's a good day to try to sell your ideas. Concentrate your efforts on those whose help you need. If you have faith in your originality, your sales efforts are likely to pay off. In fact, there is some chance you'll meet an especially dynamic person who can lead you into some fascinating, unexplored territory.",
    "scorpio": "Dec 10, 2025- There is some likelihood that you'll have an electrifying emotional encounter today. Some of life's more mundane details may trigger arguments that, although violent, are cathartic and short. You've been thinking that it's time for more intensity in your life. Whether you know it or not, you're rethinking all manner of human relationships.",
    "sagittarius": "Dec 10, 2025- The current astral configuration could be described as a crisis phase, although today's events won't be unhappy. Communication proves difficult for you. For a long time you've been banking on others noticing and appreciating your talent, but you're beginning to feel like a sucker for being so patient. This would be a good day to confront the powers that stand in your way.",
    "capricorn": "Dec 10, 2025- You have a pleasant day ahead. Optimism and creativity prevail. You can avail yourself of all the freedom necessary to encounter happiness. Indeed, that newfound happiness may come in the form of a new person who makes your heart beat faster. Don't fall in love too quickly! There are plenty of opportunities now. A deep and fulfilling commitment will take time to build.",
    "aquarius": "Dec 10, 2025- The day ahead looks promising. Your energy is gradually returning, and you're beginning to feel more enterprising about your domestic life. No doubt today you'll be called on to settle some financial questions related to your domestic needs. While a substantial gift of money or raise would be welcome, you begin to see other ways of making the cash flow rather than trickle.",
    "pisces": "Dec 10, 2025- Try to imagine that you're in your creative workshop and you've given up using all your usual tools in order to find new ways to give form to your inspiration. Another completely different creative style will emerge. Your admirers may be surprised, but no one will be more astonished than you."
}