{
    "aries": "Jan 13, 2026- Plans for social events to take place in your neighborhood might have you spending a lot of time on the phone today, Aries. Or you might be running around in the car taking care of various errands. This could involve the healing profession in some way. Whatever it is, you feel especially strongly about it. A current or potential love partner might also be involved with your project. Invite this person to dinner. You'll probably like how the evening ends!",
    "taurus": "Jan 13, 2026- New information regarding opportunities for career, business, and personal expansion might shake up your value system today, Taurus. This is a positive development, although it may be a bit disconcerting for you right now. Your life could well take a different turn, starting today. An immediate desire for pleasure could be satisfied by scheduling a romantic dinner with a lover. Forget the changes that are happening for a while and enjoy your evening!",
    "gemini": "Jan 13, 2026- New ideas that you have been studying over the past few days might have turned your mind in a different direction, Gemini. Thus, you are shifting away from the concepts that you've always accepted toward other ideas that you may have just learned. This could lead to projects of your own, perhaps involving writing or speaking. Open and honest communication with a lover might lead to an intimate evening together. Expect some intense conversation, among other things!",
    "cancer": "Jan 13, 2026- Your logical mind might try to make rational sense of the strange metaphysical ideas that are popping in and out of your head today, Cancer. Some of them might be conclusions drawn from books you've been reading, but others might actually be messages from the other side. Write down whatever insights come your way. They might not seem logical, but they'll make a difference to your life. In the evening, discuss these ideas with a love partner.",
    "leo": "Jan 13, 2026- A growing sense of intimacy with a close friend or love partner is likely to stem from mutual interests. The two of you might even discuss taking a long trip together, perhaps to a distant state or foreign country. This isn't the time to hold back or be too cautious, Leo. Your life is very much on track. If you want to get away with this person, go for it. In the evening, get together with a lover!",
    "virgo": "Jan 13, 2026- A powerful romantic attraction might lead to creative or artistic inspiration. You should be feeling especially passionate today, Virgo, and your passions are likely to spill over not only into your relationships but into your work as well. Whatever you produce creatively is likely to be so inspired it impresses even you. Work done on the job should attract favorable attention from superiors. You're feeling especially sexy. Dress up and see what happens!",
    "libra": "Jan 13, 2026- A project initiated by a group with which you're affiliated could keep you very busy today, Libra. You might have to spend a lot of time on the phone or running around in the car to libraries and bookstores obtaining information. A close friend or love partner might choose to accompany you. You're likely to be feeling very strongly about whatever you're doing, so expect a gratifying day. Spend the evening with someone close to you.",
    "scorpio": "Jan 13, 2026- New ideas and concepts regarding the way you make your living might come your way today, Scorpio, which could cause a bit of a shakeup in your value system. You might decide to tackle an entirely new profession that you've never considered before. Books on the subject could prove supportive and encouraging, as could those closest to you. It's important to follow your heart at this time. Go for it!",
    "sagittarius": "Jan 13, 2026- Group activities and social events excite your passions today, Sagittarius. You'll meet lots of new people, take on some interesting new projects, and, if you haven't already, you might even fall in love. A number of fascinating ideas exchanged at these events might propel you into a new course of study. Partnerships of any kind formed today stand a powerful chance of succeeding. In the evening, go to dinner with your new friends.",
    "capricorn": "Jan 13, 2026- Some projects requiring a lot of thought, which you may have been working on for a long time, could well be completed today. Your efforts are definitely going to be appreciated by those who matter, Capricorn, and you might even receive public acknowledgment of some kind. A rise in income could be just over the horizon. You've worked hard to be where you are and can't be blamed if you give yourself a pat on the back. Go to it!",
    "aquarius": "Jan 13, 2026- Inspiration stemming from other places and other cultures might direct your passions to a new creative project of some kind, Aquarius. Your mind is quick and resourceful and your energy high, so you'll probably have a busy day. You could also be feeling especially romantic and sexy and desirous to share all you've been doing with a love partner. Arrange a hot date if you can, then make sure you look your best! Enjoy!",
    "pisces": "Jan 13, 2026- Some images deriving from dreams or visions might provide inspiration for ideas to redecorate your house, Pisces. You might spend some time perusing books in order to find ways to put your ideas to work for you. Then you'll embrace the task with a passion! Speaking of passion, sex and romance are also very much on your mind at this time. Get a lover to help you with your work. This could propel you to some rather pleasant consequences."
}