{
    "aries": "May 16, 2025- Today you might receive some uncomfortable intuitive signals from one or more of your friends, Aries. Perhaps someone doesn't feel well but came out to play anyway. Sensing the tension in others could save you some grief, as people may be stressed and likely to lash out over nothing. It's best to focus on solitary pursuits if you can.",
    "taurus": "May 16, 2025- Today you may attain a goal you've been hoping to reach for a long time, Taurus. Oddly enough, friends, family, and even your significant other may not seem as happy as you expected. They've probably suffered too many frustrations recently, and your success only reminds them of this. Give them some time to settle their own affairs and they will congratulate you. They're only human.",
    "gemini": "May 16, 2025- Today you may be anxious to spend time with your family, Gemini, but there could be some chores you need to do first. This could stress you out quite a bit if you let it. Roll up your sleeves and handle whatever needs to be done and then hightail it back to your hEarth. Relax and enjoy the company of your loved ones!",
    "cancer": "May 16, 2025- Today it might be more difficult than usual for you to deal with words, Cancer. Someone might lend you a book on a rather obscure subject that you can't understand. In fact, you might find the book - or anything else you try to read - boring! You don't want to hurt your friend's feelings. Put the book aside and try again later. The words should be clearer to you then.",
    "leo": "May 16, 2025- Some news that comes to you from a friend or colleague could shake you up today, Leo. You might find that what you learn casts doubts on concepts you've embraced for most of your life. This could confuse you. Don't feel threatened. Everyone has to recreate some values from time to time. Think about it when you're more relaxed and you might find it isn't so radical after all.",
    "virgo": "May 16, 2025- Today you may see that nearly every couple you know is quarreling, Virgo. You may have a few differences with a current or potential partner, but this is nothing to worry about. You're tense and edgy because of outside pressure, so your fuse might be a bit shorter than usual. Try to stretch your patience a little further, just for today. All should be well by tomorrow.",
    "libra": "May 16, 2025- Today you may be in a very stressful atmosphere. Your entourage is likely to be tense and anxious, and you're no exception. You may need to stay in the environment until you've accomplished your objectives. You will probably want to spend your evening at home in front of the TV, doing and thinking absolutely nothing. Relax!",
    "scorpio": "May 16, 2025- You and a current or potential partner may disagree on whether to spend some time together alone or go out with friends, Scorpio. If you've both had a rough day, you're likely to be rather tense and apt to snap at each other. A compromise may be the best answer. Spend an hour or two with your friends and then come home and relax. That way, everyone's happy.",
    "sagittarius": "May 16, 2025- A relaxing evening at home may be just what you need, Sagittarius, but a colleague might ask you to attend a business-related event. You may have had a stressful few days. Such a party may be the last thing you want to do. Don't be afraid to say no. There will be plenty of colleagues there. At the most, put in a quick appearance and then leave. Right now you need rest more than contacts.",
    "capricorn": "May 16, 2025- Today you may try to contact several people, Capricorn, none of whom may be available. You might particularly want to reach a female friend or relative who lives far away. This could prove frustrating, as you have some interesting news for her. Keep trying. You will eventually manage to connect, and she will be glad to hear from you. She might even invite you to visit!",
    "aquarius": "May 16, 2025- Whether or not you should make a specific expenditure could cause some tension between you and a partner, Aquarius. You may think that it isn't feasible now, while your friend is determined to go for it. This isn't the day to try to reach an agreement in this matter. Neither of you is likely to give in. Wait a couple days until you're both a bit less tense.",
    "pisces": "May 16, 2025- A friend may be throwing a party and you might be expected to attend. You've probably had a stressful day and really don't feel up to it. Your friend may try to induce you to come by making you feel guilty. Don't fall into that trap. Go only if you feel that the value of the occasion overrides your need to rest. Your friend will forgive you if you say no."
}