{
    "aries": "Apr 20, 2025- There may be subtle messages in people's words today that you need to attend to, Aries. Other people could be trying to send you hints in order to push your buttons. Confront them on this behavior. Don't ignore the subtleties in their voices. Tender, loving messages may be laced with thorns intended to provoke you. Don't let this action go unnoticed.",
    "taurus": "Apr 20, 2025- Don't keep playing along with the games if you no longer want to repeat the same drama, Taurus. By placing yourself in a victim role, you're opening yourself up to manipulation and control by others. To stop the repetitive pattern, it's crucial for you to stand up and recognize that you have an important part in the healing process. Recognize that you have the power and courage to change.",
    "gemini": "Apr 20, 2025- Today is excellent for you, Gemini. You should be encouraged to take action in any artistic realm. Cook a scrumptious dinner and share it with a loved one. Give your heart a chance to speak and act on what it says. Your feminine and masculine sides are on the same page now. Take the opportunity to balance these two aspects. You're a magnet for love and romance.",
    "cancer": "Apr 20, 2025- Go weed the garden, Cancer. If you don't have a garden, start one. It's important for you to get into the Earth today, so roll up your sleeves and get your hands dirty. Feeling a connection with the ground is an important step in manifesting your dreams. Buy some seeds, fertilizer, and a watering can. This is a great day to create a nurturing environment in which a seed can grow.",
    "leo": "Apr 20, 2025- There's great opportunity for romance today, Leo. Love the people you're with, but don't smother them. The more you loosen your grip on a situation, the more you will gain control of it. Cutting chains to the past is the first step in moving forward toward a goal. You might not realize how much a past situation holds you back until you make the effort to release it.",
    "virgo": "Apr 20, 2025- The active and receptive natures of your being are coming together, Virgo. There's a balance between these two aspects. You're able to attract the prosperity and love you desire by the way in which you handle yourself around others. Today is about the equilibrium between give and take. Make sure there's a healthy balance between you and your loved ones.",
    "libra": "Apr 20, 2025- Today is a fantastic day for you. Your sensual, caring nature will be appreciated, Libra. Whether you actively pursue it or sit back and relax, you will receive the love and good fortune you desire. Your creativity is also at a peak during this time. You should take advantage of this energy and actively use your talent to create something beautiful and meaningful.",
    "scorpio": "Apr 20, 2025- Being married to someone for many years takes work, Scorpio. No one said it was going to be easy. Hollywood promotes a fantasyland that can make your life look drab and boring by comparison. Realize that your life can be good and interesting, too - reality is even better than the movie version. Today is a good day to prepare for future growth.",
    "sagittarius": "Apr 20, 2025- Today is a great day to make your big move, Sagittarius. If there's something in the love and romance department that you feel you need to act on, this is the day to do it. It's now or never. Approach all situations in a practical, caring manner. Plow forward with confidence and don't look back. Indulge in those things that give you pleasure. Get a massage or take a bubble bath tonight.",
    "capricorn": "Apr 20, 2025- Take your focus off you and concentrate on someone else for a day, Capricorn. This doesn't mean focusing so the person will stop and pay attention to you. It doesn't mean getting their attention so that you have someone who will listen to you talk. Get someone's attention because you really want to hear what he or she has to say.",
    "aquarius": "Apr 20, 2025- It might take an extra few minutes to get out of bed today, Aquarius, but it will be worth it when you do. You will find that the more honest you've been with people, the more payoffs you will receive. Being dependable and trustworthy are key issues to focus on. Act strong and proud with regard to who you are and the rewards will come. Bring a certain amount of tenderness to all your actions.",
    "pisces": "Apr 20, 2025- Don't try to fit into a mold you simply don't belong in, Pisces. You may have gone through a major transformation lately in which you went from being a square peg to a round peg. Other people might still be trying to push you into the square hole. Don't let them. Let people know that it upsets you not to be treated the way you want to be treated."
}