{
    "aries": "Feb 20, 2026- Financial prosperity is just around the corner, Aries, especially with your recently acquired money-management skills. It’s likely that you’ll receive a windfall in the near future, although it may not seem like a windfall to you, since you’ve been expecting this money for a long time now. Use your new abilities to invest it soundly and wisely. You’re bound to be quite pleased with the results you achieve over the long term.",
    "taurus": "Feb 20, 2026- The significant other in your life needs your support not a lecture right now, Taurus. Let him or her know you’re available to listen and help in any way, but don’t smother your partner with kindness. He or she will come to you when ready. In the meantime, Taurus, take care of your physical needs. If your body craves exercise, why not increase your jogging miles or add extra time to your gym workout? Absence does make the heart grow fonder, after all.",
    "gemini": "Feb 20, 2026- Today is the final push to complete a very big project you've likely been working on for some time now, Gemini. Even though your name won’t be on the cover of the book or business proposal, you’re gratified to have played such a significant role in its completion. Be sure to have a nutritious breakfast and lunch today, because you’re likely to work right through dinner.",
    "cancer": "Feb 20, 2026- A pleasant outing could get delayed or cancelled due to an event entirely out of your control. Rather than having a fit, Cancer, you and your friends could seize the opportunity to do something completely wild and different. For example, you could take in a matinee of the scariest movie in town or finally try out that Ethiopian restaurant you've been hearing so much about. Today brings a perfect opportunity to make lemonade out of lemons.",
    "leo": "Feb 20, 2026- There’s no question about it, Leo, you’ve been working hard these last few weeks. As an approaching deadline looms, you may find yourself waking up at night, running numbers through your head, and mentally rewriting project proposals. It's exhausting, to be sure, but know that the end result will make all this aggravation worthwhile.",
    "virgo": "Feb 20, 2026- Today, or rather tonight, is for romance and cozy intimacy, Virgo. You pull out all the stops for your evening with that special someone. Scented candles, your best perfume, and your most sensuous clothing work to enchant the person who is already head over heels in love with you. Your relationship is clicking along just beautifully right now. Why not celebrate in some special way?",
    "libra": "Feb 20, 2026- Some interesting moneymaking opportunities are likely to come your way, Libra, either today or in the near future. It could be that it’s time for a new job, one that promises faster progress through the ranks and more financial stability. Once you get past a certain age, working on commission loses its appeal. You’re ready for steady growth in your portfolio. Perhaps you should seek a financial planner for steps you could take right now to improve your bottom line.",
    "scorpio": "Feb 20, 2026- There’s going to be so much to get done today that you might feel a little daunted about getting started. By midday you could even find yourself downright overwhelmed. Take a break, Scorpio. Take a long lunch on an outside terrace, weather permitting. Breathe deeply until the stress subsides. You may need to concentrate on finishing only one or two minor tasks today and put the rest off until tomorrow. Remember, too much stress can take its toll on your health!",
    "sagittarius": "Feb 20, 2026- No sooner do you set foot in the office this morning than you begin to get pelted from all directions with various crises and problems, Sagittarius. It isn’t a very welcome reception. A hot cup of coffee and a warm greeting from your co-workers would be a much nicer way to start the day. Take it all in stride. You have the brainpower and stamina to solve all the day's problems.",
    "capricorn": "Feb 20, 2026- Today will be a lovely combination of harmony and passion. Make the most of it, Capricorn. With things running so smoothly at work, there's no reason you can't leave the office early to prepare for a special evening with your partner. Pull out all the stops tonight. Scented candles, a fabulous meal, and an even more fabulous outfit. Have a rich, gooey dessert on hand (although it's likely you won't get around to eating it).",
    "aquarius": "Feb 20, 2026- Your efforts on the domestic front have certainly paid off, Aquarius. Your home is looking wonderful. Everyone who enters says so. Some unexpected visitors may stop by for a quick hello and wind up staying for dinner. You are a natural, gracious host, not to mention a great cook. Who can blame your guests for wanting to stay?",
    "pisces": "Feb 20, 2026- Your neighborhood is changing, Pisces, and the change is all for the better. Wonderful new neighbors may have moved in, or perhaps a small gourmet take-out shop has just opened up. It all adds to the sense of warmth and community of your town. You spend a good part of the day among your neighbors, encountering them wherever you go as you run errands in town."
}