{
    "aries": "May 10, 2025- Physical pleasure may be at the top of your priority list today, Aries. You might want to go to your favorite restaurant and have a great meal, including wine, appetizers, and dessert. Or you might feel especially energetic and want to take your partner for a complete spa treatment. Whatever your desires, exercise some restraint You can get too much of a good thing!",
    "taurus": "May 10, 2025- Love matters may prove too intense today, Taurus. You may be having a rough week. Your partner may be especially demanding of your time and energy. This might be a good day to schedule some time alone. Go for a massage, sauna, or hot tub - by yourself - and simply relax. That way you will be more refreshed when you meet with your beloved in the evening.",
    "gemini": "May 10, 2025- You've been hoping for a quiet day on the job, Gemini, but too many calls could come your way. You might have to juggle several at once. Don't try to deal with every problem. Exercise your triage abilities and take care of the most pressing first. Let the others go, if necessary. You aren't doing anyone any favors by getting too distracted. Even you can be less than thorough when overwhelmed.",
    "cancer": "May 10, 2025- Were you planning to go shopping today, Cancer? If you can, put it off until tomorrow. You could be tempted by too many items that seem wonderful in the store but are nothing but a bother once you get them home. If you must go, make the effort to bypass shops where you might fall into this trap. You don't want to have to make a second trip to bring back returns.",
    "leo": "May 10, 2025- You look especially attractive today, Leo, and it's doing wonders for your self-esteem. Even members of your household notice. But you probably feel more like staying in than going out. If you want a romantic partner to notice how you look, it might be a good idea to extend an invitation to visit your home. You will get to stay in and still be admired by the one you love the most!",
    "virgo": "May 10, 2025- Today, Virgo, you might want to make an unqualified declaration of love. That's fine if you've been involved for a while, although you could overwhelm your partner. If the relationship is new, beware! This could feel like too much too soon. Your friend could respond by backing away or even disappearing. Use restraint or you might have the opposite effect to the one you want.",
    "libra": "May 10, 2025- A friend may offer you a gift today, Libra. It could involve money, favors, time, items you need, or something else. Be discriminating about what you accept, and make sure you offer to reciprocate. Insist, if you must. As generous as your friend may be now, later he or she could feel used or else call in some favors that you aren't willing to perform. Accept graciously, within limitations.",
    "scorpio": "May 10, 2025- The temptation to take center stage might be too strong to resist, Scorpio. Someone may ask you to tell a story. Your gift with words and vivid imagination should serve you well. Keep it brief. If you go on too long, your friends could fidget. Time your performance by watching their expressions. Do it right and you will be asked to do it again.",
    "sagittarius": "May 10, 2025- A gathering could bring you lots of good news and useful information, Sagittarius. The problem is that there might be too much. You will want to remember it all, but your memory may not be as sharp as usual. Before you attend a gathering, grab a notebook and pen. That way you can write down whatever you want to look into later.",
    "capricorn": "May 10, 2025- You generally enjoy your dreams, Capricorn, both the dreaming process and analyzing them later. But tonight you might have too many to keep track of. While you will probably recall the most significant ones, it may be frustrating if you forget any of them. This might be the day to start a dream diary, if you don't have one. Have fun!",
    "aquarius": "May 10, 2025- Too many invitations to social events may come today, Aquarius. This might be one evening when you want to relax at home, but you won't want to say no to anyone. Analyze each invitation. Consider the location, host, other guests - whatever seems most significant to you. Attend only the ones you think you will really enjoy. Follow your heart.",
    "pisces": "May 10, 2025- Today you might work on your spiritual practice or studies, Pisces. You could read a book on the subject, attend a lecture, or practice some kind of discipline such as yoga or meditation. The only caveat is don't try to do too much at once. You could tire yourself out. Concentrate on one thing at a time. The information will still be there tomorrow!"
}