{
    "aries": "Nov 19, 2025- Love and romance are in your favor even though roadblocks may keep you from taking full advantage of the situation. You're being much too picky about the type of person you seek. Love isn't meant to be a set of desired qualities on a shopping list. You can't realistically create a scenario of how things will work out. Let things proceed naturally.",
    "taurus": "Nov 19, 2025- If things begin to stir, change, or fluctuate in love and romance, your first impulse is to overreact. This is probably the opposite of what you should do. Instead of quickly jumping to conclusions, you should sit back and let things slowly unfold. Resist the urge to make a move today just because your emotions are in an uproar.",
    "gemini": "Nov 19, 2025- When it comes to topics of love and romance, your feelings continue to be intercepted by words and opinions from others. What you want to keep private is suddenly made more public by mouths that just don't stop talking. Relax into the sensual element of love instead of getting caught up in more political aspects of the situation.",
    "cancer": "Nov 19, 2025- Certain areas of your life are expanding rapidly, causing you to lose touch with the more romantic aspects. The more you reach out in one direction, the more deprived you feel in the opposite direction. Perhaps you need more input as to where you put your energy. It's time to focus your attention on things that are working well instead of dwelling on things that are going nowhere.",
    "leo": "Nov 19, 2025- The time has come for you to take charge in matters of love and romance. This isn't often the case for you who normally like to let others take the lead in this department. A new phase has begun in your love life. You should think about expanding outward into new realms with new people and new circumstances, or both. It's time you were in charge.",
    "virgo": "Nov 19, 2025- You may be taking a back-seat approach when it comes to love and romance. This isn't necessarily a bad thing. In fact, this kind of attitude works to your advantage. By going with the flow and waiting for another to make the first move, you can spend more time on you instead of sending your energy outward toward others.",
    "libra": "Nov 19, 2025- Love may become more sensual. You should consider new ways in which to pamper your special someone. There may be gossip associated with your relationship that turns you off at first, but don't let that get in the way of expressing your true feelings. Real communication about this partnership will be primarily nonverbal.",
    "scorpio": "Nov 19, 2025- Your mind may be in an expansive mode now. Many things should be working for you. Your flexibility and ability to juggle many things at once should make tasks that require these talents a breeze. Unfortunately, they may not help too much when it comes to love and romance. You may not have the communication you desire with a close partner. You could find it easier to communicate with strangers!",
    "sagittarius": "Nov 19, 2025- Don't give up on finding the romantic partner of your dreams, because now is your chance. Talk is spurring you to take action. Don't be surprised if a bit of friction keeps you from jumping into the situation with both feet. Hang in there. Once you get below the surface, you'll find that there's much more to this person than first meets the eye.",
    "capricorn": "Nov 19, 2025- Be careful about declaring your love for someone when you haven't spent enough time with him or her to make that call. You may base this impulse on superficial encounters and brief conversations. You may not have the long history or deep discussions needed to know if this person is as ideal for you as you think. Don't be fooled by fast talk and high fashion.",
    "aquarius": "Nov 19, 2025- Issues of love and romance may be climactic now. You may be in a relationship phase approaching a major turn in the road. Perhaps there's a sudden breakdown in communication. Perhaps you realize that you rely much more on this person than you first thought. If you aren't intimately involved with someone, you should probably consider this a good situation for now.",
    "pisces": "Nov 19, 2025- You may be drawn to someone because of the things you share in common. You both appreciate art, music, and romantic dinners, but this person may not be a good permanent mate for you. He or she is unwilling to take the first step, or is indecisive about important issues. If you're uninvolved now, look for someone who challenges your quick wit and isn't afraid to make the first move."
}