{
    "aries": "Apr 18, 2025- A desire to make a big purchase might tempt you to overextend your credit cards and clean out your savings, Aries. You aren't usually one to act on impulse, so don't do it today. Make the purchase if you really feel you need it and it isn't going to cause any major setbacks in your financial situation. That way your pleasure in the item won't be offset by guilt.",
    "taurus": "Apr 18, 2025- Home might be a lonely place tonight, Taurus. The other members of your household may be out or out of town. You might not feel up to any carousing, so you will probably choose to stay home and read or watch TV. However, your natural gregariousness could cause you to feel abandoned. Call a friend and talk for a while. That will make you feel more like yourself.",
    "gemini": "Apr 18, 2025- Usually you're quite social, Gemini, but today you will feel like nothing more than working alone. Notwithstanding your wishes, however, you might be plagued with phone calls, visitors, and people wanting advice or help. Don't fight it. Go with the flow. Take care of what you need to and then spend the evening alone. Everyone has days like this.",
    "cancer": "Apr 18, 2025- Too much good food, good wine, and good conversation, Cancer? Not that any of this is undesirable, but you may be suffering from overload right now. Maybe you'd better get some rest and give your brain some time to sort through all the information you've taken in. Now you're probably having difficulty processing it all. Don't worry. In the morning you will be able to remember anything important!",
    "leo": "Apr 18, 2025- You usually don't mind being alone, Leo. In fact, you enjoy your own company. Tonight you're going to crave companionship. You could have an impromptu party in your kitchen, perhaps involving friends who are also business associates. Some fascinating conversations could take place about business and intellectual matters, as well as some deeper subjects that keep you thinking for hours or days.",
    "virgo": "Apr 18, 2025- This is the day to listen and observe, Virgo. There is a lot to learn from what's going on around you. You might be surprised at the impact of it. Too much talk now could prove fruitless and even set you back in some way, especially if talk is used to hide your insecurities. Keep your eyes and ears open. Tomorrow you can share what you learn.",
    "libra": "Apr 18, 2025- Are you going out tonight with friends who mean a lot to you, Libra? You might be tempted to eat and drink too much and spend too much money. Usually you have a pretty strong stomach, but this isn't the day to overindulge in partying. Go out for a little while, but then invite your friends to your house for coffee. That way you will feel good about the evening when you wake up tomorrow!",
    "scorpio": "Apr 18, 2025- What's driving you today, Scorpio? Why do you feel an obsessive need to get all your work done at once? If you're trying to impress someone, there's no need. Others already hold you in high regard. If the project you're working on is urgent, get some help. Don't try to do it all yourself unless you want to be too stressed out to accomplish anything tomorrow. Talk about counterproductive!",
    "sagittarius": "Apr 18, 2025- If you're attending a class tonight, do something frivolous for the rest of the day. Read romance novels instead of great literature. Otherwise, by the time you get to class you will already be suffering from intellectual overload and absorb very little of what you hear. Keep yourself hungry for knowledge until you get there. That way you will learn quickly and retain a lot.",
    "capricorn": "Apr 18, 2025- The desire to stay home alone and rest tonight might conflict with a need to go out with your friends, Capricorn. You may be too stressed to put up with gossip or too much intellectual stimulation. Tell your friends you will go out with them another time. All signs indicate that this is the wisest course for now. Relax with some hot chocolate and a pile of movies.",
    "aquarius": "Apr 18, 2025- There will be a lighthearted, almost silly energy in the air today, Aquarius. The Universe is encouraging you to give up your iron grip on that list of responsibilities and have some fun. Picture all the pressure you put on yourself as a ball and chain that you need to unshackle. There's no reason to take yourself so seriously all the time!",
    "pisces": "Apr 18, 2025- Pisces, plans to attend a lecture may have to be postponed because someone who's going with you feels under the weather. Overindulgence in food or drink may be the reason. This could be something you've wanted to attend for a long time, so make sure you know when and where the event will take place again. Either that or ply your friend with antacids and go anyway!"
}