{
    "aries": "Jun 11, 2025- In a philosophical or political conversation, you don't hesitate to offer your thoughts, Aries. Your examples may be extreme, but your principles are sound. You may get in over your head before you know it and suddenly need an escape route. Your first reaction may be to change the subject. It's better to admit you don't know the answer or don't understand the question.",
    "taurus": "Jun 11, 2025- You should be in a good mood, Taurus, although you might have a hard time fully expressing yourself. Perhaps you feel like there is someone keeping an eye on your every move. You may feel like a kid in class being watched by the teacher. Don't be intimidated by those with a self-righteous air. You have just as much right to speak your mind as anyone else.",
    "gemini": "Jun 11, 2025- You may get the feeling that despite all the hard work you've accomplished, something is still missing, Gemini. There's still a long road ahead, regardless of the goals you've attained so far. Perhaps the thing you're searching for is a tender moment with a loved one, something that's much closer than you think. Stop searching far and wide for the thing that's right under your nose.",
    "cancer": "Jun 11, 2025- Freedom may be a theme for you today, Cancer. You're beginning to question what it is you're trying to free yourself from. A person? Job? Commitment? These may be the very things you start to search for as soon as you're free of them. Trying to figure out what you want and need in life is sometimes easier said than done. Don't get stuck on one concept. Do your best to take things gradually.",
    "leo": "Jun 11, 2025- You're the liquid that takes the shape of its container, Leo. Even though this may seem like the most non-confrontational way to do things, you may find that it's actually a cause of great frustration for you and others. People may be annoyed that you're always following someone else's lead instead of taking the initiative. Try to be more assertive while continuing to be easygoing.",
    "virgo": "Jun 11, 2025- You may feel like a puppy that has been let outside for the first time, Virgo. The air is warm and you're full of energy. You're ready to run over the fields and hills. Unfortunately, you're tied to a stake and you can't move beyond a ten-foot radius. Your heart is ready to fly, but something beyond your control keeps you where you are. Start chewing the rope.",
    "libra": "Jun 11, 2025- You may feel a strange tension. It seems that nothing you say or do is quite right, Libra. As much as you may try to do the correct thing, you can't make things click the way you'd like. Try not to raise your expectations too high. Let go of the idea that things are going to work out exactly the way you want. You may not even know what's best for you in the end.",
    "scorpio": "Jun 11, 2025- It may be hard for you to maintain your self-discipline, Scorpio. Your childlike nature wants to go out and play. Emotionally, you're anxious to let loose and follow your playful, instinctual nature, yet your sense of responsibility is holding you back. This difficult internal tension may be the cause of irritation in many different areas of your life. Do your best to come to a place of balance and harmony.",
    "sagittarius": "Jun 11, 2025- If you're unclear about the topic of discussion, say so, Sagittarius. Asking questions is an important part of learning. You shouldn't be afraid to ask. Communication may take on a serious tone, and intellectual discussions are likely to get heated. Bring up political topics at the dinner table and give everyone a chance to speak on the matter. Don't try to change the subject in order to avoid the conversation.",
    "capricorn": "Jun 11, 2025- You may be shy when it comes to expressing your emotions today, Capricorn. This could be a rare thing for you. Other people may wonder if something is wrong. The truth is, you may feel like you need to calm down and focus more of your attention inward instead of directing it outward. Don't look to others to resolve your problems. Deal with them yourself. You're just going through an introspective period.",
    "aquarius": "Jun 11, 2025- You may not know which way to turn, Aquarius. You may be emotionally weighed down by sentimental feelings and memories that bind you to the past. You may also feel restricted by authority figures who've been around the block more times than you, and therefore feel they have the right to tell you how to run your life. Try not to let your thoughts get tied up in either of these scenarios.",
    "pisces": "Jun 11, 2025- Your mind may be going in many different directions, with fantastic ideas about how things should be done, Pisces. The difficulty is communicating these ideas in a way that makes sense. Others may see you as a threat to their authority. Perhaps they feel your ideas would undermine their plans, so they reject them. Don't give up. Fight for your right to be heard and respected."
}