{
    "aries": "Jan 14, 2026- Dreams and visions might give rise to the desire to be especially artistic and creative today, Aries. Ideas for new artistic projects could be popping in and out of your head all day, and you might go into a panic doubting that you'll ever have the time to make any of your ideas a reality. At this time, you can only write down whatever pops into your head in order of your own preference. Then work with each in turn.",
    "taurus": "Jan 14, 2026- Successes over the past several weeks, along with an increase in money, might give rise to the desire to improve your living situation, Taurus. You might have doubts, however, as to how best to go about doing it. Should you move or should you simply remodel? Should you move close by or to a different area? It's best to simply list the pros and cons of each option and then consider them all carefully. You don't have to decide right now.",
    "gemini": "Jan 14, 2026- Stress from whatever work pressures you've been experiencing might cause you to feel a bit under the weather. Yet you're probably unwilling to take some time off because you're too concerned about finishing what you're doing in a timely manner, Gemini. It's important to remember that you won't finish it at all if you exhaust yourself. Move slowly and steadily, take time out to relax a little, and all will go more smoothly than you think.",
    "cancer": "Jan 14, 2026- Blocks and obstacles that you may have reached with regard to your projects might cause you to wonder if you have what it takes to get them done at all, Cancer. This is OK, but don't get caught up in doubting your abilities. Step back, be objective, and work out the most practical and efficient ways to get past the obstacles and attain the results you want. Don't let your insecurities get the best of you.",
    "leo": "Jan 14, 2026- Although almost everything in your life seems to be going well, Leo, today you just might find yourself in a bit of a panic. You might have a temporary fit of fear that your luck won't last. However, this is most likely due to your deepest insecurities flaring up. Don't read too much into it, and don't pay any attention to the doubts expressed by others. Believe in yourself, continue to work hard, and keep moving ahead.",
    "virgo": "Jan 14, 2026- Today you might find yourself at a loss as to how to proceed with a particular task or project in which you're involved, Virgo. There might be a number of options open to you, all workable, and this could prove confusing. If all options are efficient and practical, don't agonize over your decision. Flip a coin if you have to! Success is strongly indicated if you don't stress yourself out in the process.",
    "libra": "Jan 14, 2026- Something may be troubling a family member, Libra, and this person doesn't seem inclined to talk about it. Your intuition seems to be temporarily blocked, so you can't figure it out for yourself. Don't try; it's probably buried too deeply within the other person. Make it clear that you're there if needed and then allow this person to go his or her own way. Don't let this situation cause you to doubt their need and respect for you.",
    "scorpio": "Jan 14, 2026- Today you might feel as if you're living in a fog, Scorpio. Some interesting but puzzling news may come your way today. It might be information of such a bizarre nature that you find it difficult to accept, yet your source could be more than reliable. Conversations with others might seem vague and uncertain, as those around you aren't really feeling all that communicative. You might have to rely on intuition to discern how they're feeling.",
    "sagittarius": "Jan 14, 2026- Unexpected premonitions and gut feelings might prove too strong for comfort, Sagittarius, especially if they sense upcoming events that aren't all that pleasant. These feelings are sent to you not to worry you or cause upset but to give clues as to how to deal with the possibilities. You may also have to deal with your own self-doubt. Dig in, do what you can, and assure a positive outcome. Remember, it's possible to spin straw into gold!",
    "capricorn": "Jan 14, 2026- A goal that you've been working toward for a long time and in which you've placed a lot of hope and confidence, may suddenly seem in doubt today, Capricorn. This doesn't mean it's dead in the water by any means. It only means that for now you just need to work a little harder and rebuild your faith in it. Tomorrow your doubts could well be a thing of the past. Work hard and hang in there.",
    "aquarius": "Jan 14, 2026- A partner or colleague might be going through some changes right now, causing you to wonder if you have a future with this person. It might appear that you're moving ahead while this person is lagging behind. This could be just a temporary condition, Aquarius, so take care not to jump to any conclusions at this time. Offer your assistance and do what you can, then let the person work things out. This may pass in a few days.",
    "pisces": "Jan 14, 2026- At this time you might be in the space where you tend to doubt concepts and attitudes that you've accepted all your life. You generally tend to be a service-oriented person, Pisces, and today you might want to help out someone close to you. Yet this person may have deeply buried issues that only he or she can deal with, and therefore might give the appearance of being unappreciative. Rest assured that this is not the case."
}