{
    "aries": "Jan 17, 2026- You probably pay a great deal of attention to what other people think of you, Aries. It may often be hard for you to make decisions in delicate situations for fear of being misjudged, even if you know you must. You may run into this dilemma as you go about your day today. Trust your own good judgment. It may be much more important to be decisive today than you can even imagine.",
    "taurus": "Jan 17, 2026- You probably enjoy exploring the innermost recesses of your own human nature, Taurus. Yet today you may need to be a bit more rational. In your personal life, you may feel as if you've been beaten at your own game and this has weakened you. Why not take advantage of this to bring your partner with you on one of your voyages inside yourself?",
    "gemini": "Jan 17, 2026- On days like today it's important to take time out to reflect upon the events of the past few days, Gemini. Is it possible you've decided to change certain things about yourself and your behavior? If you could just devote a few minutes a day to all the little details in your personality, the changes will go much more smoothly. The atmosphere today may help you think about this.",
    "cancer": "Jan 17, 2026- Over the last few weeks, you may have made some good progress in learning to express your emotions, Cancer. The great thing is that you probably didn't even notice! But if you aren't careful, there may be some bullheaded person around you today who may try and destroy all the progress you've made. Don't confuse controlling your emotions with repressing them. It's up to you to protect all the progress you've made.",
    "leo": "Jan 17, 2026- There's no need to go pounding your head against a wall, Leo, your day will be challenging, but it's nothing you can't handle. The planetary configurations today will push you to lay the foundation for the projects you've been planning over the last six months. Go with the flow. People sometimes think that you are good at lighting fires but lousy at keeping them going. It's time you proved them wrong!",
    "virgo": "Jan 17, 2026- Today, you may find you have a certain gift for productivity. Everything you touch turns to gold, yet you may be under the impression that you can't provide everything you need for yourself. So what do you do? You start buying everything in sight! Today you might want to think about this bad little habit of yours, Virgo. You may be tempted to go on a big shopping spree. But you won't be very happy with yourself when you get the credit card bill!",
    "libra": "Jan 17, 2026- Today the people around you could seem much more serious than usual, Libra. You could even decide to get away from them and go hide out just for the day, for example, in a movie theater watching an afternoon film. But you won't find the movie you want to see. Don't try and run away from the gravity of the moment; you may become even more serious than the people you are running away from.",
    "scorpio": "Jan 17, 2026- You could find the atmosphere today a bit oppressive, Scorpio. The time has come to deal with some of the important questions you may have been avoiding for quite some time. It could be especially important to take a look at your life at home and see what you can do change the negative atmosphere that has come into your life over the past few weeks. Compromise can be a good thing, but not at the cost of your values and beliefs.",
    "sagittarius": "Jan 17, 2026- You may be a specialist at manipulating concepts and ideas and using your analytical skills to understand any problem that comes your way. If this is true, Sagittarius, people have probably already told you that thinking is fine, but there is a moment when you have to put all that thinking into practice! The position of the planets today invites you to think about this.",
    "capricorn": "Jan 17, 2026- Today begins an exciting period in your personal life, Capricorn. It's time for new beginnings in your relationship. You may be ready to make the changes you and your partner have been considering for quite some time. Moving in together, doing some construction on your house, buying a summer home, or perhaps even having a child - start making those plans that symbolize the stability of your relationship.",
    "aquarius": "Jan 17, 2026- If you have been having problems in your relationship or love life in general, Aquarius, don't expect things to get any better today. The people around you might find you extremely irritable! It may seem that anything anyone says gets on your nerves. Even the sweet nothings that your sweetheart whispers in your ear seem like a bunch of hot air! But you will be forgiven for your irritability, and besides, not every day can be as passionate and loving as you'd like it to be.",
    "pisces": "Jan 17, 2026- This could be a very studious day for you, Pisces; actually, it might be better to call it laborious. But you love to work, and you will get all the work you can handle today. It's a good day to work on all those things in your life that still need a little attention in order to stand on their own, the things that haven't quite found a permanent place in your life, like some of your relationships, for example."
}