{
    "aries": "Nov 17, 2025- Love and romance are going marvelously well today. If you're attached, affection continues to grow between you and your partner. A strong sense of unity could lead to a firm commitment. If you aren't currently involved, don't be surprised if someone you like but don't know well suddenly seems attracted to you.",
    "taurus": "Nov 17, 2025- You tend to be intellectually inclined. Today you might put some of your knowledge to work in a creative way. Your intuition and imagination are working overtime. If you've been thinking about starting a new project, this is the day to do it. The only downside is that you could get so obsessed with your work that you can't concentrate on anything else. Pace yourself so you don't burn out.",
    "gemini": "Nov 17, 2025- A loving, supportive letter or call from a close friend could be just what the doctor ordered today. You may feel overworked and a little pessimistic about any plans you've made. Your friend should lift your spirits and motivate you to push on ahead in spite of whatever obstacles you encounter. Remember this kindness. Your friend may need the same from you sometime in the future.",
    "cancer": "Nov 17, 2025- Today you may come up with some attractive new ideas to advance your career and increase your income. The only question is whether or not you can follow through. Some of them may be workable and some may not, but if you're serious, you should do some research to figure that out. The future looks good if you take the necessary steps to turn your ideas into reality.",
    "leo": "Nov 17, 2025- Today you might experience a rush of spiritual insights. Whatever comes to you seems clear and right, and it could inspire music, poetry, or painting. The only problem might be that these insights may disappear if you don't write them down right away. Visions from the other side can be ephemeral. If you like what's coming to you, keep a record of it. You'll be glad you did.",
    "virgo": "Nov 17, 2025- Today you could receive some unexpected good news regarding the impending arrival of money that you've anticipated for a long time. This will be very welcome news and worthy of a celebration, although you still might not believe it. Believe it! Your long wait is over. Now you have to resist the temptation to spend it all in one place.",
    "libra": "Nov 17, 2025- A social event today could put you in contact with some old friends who mean a great deal to you. The occasion will be very warm and friendly, though you may feel a little subdued. Never mind! Sometimes companionable silence is preferable to forced talk. Just bask in the presence of cherished companions and listen to what others say. You'll enjoy yourself that much more.",
    "scorpio": "Nov 17, 2025- Working closely with someone might bring up some strong, warm affection between you. It may or may not be a romantic attraction, but if it is, don't read too much into it now. The situation is creating the emotions. There's the chance that the attraction could pass by tomorrow. But you've probably found someone with whom you can collaborate harmoniously. That's important!",
    "sagittarius": "Nov 17, 2025- Love, affection, and romance seem to be all around you. Strong unity with close friends, family members, and your romantic partner may well up throughout the day. You can also expect a rush of imagination and artistic inspiration, perhaps generated by the support of those around you. Any relationships formed now will last a long time. Recall this day when times get tough.",
    "capricorn": "Nov 17, 2025- Strong psychic impressions about absent friends or family members may come to you today. All are apt to be positive, though you might find it disconcerting. You might even think it more so if you learn your intuition was right! This tendency may continue for a while. Your sensitivity to others' thoughts and feelings is increasing. It can contribute to your understanding of them. Make the most of it.",
    "aquarius": "Nov 17, 2025- Today you could intuit powerful feelings of affection from someone you might be romantically attracted to. You could feel a rush of exhilaration from this experience before your skeptical side kicks in to say it's all wishful thinking. A little skepticism is healthy, but don't let it overpower your positive impression. All signs say that what you sense is true. Follow your heart.",
    "pisces": "Nov 17, 2025- Your kindness and good manners could pay off today. Someone who respects you a great deal might offer you an opportunity to advance that increases your income. You may have known this person for a long time, and the two of you work well together. This opportunity should be welcome and not intimidating. Go for it! If you do, the future will be rosy."
}