{
    "aries": "Jun 23, 2025- If anyone is capable of dealing with the intense emotional energy of today, it's you, Aries. Other people may be angry and unable to stomach the sensitive issues that may arise. Take care, since there may be some major opposition coming at you that disrupts your plans. You will face a practical, grounding force that questions your methods of operation. Use these lessons to your advantage.",
    "taurus": "Jun 23, 2025- Stubborn forces may challenge your easygoing nature today. You would do well to tap into this aggressive energy and use it to follow through on some projects that you've left hanging, Taurus. Other people may be unyielding in their positions, but you can easily overcome this by tapping into your flexible, adaptable nature. Don't get upset and restless. Go with the flow.",
    "gemini": "Jun 23, 2025- Tune into the aggressive energy of today, Gemini, and use it to push your intentions forward. Today's emotional intensity will bring you to your knees if you aren't careful. The secret is to harness the energy and use it to your advantage. Try not to get caught between the crossfire of conflict. Tap into the slow-moving, generous force that's helping you ground your thoughts and emotions.",
    "cancer": "Jun 23, 2025- This is one of those days in which you need to act or else you will be acted upon, Cancer. Stubborn, aggressive forces are working counter to your aims. You will find yourself swept up in the thick of things if you aren't careful. Don't get too worried about what other people consider wrong. Have confidence in what you know is right.",
    "leo": "Jun 23, 2025- The intense energy of the day is helping you streamline your projects and solidify your thoughts, Leo. Work to manifest the ideas and dreams that constantly swirl in your head. Today is a great day to bring your mind into focus and get down to the nitty-gritty. Clean up the scraps off your plate and make room for the next gourmet course to be served.",
    "virgo": "Jun 23, 2025- Suddenly your emotions are much more intense, Virgo. You notice that people are on edge and they're likely to go to extremes in all situations. This is one day to do things with passion. If there is any sort of detective work you need to get done, now is the time to do it. Try not to start any arguments. Others aren't likely to back down. All-out wars are likely to ensue.",
    "libra": "Jun 23, 2025- There's a strong force working to oppose you today, Libra. Another's unbending attitude may be holding you back from things you're trying to accomplish. Take the time to see the other side of the situation. You can gain a great deal of perspective and come to a healthy point of balance, thanks to the events of the day. Don't back down from your viewpoint just because everyone doesn't agree with you.",
    "scorpio": "Jun 23, 2025- There's an intensity about the day that may cause you to recoil from certain events and conversations, Scorpio. Issues could get uncomfortable and perhaps a bit too involved. Other people may want to go to places that you don't want to go to. Don't get upset or frustrated. Either join in and roll with the punches or walk away and deal with the issues later.",
    "sagittarius": "Jun 23, 2025- You would do well to join the intensity of the day, Sagittarius. You have the ability to unravel any riddle and find the underlying cause of any dispute. There's a great deal of potential for you to follow through on some major projects today. Work to press through with your ideas. Don't back down. Your sensitivity is your greatest asset. Feel free to express your emotions.",
    "capricorn": "Jun 23, 2025- Today might end up being quite combative, Capricorn. There may be people opposing you from all sides. There are apt to be some serious disruptions to your daily routine. Others may be quite stubborn, and you're apt to fall into a situation in which no one is willing to back down. Whatever happens, you will be called upon to act. This will most certainly be an eventful day.",
    "aquarius": "Jun 23, 2025- Your flexibility will be tested today, Aquarius. You may end up twisting and flexing your body to fit the contours of the day. You will find that if you join forces with the powerful movers, you will get quite a bit done and be successful. Don't be intimidated by the intensity of other people's emotions. You will find strength in your calm, grounded self.",
    "pisces": "Jun 23, 2025- You may have a hard time figuring out why everyone is so worked up today. Don't waste your time, Pisces. You're better off accepting that things simply are the way they are and allowing other people to have their drama. Your job is to maintain balance. This may be easier said than done. You're working with some pretty intense issues, but nothing you can't handle."
}