{
    "aries": "Jan 21, 2026- Study of religion and spiritual matters could well be of particular interest for you today, Aries. You're likely to discuss your knowledge and beliefs regarding such matters with a close friend, which could prove rather enlightening for both of you. Whatever you learn will prove to be artistically inspiring, so don't be surprised if you find yourself spending some time writing down your thoughts or turning them into pictures. Don't limit yourself!",
    "taurus": "Jan 21, 2026- Today communication with others is more likely to be on a subtle rather than verbal level, Taurus. When the phone rings, you might already know who's on the other end of the line before you pick it up. You could also pick up telepathically on the thoughts of others. Books and articles about people who have had similar experiences could increase your understanding of them. Don't fight it! Go with the flow.",
    "gemini": "Jan 21, 2026- Inspiration drawn from recent religious or spiritual occurrences could have you writing down accounts of your experiences, Gemini, perhaps with the idea of someday publishing them. Your concentration could well be intense, as writing for you today may not be only creative but therapeutic as well. It will also help to attend classes or workshops or simply to discuss the subject with a friend. Knowledge is essential.",
    "cancer": "Jan 21, 2026- You should be feeling especially strong and healthy today, Cancer. The drive to exercise, particularly if you do it alone and outdoors, is likely to get the endorphins going and thus give you a natural high, which could lead to an increased level of inspiration and intuition. After you finish, it might be a good idea to sit in a park, preferably near water, to allow yourself to come down. Meditate and take a close look at your inner state.",
    "leo": "Jan 21, 2026- Today, Leo, you might find yourself picking up uncanny telepathic messages from a friend who lives some distance from you. A telephone call might reveal that this person has just received some good news, and that they were just thinking of calling you! This probably won't be the only ESP experience you have today. Your level of intuition is very high, so be prepared for some unusually strong psychic messages.",
    "virgo": "Jan 21, 2026- Creative inspiration flows freely today, Virgo, enabling you to channel it in more than one way. An opportunity to earn a sizable fee doing something artistic could come your way. Spiritual or metaphysical studies may be involved. This might represent the attainment of a long-term goal you've been striving to reach, and therefore you're apt to be rather excited about it. Tonight, go out and celebrate your success with your friends.",
    "libra": "Jan 21, 2026- Usually you prefer to approach events with a practical and scientific attitude, Libra, but today you're feeling especially intuitive and more aware of the other worlds, so it might be difficult to hang on to your usual mindset. Some uncomfortable feelings you've had about events in the news could prove to be accurate, which might be a bit disconcerting. Remember that there is so much in the Universe that can't be explained through logic or science!",
    "scorpio": "Jan 21, 2026- If you've been thinking about taking up the study of astrology, numerology, alchemy, or any other occult science, this is the day to get started, Scorpio. Scientific adherence to facts and rules combines with enhanced telepathic abilities to bring about a burgeoning skill in such fields. Look up some friends who share your interest and arrange to attend a class or workshop on whatever subject appeals to you the most. At day's end your mind could be spinning!",
    "sagittarius": "Jan 21, 2026- Some rather intense and vivid dreams could inspire you to embark on some in-depth study of a subject that specifically interests you, Sagittarius. This could involve the arts, philosophy, or metaphysics. Travel plans to one of the world's great spiritual centers, such as Jerusalem, Glastonbury or Vrindavana, might be on your mind as a result. Your level of intuition is very high today, so whatever you dream of doing, give it some serious thought. It might be just what you need!",
    "capricorn": "Jan 21, 2026- Romantic relationships take on a fairytale aura, Capricorn, bringing up the kind of desire, passion, and sense of unity associated with Lancelot and Guinevere. Therefore, this should be a wonderful day to schedule an intimate evening with a romantic partner. You could feel so much in tune with your friend that you may come with the same words at the same time. Enjoy this wonderful feeling, but don't lose sight of reality.",
    "aquarius": "Jan 21, 2026- Today you might attend more than one group activity or social event involving spiritual or metaphysical matters. Your sense of intuition is very high, Aquarius, and your level of understanding is especially acute. Therefore, concepts that could be confusing at other times could seem as clear as a bell today. You might form strong bonds with others who are also present, and you might make plans to meet with them again in the future. Enjoy!",
    "pisces": "Jan 21, 2026- Intellectual or artistic work could take up a lot of your time today, Pisces. Your level of inspiration is high, and you're apt to be full of ideas that others would find beneficial. You're also likely to sense the thoughts and feelings of those around you before they themselves are consciously aware of them. This not only increases your career standing, it can help you in the love department. Enjoy your day!"
}