{
    "aries": "Jun 28, 2025- Latch on to what your mind has to say today, Aries. More than likely, your rational brain knows the right way to go. Your mood may dictate the action, but let your brain handle the steering. Don't get overly worked up over nothing. Tempers may rise in heated debates over what is and isn't fair. Be part of the solution, not the problem.",
    "taurus": "Jun 28, 2025- There's a greater burst of energy coming your way today than there has been in a while, Taurus. It's as if you're making a new start and now is your chance to begin with a fresh new attitude. Realize that a sensitive nature is what will help you be victorious on this day. Keep your mind focused inward while you pursue outwardly directed activities.",
    "gemini": "Jun 28, 2025- People and situations egg you on today, Gemini. It may seem like there's contention around every corner. Remember that your path is the one that you chose. You may or may not have anticipated the barriers, but they're unavoidable. The key to success is to strike the right balance between inner and outer activities. Don't direct all your frustration at others. Don't hold it all in, either.",
    "cancer": "Jun 28, 2025- Be a pioneer in your world today, Cancer. Go on an adventure with a courageous spirit. Your emotions are fired up and ready to go. Your instincts are ready for a new challenge. If anything slows you down today, it will be your rational thinking. Your self-protection mechanism may kick in just when things start to get exciting. Strike the right balance.",
    "leo": "Jun 28, 2025- Your mind is surprisingly clear today, Leo, and your thinking fits in line with what your ego has set out to accomplish. The key for you is to let your emotions speak. Take charge and let yourself go after what you want. While you've spent the last couple days in contemplation, the next few days should be more action oriented.",
    "virgo": "Jun 28, 2025- Your mood is likely quite good, Virgo, and you have an added boost of self-confidence that will help you along in just about any project you undertake. While the last couple days may have felt slow and a bit stagnant, today you're ready to take action. Someone has just lit the pilot light and now you're ready to fire up again.",
    "libra": "Jun 28, 2025- Your brain may be on one side of the fence today while your emotions are on the other, Libra. The challenge will be to find a working resolution between them. Your mind is moving toward a more sensitive and receptive approach, while your heart is in more of an attack mode. Unfortunately, these two energies don't normally work well together. Your job is to find a healthy balance.",
    "scorpio": "Jun 28, 2025- One of the themes today is giving versus receiving. You may be asked to handle many tasks at once, something you're naturally quite good at, Scorpio. There's a strong need to take action and get things done, while you may also feel a strong inward pull asking you to settle down and reflect. Both are valid emotions, and both should be honored as you go through your day.",
    "sagittarius": "Jun 28, 2025- You're in line with your warrior instincts today, Sagittarius, which reminds you to align with your dreams. The tricky part is how you're going to plan your attack so that there's an equal balance of give and take. Today's prevailing energies may catch you in a difficult situation. Sometimes an outwardly directed, argumentative approach is the only way to push through the roadblock.",
    "capricorn": "Jun 28, 2025- You're feeling frisky today, Capricorn, and you're happy to take the lead. It seems like the starting gate has just opened and you're leading the charge. The one thing that could put a damper on the race is your rational mind reminding you that it's also important to stop. Look around and reflect on what's going on around you. Incorporate both energies into your day.",
    "aquarius": "Jun 28, 2025- You're feeling rather sensitive today, Aquarius. You may want to rescue every injured animal from the side of the road. Combine this nurturing, loving instinct with a warrior drive that will take charge and lead the fight. This powerful energy duo is very action oriented. Send your loving, internal instincts out into the world to do good.",
    "pisces": "Jun 28, 2025- Other people may be stroking your fur in the wrong direction, Pisces. There's a great deal of fiery energy in the air today that's promoting a \"me first\" attitude. It may come in direct conflict with your peaceful, diplomatic nature. Also, people may be a bit more sensitive than usual. It will be harder to stomach the slights or insults that result. You have your work cut out for you."
}