{
    "aries": "Jun 1, 2025- The day may be somewhat oppressive, Aries. It's possible you will receive some unpleasant news related to your domestic life. Perhaps in the past few years you haven't been especially careful about your home budget. Or you may have postponed an important maintenance task for too long. While this may not be the day the roof literally falls in, it's time to take care of repairs.",
    "taurus": "Jun 1, 2025- You seem frustrated today, Taurus! There's only one person who could possibly arouse your anger to such a degree, and that's you. Today's aspect is favorable for crises of conscience that result in a change of attitude. You're likely to remember to choose your words more carefully from now on.",
    "gemini": "Jun 1, 2025- This is a contemplative day, Gemini. You seem to be developing new techniques, means, therapies, and methods to use in your main occupation. Today you're likely to question your underlying reasons for so much innovation. Why reinvent the world? Although you may not make any major changes in your activities, you could find new justifications for them.",
    "cancer": "Jun 1, 2025- You will have to expect the day to be somewhat frustrating, Cancer. Your friends may insist that you be more cooperative and less individualistic. They could resent your refusal to be part of the team. In fact, your rebelliousness may be earning you quite a reputation! How you deal with these clashes will set the stage for your future. Think carefully before taking action.",
    "leo": "Jun 1, 2025- You mustn't expect to do whatever you like today, Leo. Quite the contrary! You may be restrained by technical limitations. Perhaps your financial resources will be insufficient. In other words, you won't be able to follow your usual pattern of taking refuge on a spiritual island and quietly contemplating your inner thoughts.",
    "virgo": "Jun 1, 2025- Science, space exploration, and certain other fields require the participation of all with a very strong team spirit. Stubborn as you are, it doesn't make you the greatest specialist in group dynamics. Certainly no one would ever accuse you of enjoying working in a group, unless you're the one in charge. Just such a miracle is possible, Virgo, provided you take the first step.",
    "libra": "Jun 1, 2025- What good does it do you to resist change, Libra? Everyone knows that you have trouble adapting to change in the world around you. Unfortunately, that's life and you can't do much about it. However, you aren't powerless. You will find that life is more stable when you can surf the waves of change. Embrace change and make it work for you rather than resist it all the time.",
    "scorpio": "Jun 1, 2025- If you work in a helping profession such as psychotherapy, you're probably breaking quite a few rules and protocols right now, Scorpio. You may even be going against theories that were a fundamental part of your education. Don't be troubled by your rebelliousness. It's important that the status quo be challenged from time to time. It's people like you who advance the field!",
    "sagittarius": "Jun 1, 2025- You don't have to be a genius or do something extraordinary in order for people to notice you, Sagittarius. It's time you abandon the notion that you can't play a musical instrument because you don't have perfect pitch or that you can't sculpt because you don't have Michelangelo's genius! Dare to engage in any hobby or interest that you fancy.",
    "capricorn": "Jun 1, 2025- You aren't free enough, Capricorn. This is especially true in your relationships. With the current astral energy, you can expect to break free of your chains. It's time for you to participate more in life. Speak your mind. Tell people what you want and when you want it. Surely one of your desires is freedom. Overcome your fear of rejection and ask for it! It really is as simple as that.",
    "aquarius": "Jun 1, 2025- If you were in charge of a company's human resources department, Aquarius, today you would begin to completely overhaul the recruitment procedure. You would focus more on the human element rather than any diplomas and awards people wave around as evidence of their abilities. Confidence in people combined with trust in your instincts could prove profitable in more ways than you imagine.",
    "pisces": "Jun 1, 2025- Pisces, the romantic side of your life may be rocked by a storm of emotion. You may go from intense rage to ecstasy in an instant. The day may instruct you to get hold of your emotions. If you hope to build a stable relationship, it's necessary to maintain psychological coherence and physical health."
}