{
    "aries": "Jan 31, 2026- Use today's powerful energy to cut to the heart of the matter and strip away the façade that’s currently doing more harm than good. Open yourself up to the world, Aries, and show the people around you that you have a great deal more to offer than you’ve been revealing. Take a controlling role in the situation at hand and let your needs be known. You’ll find that your daily life will improve tremendously when you communicate your needs.",
    "taurus": "Jan 31, 2026- Try not to get blown off course by the fire that seems to be raging around you, Taurus. Ultimately, you know what’s right and what’s wrong, so don't compromise yourself or your sense of pride. Keep an eye open to what is going on in your circle, but don't feel like you need to chime in with a certain course of action that doesn't ring true with your inner self. Control what you can, but don't worry about the other situations.",
    "gemini": "Jan 31, 2026- Pick yourself up by your bootstraps and go in for the kill today, Gemini. You’re in a terrific position to make some strong and lasting impressions on others. Any sort of group work is especially favored. There’s a powerful boost behind your actions, so be careful where you aim your weapons. Initiate action in the places where issues seem to be stagnating. Transformation is a key aspect to healthy growth. Today is an excellent day to pursue such important goals.",
    "cancer": "Jan 31, 2026- Your emotional nature may seem revved up for action today, Cancer, although it could be that you don't know what direction to drive in. The engine is running, but for some reason the windshield looks a bit cloudy. Try to key into the areas in your life that need a major overhaul. Look to transform them for the better. Once your windshield is clear, kick your motor into gear and go for it. Initiate the action or else you may find yourself being acted upon.",
    "leo": "Jan 31, 2026- There is a tremendous amount of power at your disposal today, Leo, and you should take care and use it wisely. This is quite a transformative period for you, and your body may be going through many changes. You have the ability to make an extremely strong impression on people today, so think before you act. This energy can manifest as an accident or something unhealthy if not used properly.",
    "virgo": "Jan 31, 2026- There may be a big conflict in your life that you seem almost powerless to control at this time, Virgo. It could feel like a war is raging around you and all you want is for it to stop. Whether you realize it or not, you do have a part to play in this situation and you certainly do have the power to affect the outcome of this quarrel. Take responsibility for your actions and step up to the plate.",
    "libra": "Jan 31, 2026- There is a powerful force that seems to be working against you today, Libra, but realize that you do have the power to produce a positive outcome. Use this conflict to find balance in an unstable situation and try not to rock the boat too much with your superiors. You have a great deal of fire under your belt today and your actions are especially powerful. Consider enrolling in a class or seeking a path of spirituality.",
    "scorpio": "Jan 31, 2026- People may seem especially insensitive to your feelings today, Scorpio, but try not to get down on them about it. You may feel a sudden urge to act out in a physical manner, and you should do it, but in a constructive way. Get out of the house and take a walk or jog by a lake or river. Open your mind from the cage it’s been sitting in and get some perspective on your life.",
    "sagittarius": "Jan 31, 2026- Go for the gusto today, Sagittarius. Nothing can stop you. You’ve got a tremendous amount of power at your disposal, so use it wisely. You can accomplish a great deal and make extremely positive transformations in your life. Your physical vitality is especially strong and your sex life may be especially active. Make sure to share with others the enthusiasm you exude. You aren’t the only person alive on this planet, so spread some of that love around.",
    "capricorn": "Jan 31, 2026- You may have the sense that something is going on around you that you just can’t seem to grab hold of, Capricorn. Your mind is bouncing this way and that as if you’re watching a ball in a tennis match. Things may be changing rapidly around you. You could feel like it’s time to jump on the bandwagon. Look before you leap, and go with the flow. Remember that the best decisions aren’t always made with the brain; sometimes they’re made with the heart.",
    "aquarius": "Jan 31, 2026- An opposing person or situation may rear its head today, Aquarius. Realize that you can draw on the same energy that’s causing them to act and state your point of view for the record. Stand up against this force and let your viewpoint be heard. Sometimes it’s necessary to be a bit rough and outspoken in order to bring peace and balance to an unstable situation.",
    "pisces": "Jan 31, 2026- Today is a great day for transformation, Pisces, and your actions have deeper than usual inner meaning. Be careful where you aim your arrow, because the tip of it has extra sting today. People might be rubbing you the wrong way, making you feel like you’re a pot of water on a hot plate. The heat is turned up and the cover is about to blow. Make sure you don't hit anyone when the lid flies off."
}