{
    "aries": "Feb 18, 2026- An emotional issue with a family member could have you wanting to run away and hide, Aries. Don't fight the urge. This may be just what you need in order to clear your mind regarding the problem and heal your wounded psyche before you face this person again. You might also receive some rather disconcerting revelations about yourself and old traumas that you’ve long since forgotten. Don't fight these either. Simply release them.",
    "taurus": "Feb 18, 2026- Emotional issues rooted in the past could leave you feeling inhibited today, Taurus. You might also be a bit more touchy than usual and see insult where none is intended. Curb the impulse to take offense. Try to confront and release the old issues or at least promise yourself you'll deal with them later. Then be very sweet to your entourage. You should be feeling more positive by day's end.",
    "gemini": "Feb 18, 2026- Friction or other trouble on the job could cause you to want to quit, Gemini, but worries about money might keep you from doing it. You definitely need to reassess your situation. Perhaps a change of position is just what you need now. You may have untapped talents that could make you more marketable, and you might also want to train those talents. Think about this! And if you really think you want a change, go for it.",
    "cancer": "Feb 18, 2026- Your self-confidence could well be in the pits today, Cancer. Mistakes from the past could come back to haunt you, and you may be momentarily overcome by the fear that you'll make similar errors again. Force yourself to be objective before you drive yourself crazy. It could cause you some unnecessary problems. Try to realize that you’re unique and that you have skills and talents that set you apart from everyone.",
    "leo": "Feb 18, 2026- Generally, you tend to be a very physically oriented person, Leo, but today you’re more likely to want to look within, perhaps to experiment with your own psychic abilities or study spiritual concepts. You also might find yourself more interested than usual in the arts, particularly that which comes from other cultures. You'll be far more contemplative today than usual. It might prove enlightening to write down your thoughts.",
    "virgo": "Feb 18, 2026- Financial considerations could delay the start of a new project that you’ve wanted to begin for a long time, Virgo. Perhaps you don't quite have the funds you need, or maybe the cost is a bit higher than you expected. Don't sink into despair. This is only another temporary delay. Tighten the budget and make substitutions. Use your innate ingenuity to work around it and the project should be right on schedule.",
    "libra": "Feb 18, 2026- The day may be temporarily plagued by scandal of some sort, Libra. Some of your entourage, particularly women, may gather in conspiratorial gossip. Your curiosity will definitely be aroused, but don't be tempted to join them. There is more to the situation than meets the eye, and you'll want to know all the facts before jumping to conclusions. Concentrate on your own interests and worry about the scandal later!",
    "scorpio": "Feb 18, 2026- You’re intuitive by nature, Scorpio, but today you’re likely to have a rush of psychic premonitions. Insights into your own character could bring old traumas to the surface so you can release them. Your dreams could be especially vivid and rather disconcerting, although not in a negative way. Write them down. Your aesthetic sense is also very high. Don't be surprised if you discover that you're rather partial to Impressionist art!",
    "sagittarius": "Feb 18, 2026- Sex and romance are very much on your mind today, Sagittarius. You’re feeling especially passionate, and your emotions are rich and deep. At times like this you’re likely to want to concentrate on your own pleasure, yet it’s important to be sensitive to your partner as well. Racy novels and movies could be especially appealing, and you might toy with the idea of shopping at Victoria's Secret. Go for it!",
    "capricorn": "Feb 18, 2026- A family member could be feeling a little down, Capricorn, and you may be tempted to give him or her a pep talk to get them going again. Don't. They won't respond to it, and this could create tension in the home. Your own self-confidence is probably at an all-time low. You tend to be your own worst critic in the best of times, but today you're a bit confused. Try to be fair to everyone around you, especially yourself.",
    "aquarius": "Feb 18, 2026- Too much exposure to books, newspapers, and computers today could produce eyestrain headaches, Aquarius, so try to exercise a little caution when working with small print or computer text. Thoughts of love and romance could interfere with your ability to do your work effectively. You may be tempted to spend most of your time on the phone. We all have days like this, so don't fight it. Just make sure you're feeling great when the evening rolls around!",
    "pisces": "Feb 18, 2026- By nature you’re a master psychologist, Pisces and you don't need to know someone well to accurately assess his or her thoughts and motives. Today this ability goes far beyond psychology and borders on the psychic. People's feelings may jump out at you. Reading newspaper headlines gives you uncanny ideas about the future. You could also experience some intense and vivid dreams. Make a careful record of the symbols in your dreams. You’ll be surprised at what they tell you."
}