{
    "aries": "Dec 31, 2025- You may be feeling a bit overwhelmed with the combination of professional and social obligations. If you're doing any entertaining tonight, see if you can drum up some extra help. Cater part of the dinner, if possible, or at the very least hire someone to help with the dishes. It's hard enough to entertain and keep the guests happy. Don't try to be a superhero.",
    "taurus": "Dec 31, 2025- You could be feeling the push-pull of internal desires versus external demands today, Taurus. As much as you want to stay in bed today, with covers pulled tight to your chin, the world is clamoring for your attention. Your phone rings off the hook and your email box fills as quickly as you can empty it. Just for today, you wish everyone would go away. Alas, no such luck. Promise yourself that you'll indulge some relaxation once you get home. Hopefully, no one will come pounding on the door!",
    "gemini": "Dec 31, 2025- When it comes to home improvement, there is something to be said for immediate gratification. Today you could find yourself heading out to do some necessary shopping. Think carefully about what will truly improve your home over the long run, Gemini. Fashions come and go, and following them can be an expensive undertaking. You would be better off buying only those items that match your true style. You may not purchase as much, but what you do buy will have lasting value.",
    "cancer": "Dec 31, 2025- You really don't need to prove anything to anyone, Cancer. You may be feeling under a bit of pressure to get a lot of work done. But some projects, especially those that require creativity, simply can't be rushed. You will find that if you take your time and allow your muse to work its magic, you will produce something of real merit in the end. If, however, you try to rush, your time will likely be spent in vain.",
    "leo": "Dec 31, 2025- You have so many talents and such a range of abilities, Leo, that sometimes it's hard for you to know where to devote your efforts. Today, don't make your usual mistake of trying to do everything. Even you have your limits! You would be better off taking a step back from the situation to prioritize your enormous \"to do\" list. Concentrate on just one or two important tasks rather than mingling big jobs with small ones.",
    "virgo": "Dec 31, 2025- It seems that you're ready for a major change in your life, Virgo. But take care that you don't implement change merely for the sake of change. Think carefully about what you really want to do. Some introspection just might reveal that the changes you seek are minor rather than major. You may simply want to begin working on your health a bit more. Jogging a few days a week and vowing to eat salads at lunch rather than sandwiches may bring about a wonderful ripple effect of health and well-being in your life.",
    "libra": "Dec 31, 2025- You have a keen mind, Libra, and are always absorbing new bits of information. What is amazing is how much of it you manage to retain. Today, however, even your considerable brain may be taxed beyond its limits. At work you may feel overwhelmed by the mass of information to sort through. At home there may be books and magazines piled up that you're anxious to read. Consider taking the evening off from intellectual pursuits. There is something to be said for passive entertainment.",
    "scorpio": "Dec 31, 2025- Take care not to take on too much today, Scorpio. Your intentions are certainly good and your motivation pure, but even you are limited by the fact that there are a mere 24 hours in a day. Pick and choose your commitments carefully today to ensure that you can actually do what you say you will do. You'll be more effective and get more satisfaction out of devoting your energy to a few just causes.",
    "sagittarius": "Dec 31, 2025- Don't take anything at face value today, Sagittarius, especially if it involves money. It's likely that a friend or colleague will approach you with a deal that is too good to pass up. Don't let yourself get caught up in the promise of quick riches. Any deal that is presented as \"too good to be true\" usually is. Take in the information and review it at a later time. You will find that flaws are revealed once cooler heads prevail.",
    "capricorn": "Dec 31, 2025- You may find yourself overwhelmed with information today, Capricorn. By midday both your voice mailbox and your email box could be full up. It seems everyone needs a piece of you today. Don't try and accomplish everything that people expect of you today; it simply isn't possible. Instead, make your own decisions about what is important and what isn't. You may get some resistance from higher-ups, but in the end they will see the wisdom of your thinking.",
    "aquarius": "Dec 31, 2025- Even though you might have to work today, Aquarius, you should still try and take things fairly easy. You're just not ready to embrace your workload with your usual vigor. Be sure to eat a healthy breakfast and lunch, as your body may be rebelling from some recent indulgences. Soup and a salad are advisable for lunch, along with plenty of water. By day's end, you will feel your energy begin to return.",
    "pisces": "Dec 31, 2025- You can't force creativity. Not even you, Pisces. As much as you want to produce something fantastic right this minute, you will find that mere mortals such as us need the help of a creative muse. And alas, the muse is a fickle being. You can't just snap your finger and summon it. You must coax it out, slowly, gently. This all takes time, but the end result makes the effort worthwhile. For now, you must sit and wait, and trust that it will come to you."
}