{
    "aries": "Dec 25, 2025- Once you stop dreaming about having superpowers, you'll feel a lot better. You're not a superhero and you never were. For that matter, no one is. On the other hand, you surely have capacities that you've exploited in the past but now you seem persuaded that they're of no interest. It's time to rethink this issue.",
    "taurus": "Dec 25, 2025- This isn't the moment to adhere to a particular philosophy, whatever it may be. You may feel frustrated by your inability to figure out which path to take, but this is very good for you. Continue to search with your little flashlight, as weak as it may seem, because this is how you're going to get solid faith back again. Best of all, it will be a faith tailored for you.",
    "gemini": "Dec 25, 2025- You can't let everything fall apart now, not after you've come so far. This may be a difficult moment for you, as it seems the time has come to prove yourself once and for all. But this isn't a reason to give up. Sleep, play sports, and eat healthfully. You should be able to win this battle provided you give yourself the opportunity to do so.",
    "cancer": "Dec 25, 2025- Do you have the blues? It happens to everyone. Call a friend or go to a movie. Get out and do things that you know can help you overcome this funk. This isn't the moment to retreat. You have some inner work to do, even if it appears to lead nowhere. You may have the impression of being abandoned, but you know perfectly well that this isn't true.",
    "leo": "Dec 25, 2025- You'll be in your element today. The stars challenge you to try something different. When you look at things relatively, rather than turn into a vague generalist, why not try coming up with a philosophy that's more constructive? What good is the ability to see all sides of an issue if you can't channel your insight and observations into something specific?",
    "virgo": "Dec 25, 2025- It appears that today and for the past several days you've been building up internal tension without an outlet. As a result, your fuse is somewhat short. In fact, if anyone is unfortunate enough to provoke your anger by criticizing you or your work, you're liable to explode. There's a storm brewing! Try to weather it as best you can.",
    "libra": "Dec 25, 2025- A certain decision means that you've reached a turning point. The hardest part about making this decision is saying farewell to your old ways. The past can seem cozy and reassuring, especially when the unknown looms. It takes strength and determination to leave it behind. But whether it's your career or your love life, you have personal goals that can't be sacrificed or denied.",
    "scorpio": "Dec 25, 2025- The horizon is clouded with doubt. You're feeling the frustrations brought about by recent decisions about your love life. In other words, you're getting cold feet! Today you must draw on your willpower and self-control in order to face your problems realistically while vanquishing your anxieties.",
    "sagittarius": "Dec 25, 2025- The mood is oppressive and heavy today. Some disappointments will crop up here and there if you have to prove yourself in any way, either privately or professionally. There is some likelihood you'll feel angry with someone important to you. Don't yield to your negative feelings too quickly. It would be bad for your morale.",
    "capricorn": "Dec 25, 2025- In the past few days, you've made a resolution to work steadily, seek stability, and follow your plans to the letter. So the day ahead will come as a rude surprise. You can expect to receive news that challenges the rigid program you've set for yourself, or meet people who are determined to discourage you. Overcome these obstacles or they'll overcome you.",
    "aquarius": "Dec 25, 2025- Today you may feel some anxiety about the future. You may feel your strength ebbing, especially if you have a deadline. You need challenges in order to assert yourself. Now is the time to begin getting in shape. Doubt is extremely counterproductive. You're completely equipped for success!",
    "pisces": "Dec 25, 2025- The idea of expressing yourself will seem like a joke today. Have you ever stopped to question what expressing yourself really means? This is the ideal time to think about it, especially if you have artistic objectives. Do only what you want to do. Don't force anything. In other words, express yourself for your own sake and not for the sake of others."
}