{
    "aries": "Dec 28, 2025- Things are flowing your way today, Aries, and you should find a great deal of pleasure in the comfort of others. You might find that there is an air of fantasy about the day that is causing your emotions to lose track of time and space. Don't bother connecting to reality if you don't have to. Go to an art museum or attend a dance performance. See a movie and go out to your favorite restaurant.",
    "taurus": "Dec 28, 2025- Don't try to nail down any answers today, Taurus, because you'll probably just end up feeling more frustrated than when you started. The less you try to force your will on others, the more you'll find that things just automatically go your way. Today isn't about finding solutions to problems; it's about enjoying that which you have already learned and accomplished. Keep things light.",
    "gemini": "Dec 28, 2025- Let your childish side come out to play today, Gemini. Your dreams are in full force, so let them lead the way. Enjoy lighthearted conversations with friends about the latest movies and your favorite websites. You might want to consider working out or getting a haircut. This is a good day to improve your general appearance overall. You have a much sharper eye for physical beauty on a day like today.",
    "cancer": "Dec 28, 2025- Take a break from the trail you're on and get off the beaten path, Cancer. Today is a day to forge ahead with ideas and dreams rather than commitments and answers. Question things and debate the facts. Whatever you do, have fun. This is the perfect day to go out and enjoy the fresh air with an outdoor activity, especially group activities. You can't go wrong with joining up with friends and chatting away about the latest events of your life.",
    "leo": "Dec 28, 2025- You may find it hard to take a realistic approach to your emotions today, Leo. A sensitive issue is apt to be pulling on you in such a way that it's leaving you feeling like you are way out in left field in terms of the way you relate to others. You might want to consider letting someone else take the lead for once and allow stability to form before the next decision is made.",
    "virgo": "Dec 28, 2025- Question the validity of anything you find yourself in conflict with today, Virgo. You might find that people are acting on incomplete information and that they are falsely accusing you of something you didn't say or do. Work to bring harmony to the situation by getting the truth out on the table and helping the actual motivations become known. Words may be charged with strong emotions, so be gentle with your actions.",
    "libra": "Dec 28, 2025- It may feel like something has suddenly clicked into place for you today in which you have found the missing piece of a puzzle you've been working on for a while, Libra. The answers may be subtle, but they are there. Fantasy and a playful attitude will lead you to them effortlessly. Spread your ideas out to the world today and adopt an attitude that encourages others to join in your daydreams as well.",
    "scorpio": "Dec 28, 2025- Things may seem a bit surreal for you today, Scorpio, so don't take other people's chatter too seriously. Today is a day to reach out and touch someone, so pick up the phone and dial it. It's a good day to share your dreams with others, despite how farfetched they may sound. Others may look at you as if you have three heads, but as long as you're being honest with yourself, there's no reason for you to be shy about sharing.",
    "sagittarius": "Dec 28, 2025- Today is a great day for you in which you should enjoy a great deal of playful conversation with others, Sagittarius. Fantasy is likely to play a large role in the events of the day, and you may find yourself daydreaming as you walk down the street. Don't bother with reality today if you don't have to. You're much better off keeping the tone light and playful. Enjoy your fantasy world and feel free to invite others into it.",
    "capricorn": "Dec 28, 2025- There may be a rather confusing element to the day for you, Capricorn, in which you feel tempted to act but not all the pieces seem to be in place. It could be hard to make a decision about things since the facts seem to be quite clouded. You're better off spending this day enjoying your friends or your favorite hobby rather than trying to make any major life decisions or commitments.",
    "aquarius": "Dec 28, 2025- Be the star of your own movie today and be proud of the role you play, Aquarius. You might find yourself adopting the persona of many different characters depending on your mood of the hour. There is a special gleam in your smile today that you should share openly with others. Don't feel rushed to get anywhere. You have already arrived. Enjoy yourself in the company of those you love.",
    "pisces": "Dec 28, 2025- Take a break from your daily routine and get off the track today, Pisces. The world will turn with you for a day, so feel free to tune out for a while. Remember that whatever path you decide to take is the right path. Regret is a useless emotion - don't even bother with it. Enjoy the present day and all the small joys that it has to offer. Communicate your dreams and bring things into balance."
}