{
    "aries": "Jul 10, 2025- A close friend or romantic partner may seem in a rather quiet mood, Aries, and disinclined to communicate with you. You might wonder if this person is angry with you or if you've said or done something that wasn't OK. It's likely that what's bothering your friend has more to do with work, family, or money than with you. Just make it clear that you're there if needed.",
    "taurus": "Jul 10, 2025- The possibility of your pursuing new career opportunities, perhaps with more pay, might cause doubts and insecurities among family members, Taurus. They could be afraid that you will have less time for them. It's important that you reassure them, as their worries might escalate if you just let it slide. Make it clear that you're still there for them. This might alleviate their doubts and yours.",
    "gemini": "Jul 10, 2025- Worries about a relative who lives far away might plague you today, Gemini. The situation isn't helped by the fact that you may not be able to reach them by phone or email. You may have to contact mutual friends who can give you the information you need. Circumstances probably aren't all that dire. There's probably nothing to be overly concerned about, but you need to hear this. Keep trying.",
    "cancer": "Jul 10, 2025- A check you may have been expecting in the mail may be delayed, Cancer, and you might not be able to contact whoever is sending it. You could worry over whether or not you will get it at all. This could be a classic case of getting worked up over nothing. The delay won't cause any lasting problems, just inconvenience and frustration. Hang in there. The money will come.",
    "leo": "Jul 10, 2025- You could suddenly experience an overwhelming wave of affection for someone you've just met, Leo, perhaps a potential romantic partner. Fantasies of the future could waft in and out of your mind. This should feel wonderful in one sense, yet it could also bring up all your doubts and insecurities. Does this person feel the same way? It's probably a bit premature to worry about that. Take it one day at a time and get to know your friend better.",
    "virgo": "Jul 10, 2025- New ideas for increasing your income, particularly if they involve extra work, could suddenly seem vague and uncertain today, Virgo. Doubts and insecurities could sabotage the plans you were so ready for yesterday. Don't let this happen. Talk to others and judge what is and isn't workable, then concentrate on the former and move ahead. You don't want to miss some good opportunities.",
    "libra": "Jul 10, 2025- Romance may be very much on your mind today, Libra, though not necessarily in a positive way. Doubts and insecurities could take over your thoughts. Does a current or potential romantic partner share your feelings? Direct communication with the one in question could be premature, so it might be best to try to remain objective and judge the situation accordingly. Meanwhile, take it day by day.",
    "scorpio": "Jul 10, 2025- Brusque words or a lack of cordiality from a friend or colleague might have you wondering if this person is angry with you, Scorpio. Don't let your insecurity make you crazy. This person probably just has problems of their own on their mind. Do your best not to take any stinging comments seriously. Have a little faith and show a little compassion.",
    "sagittarius": "Jul 10, 2025- Someone could call and want to share some troubles with you, Sagittarius. Your sensitivity and compassion may attract more than one unhappy person in need of sympathy and advice. While this is flattering, it could be a bit of a drag as well. You aren't likely to turn these people away. Accept this as a natural consequence of being a good listener. And take care not to let these sad stories get to you.",
    "capricorn": "Jul 10, 2025- Uncertainty about money could plague you today, Capricorn. You might have doubts about income now, particularly if you're self-employed. Be careful not to make yourself crazy. Your insecurity might cause the situation to seem even more serious than it really is. Try to be objective. If there are genuine concerns - and there may not be - find a way to alleviate them rather than waste energy worrying.",
    "aquarius": "Jul 10, 2025- A love partner may seem too quiet, Aquarius. Perhaps you haven't heard from your friend for a day or so. If you let it, this could start your doubts and insecurities, causing you to wonder if this person still cares or if they're gone forever. Try to remain objective. Does your friend have some worries right now? That may be why they're out of touch. Worry will only make you feel worse.",
    "pisces": "Jul 10, 2025- Possible ideas for artistic projects could come to you, Pisces, though some of them may be vague and not yet ready to manifest. You may seek to express your spiritual side through artistic activity, but might not quite have a handle on how to do it. Don't force it. Find something else to do and let it sit for a while. You might be surprised by the final results."
}