{
    "aries": "Dec 20, 2025- Loving someone is no guarantee that one day that person won't leave. You must give your love freely and without strings. If you approach people always asking for guarantees or protection, you'll make them feel that you don't trust them. In turn, they won't trust you. It's a vicious cycle. The only way out is through giving your heart unconditionally.",
    "taurus": "Dec 20, 2025- You need a guide. This is a time to learn from the master of a domain, even if it means putting yourself in the role of disciple. This is a wonderful change for you, especially because you're often the one teaching others. This kind of exercise can do you a world of good. If there's a new subject you want to study, now is the time to embrace it.",
    "gemini": "Dec 20, 2025- This is a meditative day. It will help you take stock of how you feel inside, which you haven't had time to do for a while. You're in the process of abandoning the burden of always doing your \"duty.\" Miracle of miracles, you'll finally realize that you can't work all the time! Take a break.",
    "cancer": "Dec 20, 2025- Old demons and dreams are on the agenda today. Do you want to be an artist? Are you sure? If you're an artist, would you like to be more prominent or rich? Be wary of such daydreams because they take you away from enjoying your life. Live in the here and now. Embracing what you already have will ultimately give you the same satisfaction as those who are richer or more famous.",
    "leo": "Dec 20, 2025- If your daily life seems disorderly, change it. Don't delay. You say that the hustle and bustle of life has you running in a thousand different directions. You'd really prefer to live in peace and quiet in the country. It's possible to make such a dramatic change. Take advantage of your great adaptive powers!",
    "virgo": "Dec 20, 2025- You don't like to be held back. You can't wait quietly until you reach your objectives. Know that occasionally the unpleasant tasks have to be done before you can enjoy yourself. This is the case today. Fortunately, the day promises to be calm with periods of concentrated effort. Now you can prepare for the future.",
    "libra": "Dec 20, 2025- Is this the day you'll meet someone new? It's possible! The astral aspects are going to make it a lot easier for you. Given the wonderful energy you have at the moment, someone fascinating may be attracted to you. Take advantage of this wonderful day. It's tailor made for you!",
    "scorpio": "Dec 20, 2025- You can expect to have a calm, efficient day. Whatever projects you've initiated in your public or private life should start taking on an interesting shape. Little by little, uncertainties will vanish. Have confidence in time, because it's currently working in your favor.",
    "sagittarius": "Dec 20, 2025- A serious day lies ahead. It feels a bit lonely as all those around you concentrate on their own needs in silence and isolation. But you'll enjoy a great feeling tonight after you solved so many problems and gotten so much done. Ultimately, this will be a very positive day, one you will end feeling very proud of yourself!",
    "capricorn": "Dec 20, 2025- You're cleaning, sweeping, and tidying up your relationships as never before. More remains to be done, but in the end, your relationships will take on completely different forms. Today, for example, someone in your group will back up your ideas. You're in the process of changing. Everyone who matters is going to support you.",
    "aquarius": "Dec 20, 2025- Great rivers are born from drops of water. Opportunity isn't lacking in your life at the moment. This is a great time to buckle down in your personal and professional lives. You've never shied away from hard work. You embrace it. You'll end the day feeling the satisfaction that comes from a job well done. Congratulations!",
    "pisces": "Dec 20, 2025- Are you deeply satisfied with your love life? Several of the aspects will push you to take stock and develop some solutions if needed. A big issue could be your possessiveness. Try an experiment. Give your partner more freedom. It may seem risky to you, but it isn't. Loosen the reins a bit."
}