{
    "aries": "Sep 20, 2025- Troubles in the family may have you toying with the idea of moving or at least making some changes in your household. Someone close to you hasn't been honest with you, Aries, and that also has you feeling a bit down. Kick around as many ideas as you can, but don't make any decisions today. It isn't the time. Wait until you're in a more positive and optimistic state of mind.",
    "taurus": "Sep 20, 2025- Your intuition and imagination are operating at a very high level today, and you may be inspired to write. However, you aren't likely to have enough ideas or information to actually put pen to paper. There's no rush, though. Take some time to allow the ideas to crystallize and set them down later. Someone in a bad mood may   draw you into a quarrel. Brush it off and say you're busy!",
    "gemini": "Sep 20, 2025- There may be doubt about the outcome of a project that means a lot to you. It may involve financial problems or lack the support from others that you require in order to complete it. Your doubts are most likely groundless, Gemini, but it doesn't hurt to hedge your bets a little and seek what you need elsewhere. This is likely to be a temporary delay. All signs indicate success.",
    "cancer": "Sep 20, 2025- Your mind might be on power struggles that have caused quarrels among your friends, placing you in an uncomfortable position. Conflicting loyalties might come up when others draw you into the fray, Cancer. Stay out of it! You could get angry, and this wouldn't do you any good. Think of something else until you calm down and regain your perspective.",
    "leo": "Sep 20, 2025- Daydreams and fantasies about faraway lands and exotic places might have you thinking about dropping everything and taking off for a while. You aren't usually impulsive, Leo, but today you feel restless. If you have no obligations, and if weather permits, go someplace where you can experience a change of scenery. We all need it from time to time.",
    "virgo": "Sep 20, 2025- Sudden demands on your resources by others may have you feeling used. You may be asked for a loan. Your doubts about the person's ability to repay might conflict with your sympathy for his or her situation. Your intuition is good today, Virgo, so use it to read the true motives of those asking for favors. Grant only the ones you feel are appropriate.",
    "libra": "Sep 20, 2025- Melancholy that doesn't seem to have any basis in reality may plague you today, causing friends, family, and your partner to worry. On days like this, Libra, it's best not to give in to gloom, but rather to throw yourself into work and projects you love. Even though you may not feel like socializing, the company of others can get your mind back on track.",
    "scorpio": "Sep 20, 2025- Today, Scorpio, you may feel out of sorts. You probably aren't ill, but you may be tired. You could also suffer from vague aches and pains that are most likely related to stress. Take the day off and relax. Soak in a tub and read a book. Your imagination is working overtime and you need to get your mind off your malaise. Fantasy novels may be your best bet!",
    "sagittarius": "Sep 20, 2025- Strange, exciting, and vivid dreams may inspire your creativity today. You might want to try a new art form or study the works of innovators. Romance and sex are especially important to you, Sagittarius, though insecurities about a partner may restrain you from expressing your feelings. Take a chance - let the person know what you need right now. Your friend may be pleasantly surprised.",
    "capricorn": "Sep 20, 2025- Concerns about your home or mother may mean you have to deal with some rather unpleasant or untrustworthy people. Lack of knowledge could have you in a quandary about how to address the situation. It would be a good idea to prepare by gathering all the facts you might need. Stay centered and focused, Capricorn, and use your inner strength to hold out for the best for all concerned.",
    "aquarius": "Sep 20, 2025- Juicy but perhaps unkind gossip might reach you today. You may doubt the motives of a close friend. Examine any tips you receive and ascertain the true facts before you accept it as truth. Much of the information is likely to be wrong. Your imagination is flying high, so you might want to try writing or drawing.",
    "pisces": "Sep 20, 2025- Money matters may seem vague today, Pisces. Uncertainty about how to manage your affairs might plague you throughout the day. Planning for the immediate future could also be difficult. You may be expecting some funds that may not come yet, or you might not be certain if you need to make a specific purchase. Keep occupied. You can't rush it, and obsessing does no good."
}