{
    "aries": "Jun 29, 2025- Your emotions are more peaceful and easier to control today, Aries. It's almost as if you're merging with the energy around you. The one thing to be careful of is indecision. When it comes to taking action on something and you aren't sure which way to go, you'd do better to hold off. Make your big move some other day.",
    "taurus": "Jun 29, 2025- Go with the flow today, Taurus. Find the freedom you seek by simply following the path of least resistance. There's no reason for you to be unhappy. Life doesn't have to be difficult or complicated. Just be completely yourself. People will act the way they need to in relation to you. Don't worry about their feelings. They aren't your responsibility.",
    "gemini": "Jun 29, 2025- Your heightened sensitivity could get you in trouble today, Gemini. The more you try to pin down a specific answer to something, the more resistance you may encounter. Don't expect a straight answer from anyone or you will be disappointed. People may be flighty or forgetful. Try not to take anything too seriously today.",
    "cancer": "Jun 29, 2025- Your expansive nature is reaching out to others, Cancer, but you may run into opposition. Keep in mind that not everyone wants your advice. Give it only if someone asks for it. It may be in your nature to want to jump into people's lives and fix things. Resist that temptation. What people may need instead is someone to listen.",
    "leo": "Jun 29, 2025- Your general mood is at a peak today, although this mood is slightly off due to indecision on your part, Leo. Don't let this get you down. If you find it hard to make a choice about something, the solution is simple. Put off making the choice until you feel more comfortable about it. If you must make a decision today, go with your instincts.",
    "virgo": "Jun 29, 2025- You may be a bit confused today, Virgo. Nothing seems to fit right. It's as if you're faced with many different roads, unsure of which one to take. All the choices seem reasonable and you may fear you will miss out on something great whichever one you choose. The truth is that you can find a way that incorporates what you've learned from previous paths. Trust yourself.",
    "libra": "Jun 29, 2025- You may be tormented by an important decision today, Libra. The good news is that once you make up your mind, you will feel much better about yourself. Until then, however, you may vacillate from one side to the other. Asking others for advice may put you in even more of a quandary. The only one who can decide your path is you.",
    "scorpio": "Jun 29, 2025- You may be a little hesitant today, Scorpio, and not really sure why. Just when you thought you had it all figured out, another aspect comes up with a completely different perspective. It may be hard to choose one path and stick with it. Keep in mind that your unique path may incorporate many different side paths. This is one of your many gifts.",
    "sagittarius": "Jun 29, 2025- Watch your back today, Sagittarius. There's a distinct presence nearby that requires your attention. Luckily, your emotions are a lot more stable than usual, and you're more strongly connected with your feelings. In fact, you may be in the clouds. You shouldn't have any problem navigating through this part of the atmosphere. Others may look to you for advice.",
    "capricorn": "Jun 29, 2025- You may look confused today, Capricorn. It may be hard for you to stick with one subject. Your attention may jump from one thing to another. That's OK. There's a distinct advantage to seeing all sides of the story. You will have greater perception and awareness of things today. Take this opportunity to put yourself in other people's shoes so you know how to deal with them in the future.",
    "aquarius": "Jun 29, 2025- You may find it difficult to keep things neat and organized today, Aquarius. It seems like you're tying to organize a room full of feathers buffeted by gusts of wind. Buy a paperweight. Meanwhile, you might want to give up organizing the feathers and deal with it another time. You may feel too lazy to fight the wind.",
    "pisces": "Jun 29, 2025- Your expansive, outwardly directed plans are moving at full force, but once in a while self-doubt slows things down, Pisces. Today is one of those days in which insecurity may hamper your progress. The secret to success is to consider all the options and trust your instincts. Use your keen powers of observation to collect data and arrange facts in an orderly fashion."
}