{
    "aries": "Jan 28, 2026- Your neighborhood is a busy place today, Aries. Perhaps a public gathering of some kind is happening, maybe social, political, or humanitarian in nature. A number of your friends should be there. You might drop by with your romantic partner, out of curiosity more than anything else. Stick around for a while. You could learn something and discover a cause that could mean a lot to you.",
    "taurus": "Jan 28, 2026- Financially, things seem to be going great for you right now, Taurus, and therefore you could plan to make an investment in your home. If you already own one, you might decide to remodel or redecorate. If not, then you could just haunt realtors' offices for the next few weeks. This is a good time to turn your energy toward improving your own space. Go for it and have fun!",
    "gemini": "Jan 28, 2026- At this time, Gemini, most of your focus is on either a group you're affiliated with or an intellectual subject in which you have an intense interest, or perhaps both! The arts, particularly writing and drawing, might be among these subjects. A number of your closest friends could share your interest, particularly a woman who lives nearby, so you can expect some exciting discussions over the next few days. Enjoy!",
    "cancer": "Jan 28, 2026- Today you might decide to spend much of your day alone at home, Cancer, perhaps working on a creative project of some kind. Your intellect and imagination are operating at a high level, and a gathering of friends might have brought inspiration your way. This is actually a good day to make use of your artistic talent. Your insight and vision should give rise to some moving results. Work hard!",
    "leo": "Jan 28, 2026- Expect to be surrounded by genuine love and affection today, Leo. Friends, family members, and a very special romantic partner could pay you far more attention than usual. A group activity or other social event could put both you and your beloved in touch with some interesting people who could become your friends. Much information will be exchanged, including the names and phone numbers of those who might prove to be important business contacts. Have fun!",
    "virgo": "Jan 28, 2026- Idealistic love could come your way today, Virgo. This might involve a colleague or possibly someone in a group with which you're affiliated. It might even be someone you've never before considered as more than a friend. Whoever it is may seem to be too perfect to be true. Bear in mind that this is the first rush of infatuation, and that for romance to be successful you have to love a person's flaws as well.",
    "libra": "Jan 28, 2026- Travel by air, perhaps in the company of some friends, could well be in the works for you, Libra. A group with which you're affiliated might want to take a trip together, perhaps to a place associated with artistic or spiritual traditions. Your romantic partner could accompany you as well, making it as much a romantic getaway as an adventure. Take plenty of money with you! Your friends will want to go to nice places.",
    "scorpio": "Jan 28, 2026- A lucky break could put you into a higher financial bracket than you were two days ago, Scorpio. Career matters, perhaps those concerning the arts, could be involved in some way. You and your romantic partner will probably want to go out and celebrate your good fortune; however, make sure you don't overindulge. You'll want to feel absolutely fabulous tomorrow so you can continue to enjoy your success.",
    "sagittarius": "Jan 28, 2026- A social event could bring a fascinating new someone, perhaps from a different culture, into your life, Sagittarius. This person could end up talking to you for hours about a number of intriguing subjects that interest you both. You could meet some other interesting people as well, and some could become friends, but this person could well end up as a very close friend or romantic partner. Make sure you exchange phone numbers. Have fun!",
    "capricorn": "Jan 28, 2026- Are you falling for someone you know on the job, Capricorn? If so, you might find out that your feelings are reciprocated. Your friend could telephone or email and invite you out, away from work. Some other people might be present, but this won't stop you from getting better acquainted and realizing that this relationship shows promise. The only problem is that you may have to keep it under your hat for a while, at least at work.",
    "aquarius": "Jan 28, 2026- Love and romance are first and foremost on your agenda for today, Aquarius. You and your romantic partner may leave a gathering of friends to be alone together and talk. You communicate well, and the intense feelings between you could be obvious to both of you, and embarrassingly, to everyone who knows you. If you've been together for a while, talk of commitment or a wedding could come up. Enjoy your day.",
    "pisces": "Jan 28, 2026- A festive event takes place in your home today, Pisces. Is it a family member's birthday? A lot of lighthearted banter takes place alongside intense discussions of deep subjects and stories of strange events occurring around the world. You might make plans for another such gathering at someone else's house. Love can blossom. Something about the evening has brought you and another closer together. Enjoy!"
}