{
    "aries": "May 11, 2025- You've been working especially hard lately, Aries, and today you may begin to reap the benefits of all your hard work. Some project that's dear to your heart may be nearing completion, and even you are impressed by the results! All those naysayers who said it would never work are now looking at you with admiration and respect. Give yourself a pat on the back for your accomplishment.",
    "taurus": "May 11, 2025- There's no other way to say this, Taurus - you're in the mood for love. Tonight you may feel a strong urge to be with your partner. If there isn't one in your life, you should take steps to correct that. You may meet someone who sweeps you off your feet. You want to be head-in-the-clouds in love, which is the only way to be!",
    "gemini": "May 11, 2025- You have a generous spirit, Gemini, which could get you into trouble if you aren't careful. When you get a gift of money or even a hint of one, your tendency is to buy presents for all your friends. It's hard to fault you for this, but there are other ways to show your affection. You could bake cookies to distribute, for example. This will keep your money safe and earning interest.",
    "cancer": "May 11, 2025- You hardly even believe in love, much less love at first sight, Cancer, but something that occurs today may turn you into a believer. You never know when it will happen. You could be in line at the grocery store when someone catches your eye (and heart). Perhaps someone with whom you've only had a phone relationship suddenly shows up at your office. Adventure lies ahead.",
    "leo": "May 11, 2025- It's likely a hidden talent of yours is revealed today, Leo. All those scraps of writing could turn into something more concrete, such as a novel. Maybe you begin to dabble with your children's paint set and realize how much you enjoy the creative process. Be open to all possibilities. You may find your life takes a different, more authentic direction.",
    "virgo": "May 11, 2025- You will feel especially close to family and friends today, Virgo. There's a lot of positive energy in the air, and people feel optimistic and congenial. It's a pleasure to be with your loved ones, and interactions with strangers have a lovely flavor as well. Take advantage of the warm astral energy and plan a get-together with your favorite people. You will enjoy growing closer.",
    "libra": "May 11, 2025- You're likely feeling confident, optimistic, and enthusiastic today, Libra. You feel as though anything is possible, and indeed it is. If you feel a bit of wanderlust and are anxious to explore new places and meet new people, you may soon receive the chance. Life is one great big adventure. You're fortunate to have the sort of spirit that embraces it fully.",
    "scorpio": "May 11, 2025- You have a wonderful combination of optimism and spirituality, Scorpio. You believe in miracles as well as angels, Santa Claus, and the Tooth Fairy. We support your attitude wholeheartedly! Today something may happen that only further solidifies your beliefs. Perhaps your guardian angel saves you from stepping in front of a bus, or you receive a telepathic message that stops you from making a bad career mistake.",
    "sagittarius": "May 11, 2025- Don't be afraid to ask for help today, Sagittarius. It may be that your friends and family help you with a task or you discover a mechanized solution that does the job for you. Technology can be a wonderful thing. Don't let any aversion to it stop you from incorporating it into your daily life. You will find that once you embrace innovation, it improves your quality of life dramatically.",
    "capricorn": "May 11, 2025- You can expect your love life to take a dramatic turn for the better, Capricorn. This may be because you feel more self-confident than you have in a long time. In addition, you feel great and look even better. It's no wonder your romantic partner is reacting to you in such a powerful, positive way. Make the most of this opportunity by spending some quality time together.",
    "aquarius": "May 11, 2025- You're looking good and feeling great, Aquarius. Now if only your home environment reflected who you are. As you look around, you may realize that it isn't as elegant as it could be. Today you can begin to change it. Begin with the basics - tidy up and clear away clutter. Once all the extraneous items are gone, you can begin to look at more serious changes.",
    "pisces": "May 11, 2025- Sign up for a class or workshop today. Your career could greatly benefit from more training. A short computer course might be all you need to move your career a giant leap forward. Don't neglect your artistic abilities, Pisces. Ideally, you will find a way to integrate your creative talents into your daily business life. There's always room for creativity."
}