{
    "aries": "Jan 23, 2026- Money matters might be weighing on the mind of a close friend or lover and your advice could be sought. A creative project of some kind may require a larger expenditure of money, time, or other resources than you originally thought, and this could have you wondering if you'll be able to continue with it. It might take a little corner cutting on your part, Aries, but you should be able to complete it as planned.",
    "taurus": "Jan 23, 2026- You might have visitors, Taurus, or even a hot date scheduled for tonight, but by mid-afternoon you might be feeling too tired to go through with it and wondering if you should cancel. It's best to keep your activities low key. Have coffee and snacks at home instead of going out, and get the snacks from the store! Your evening is likely to be full of exciting and stimulating conversations, so you'll be glad you stuck with your plans.",
    "gemini": "Jan 23, 2026- Deliveries you may be expecting could be delayed or held up. Today you might learn something shocking about a neighbor or relative, and gossip might spread very rapidly through your community. This could have you reeling even though it might be exaggerated. You could pay visits to a few people nearby, Gemini, or spend a lot of time on the phone trying to learn the truth. Don't take anything you hear today at face value.",
    "cancer": "Jan 23, 2026- Some good but surprising news about a group with which you may be affiliated could come your way today, Cancer. Perhaps fundraising activities have been more successful than you thought, or perhaps recognition is coming your way. A lot of paperwork may have to be completed before this can be made to work for you, however. Contracts or other legal papers might be involved. In the evening, go out with your friends and celebrate.",
    "leo": "Jan 23, 2026- Some upsetting news regarding money could throw you into a bit of a dither today, Leo. Perhaps a check you've been expecting hasn't arrived on time, or maybe the bank has made a computer error regarding your account. It's nothing that can't be straightened out, though it's going to be a pain making all of those phone calls. Basically, all should be going very well for you. This is only a temporary hindrance.",
    "virgo": "Jan 23, 2026- A temporary setback with regard to your career might have you feeling a bit disoriented right now, Virgo. Modern equipment of some kind might be involved. Don't make yourself crazy; this is only temporary and will be straightened out. Your own determination, efficiency, and practical abilities should have it taken care of in no time. Basically, you're probably feeling quite optimistic for the future and not likely to change that energy any time soon.",
    "libra": "Jan 23, 2026- Today may start out being a very frustrating day, Libra. Be prepared! Some equipment with which you work might suddenly go out of order and it could take a while to get it fixed. A temporary separation from a romantic partner could also be disappointing. You may have a lot of physical energy for which you have little immediate outlet. Take a long walk. This could not only provide an energy outlet but clear your head as well.",
    "scorpio": "Jan 23, 2026- Your level of artistic inspiration is very high today, Scorpio. Dreams or meditation may have brought up some spiritual insights and revelations for you, and you may have promptly forgotten them upon coming out of your dream or meditative state. This could prove very frustrating for you! Try writing them down even if you only remember snatches. This can actually bring them to the surface again. You'll want a record of them anyway.",
    "sagittarius": "Jan 23, 2026- A delivery of some kind that you were expecting to come from far away might be delayed, causing you to wonder if it might have been lost. It hasn't, Sagittarius; it's just delayed. Unfortunately, there isn't much you can do but wait. Equipment you use on the job could go out of whack today, necessitating calling in a repairman. This could set your work back some and make you a bit antsy. Try to find something else to do!",
    "capricorn": "Jan 23, 2026- Today you're likely to be feeling especially passionate, sexy, and desirous of a romantic encounter, Capricorn. You might even have a hot date scheduled. However, don't be surprised if it has to be postponed for reasons beyond the control of either you or your partner. If you can't do otherwise, you might try to sublimate those feelings through creative activities. Engrossing novels and movies could also prove a good outlet, although never as good as the real thing!",
    "aquarius": "Jan 23, 2026- A female visitor who might have a few problems might come to your door wanting advice and sympathy, Aquarius. She could have some other news that could come as a shock to you. A crisis on the job might make it necessary for you or your partner to spend most of the time today away from home and family. This could be frustrating, particularly if you have to cancel your plans. Hang in there!",
    "pisces": "Jan 23, 2026- Tasks of any kind are all likely to seem like the labors of Hercules today, Pisces. Overwork and nerve strain could have you feeling a little bit under the weather today, and it might be a good idea for you to take some time alone to rest. If you can't do that, at least try to take things easy. Some unexpected changes in your community might have your neighbors' tongues wagging. Be sure to check out the facts before jumping to any conclusions."
}