{
    "aries": "Dec 11, 2025- One recent day you had the feeling that your professional projects really weren't your own, but ones that your parents, in particular your mother, wanted you to have. Now you've been analyzing your career from all angles and trying to figure out what it is you truly want. Today you should be able to see more clearly.",
    "taurus": "Dec 11, 2025- It seems like the basis of your social ambition has taken a bit of a beating lately. The planetary energies should give you some new desires. They may be of a more modest nature, but that doesn't mean they won't be important. What motivates you professionally is going to be healthier and less egotistical. It will ultimately be a positive, satisfying evolution.",
    "gemini": "Dec 11, 2025- Here is the day when you may finally accept that you tend to play the role of parent in your sentimental relationships. You're the one who sets limits, organizes things, and takes on responsibility. Your partner should try to open you up to your more sensitive, fragile side.",
    "cancer": "Dec 11, 2025- Are you afraid that people will no longer understand you? Have you changed too much? Do you have the feeling that you've left some people behind? Yes, it's possible, but what can you do? Everyone can't change at the same pace as you. Your friends have no problem with the changes you've undergone. Consider this possibility!",
    "leo": "Dec 11, 2025- You don't have the same opinions as everyone else. Of course, this is the case for each one of us. But you seem to differ in opinion with people more and more. You may decide that it's time to design your own job, where the only boss to disagree with is you! This will carry some risks, but the potential rewards are great",
    "virgo": "Dec 11, 2025- You may have been thinking about reshuffling the cards with your mate, unless you've already been offered a new hand. This pause in your relationship is a necessary transition on your journey to increased intimacy. Beginning today, your relationship is back on track and will continue to progress smoothly. Make the effort to observe what has changed.",
    "libra": "Dec 11, 2025- There's some likelihood that your emotions have changed in the past six weeks or so. You're no longer attracted to the same people. You're unsure of yourself at work, and you even wonder if your attractiveness had deserted you. Beginning today, these doubts will be dispelled. Take heart.",
    "scorpio": "Dec 11, 2025- It looks like your emotions are finally back in business! You've been hesitant for the past six weeks or so, unable to make any decisions. You felt unsure, as if you could no longer trust yourself. It's been an especially upsetting time. Don't throw caution to the wind, but your self-confidence will return to you today.",
    "sagittarius": "Dec 11, 2025- There's some possibility that in the past month or so you've been hesitant about your commitments, as if you'd been in suspended animation. Perhaps you became aware of errors you'd made in the past and were afraid you'd repeat them. Now that you're conscious of the past, you can and will face the future with more confidence.",
    "capricorn": "Dec 11, 2025- What a relief! Your energy is returning, especially regarding affairs of the heart. Today you'll be freed from the bonds of doubt about your judgment. With you, self-doubt is an especially touchy subject. You're miserable when your confidence is gone. The energy flow has been reestablished, although it may take you a few days to fully recover from the ordeal of recent weeks.",
    "aquarius": "Dec 11, 2025- The day ahead is promising! The aspects give a boost to your emotional life and should release you from the recent period of uncertainty that has plagued you. You were unable to trust your own judgment. Difficult as this was, the doubt must have served some purpose. Perhaps you should use your newfound clarity to sort out your experiences.",
    "pisces": "Dec 11, 2025- You undoubtedly have the impression that you're seeing more clearly than in the recent past. The planetary energies are lining up to break up the mental fog that you've been experiencing. The past few days have made you think an awful lot and you've learned some lessons, which should be evident today. Now it's up to you to apply those lessons to your life."
}