{
    "aries": "Jun 17, 2025- Nothing seems to be clicking the way you want, Aries. Your rational mind tells you that things are fine and you have the green light to proceed with your plans. But there's a small voice inside you that's suggesting otherwise. Perhaps you have an inkling that your plan is flawed in some way. Perhaps you're ignoring a certain pain in your heart by keeping it secret when in reality you need to let it out.",
    "taurus": "Jun 17, 2025- You're emotionally much stronger than usual. You will be surprised at the events, thoughts, and conversations you command with your words, Taurus. Most of the time, you follow others. You go with the flow. You're laid-back and happy with just about anything. Today, however, you want to take the lead and show others how things should be done. People would be foolish not to follow you today.",
    "gemini": "Jun 17, 2025- While this may be a day when all you want to do is to relax, you may not feel like you can, Gemini. A little voice is telling you to work. Perhaps you're inspired to clean out your closet, change the landscaping, or wash your windows. Put these tasks aside. Forced manual labor isn't the way to go today. If you're going to put that much energy into something, put it into having fun.",
    "cancer": "Jun 17, 2025- This may feel like a day made just for you, Cancer. You're emotionally strong. You feel like you're able to leap tall buildings in a single bound. Tackle all those projects you love but have been too scared to start. You have a great deal of energy and confidence in your favor. You will succeed in almost anything you try, so don't waste this moment by just watching TV.",
    "leo": "Jun 17, 2025- Your energy may be a bit scattered, Leo. Although your days are jam-packed with activities, you still go to bed every night feeling like you didn't get anything done. It's time to prioritize. Examine all the things you do for others and those you do for yourself. You may be surprised at the imbalance you've created in your world. Use this day to do things for yourself instead of others.",
    "virgo": "Jun 17, 2025- Your emotions and actions are well aligned, Virgo, meaning that you're likely to do things that are more in tune with your true beliefs. This wonderful alignment of energies will keep you busy and out of trouble. As long as you're true to yourself, no one can argue with what you do or who you are. There is no reason for you to make excuses about anything.",
    "libra": "Jun 17, 2025- You may feel emotionally stuck, Libra. Perhaps you feel your sensitive, loving nature isn't fully appreciated. Today is energetic and lively, but you'd rather sit home and relax. Your best strategy is to do just that. Why is it so hard for some people to see that doing nothing is really doing something - relaxing? Don't let anyone talk you into something you don't want to do.",
    "scorpio": "Jun 17, 2025- It feels like you have more emotional armor on, Scorpio, which will help you deal with a looming battle. Somewhere in your world a conflict is brewing. It may not be obvious, it may not be large, but it's there. Today you're more prepared to deal with things out in the open. You have a larger arsenal of weapons, and your witty, aggressive banter is at a peak.",
    "sagittarius": "Jun 17, 2025- You may feel like your resources are depleted and you want to throw in the towel, Sagittarius. Don't give up yet. Today may not be the best day of your life, but that doesn't mean you should write everyone off and become a hermit. You may be moodier than usual, but you will snap out of it. You may need to be a bit more adaptable in order to roll with the punches today.",
    "capricorn": "Jun 17, 2025- Your energy is running high, Capricorn, and you have a great deal of fire that you can use to transform anything. You have a wonderful capacity to turn a bad situation into a good one. You know exactly how to lift others' spirits when they're down. Today certain issues may be a bit too emotional for you to handle comfortably. There's an aggressive, combative tone to some people. Keep your guard up.",
    "aquarius": "Jun 17, 2025- Every time you bring up a sensitive, important, or deep subject, does someone squash it? You may feel like you aren't relating well to other people today, Aquarius. You may want to dive deeper into issues while others prefer to skim the surface. There are many ways to see the same things and deal with the same problems. Find people who see things your way rather than fight those who don't.",
    "pisces": "Jun 17, 2025- This is a wonderful day. You feel emotionally strong, Pisces. You have all of your energy available for use. Don't miss this opportunity by feigning a headache and staying at home doing nothing. Instead of analyzing everything and criticizing everyone else's life, look at your own and see what choices you can make right now. Take the best course of action based on the resources you have at your fingertips."
}