{
    "aries": "May 28, 2025- Some minor but annoying communications could interrupt your routine today. You won't appreciate the distraction, Aries, but it's best to take care of whatever it is and then go back to your tasks. You might have to spend part of the day running errands. Traffic might have you frazzled. Spend the evening relaxing at home. You've worked hard and you deserve it!",
    "taurus": "May 28, 2025- Boredom and apathy could tempt you to run to the mall and spend a lot of money on luxuries. You might overindulge in food and drink. This can make you feel better temporarily, Taurus, but in the end all you will have is an empty wallet and a stomachache. Treat yourself, but don't throw caution to the wind. This feeling will pass by tomorrow, and you don't want to regret your day!",
    "gemini": "May 28, 2025- A lot of activity could take place around home today. It could involve a number of visitors, or it could simply be a lot of work that needs doing. Either way, you might feel a bit frazzled, and the temptation to run away from it all might be almost irresistible. Relax! There's no need to stress out. Just do what needs to be done and enjoy the rest of the day.",
    "cancer": "May 28, 2025- News of unforeseen success could come your way today, leaving you reeling and breathless. You might feel a bit dazed, Cancer, like you don't know what to do with yourself. It might take a while to gather yourself. A lot of letters and phone calls may come your way, some routine, some congratulatory. You could write or call a number of your friends. Some errands may be necessary.",
    "leo": "May 28, 2025- Social events or group activities may prove draining today, as a lot of people might want to take advantage of your talents. Your kind, accommodating nature might cause you to try to make everyone happy, Leo, but this isn't realistic. You might stress yourself to the point of not caring what gets done. Be discriminating about what you commit to doing.",
    "virgo": "May 28, 2025- Excess is the word for today, Virgo. You may feel overly optimistic and enthusiastic about everything, and you could throw yourself into it all a bit too eagerly. You could take on more than you can handle. There is the danger of tiring yourself out physically. You could also go the other way and become very lazy, not wanting to do much of anything. Remember, moderation is the best approach.",
    "libra": "May 28, 2025- Today you might feel a little depressed and apathetic, like you don't care what happens right now. You might try to get your mind off those feelings by spending money. This works, Libra, but don't spend any more than you have to. These feelings really have more to do with the past than the present. If old pain wells up, let it go. Tomorrow all will seem a lot better!",
    "scorpio": "May 28, 2025- Today you might be with friends who want to go out on the town and spend money. Shopping, eating in fancy restaurants, or going to dance clubs could be in their plans. This is fine, Scorpio, as long as you don't get caught up in the excess. Find a happy medium between spending too much and acting like a party pooper.",
    "sagittarius": "May 28, 2025- Pressure and worries involving home and family could get in the way of your concentration today, Sagittarius. There may have been a quarrel with a household member that weighs on your mind. The best way to deal with this is to give yourself and everyone else time to cool down. Later you're likely to find that it has all blown over.",
    "capricorn": "May 28, 2025- Organizing your office and paying bills are likely to be on your agenda today, Capricorn. You could feel overwhelmed by the tasks, and you might be tempted to put them off. It's better to take it slowly until you get everything done. You don't have to do them all at once. This should lessen the stress. Spend a quiet evening at home.",
    "aquarius": "May 28, 2025- Excessive food and drink could have you feeling rather sluggish and indifferent to everything. This can get in the way of your usual kindness and affection, but it shouldn't. Get some rest, take a stomach remedy, and get back to your old self! You might also be tempted to overspend at some point. Think about it first!",
    "pisces": "May 28, 2025- Today a number of chores around the home could have you feeling overwhelmed, Pisces. Family members might abandon you, leaving you disgruntled. Do the most pressing and leave the rest for when they're home! There might be a difference of opinion between you and your mate. Try to see both sides of the issue and circumvent any serious disagreements."
}