{
    "aries": "Dec 26, 2025- You're having a difficult time getting started today. Don't get discouraged if things don't seem to be working. Your expectations may be too high, and your perfectionism is making it difficult for anyone to live up to your standards. Don't get worked up over every little detail. Perfection isn't demanded of you.",
    "taurus": "Dec 26, 2025- Be polite and try your best not to impose on other people today. It's important to behave civilly in all circumstances. People may feel like they've been cheated. Although you may not be the source of their discontent, you may feel the consequences. Keep other people's issues separate from yours, and don't let their discomfort seep into your world.",
    "gemini": "Dec 26, 2025- Don't blame everything on others today. It's important to be adult enough to take responsibility for your actions. Understand that things aren't always going to happen the way you want. Realize that sometimes you have to take the good with the bad. There's a somber mood to the day that might overwhelm your normal attitude. Try to stay focused and disciplined.",
    "cancer": "Dec 26, 2025- You might need to adopt a stern attitude today in order to be as effective as you'd like to be. When dealing with others, don't make assumptions for which you don't have solid backing. Other people are easily touched off, so keep things limited to the facts. Try not to stir up heavy emotions.",
    "leo": "Dec 26, 2025- You may not feel like your engine is working today. For some reason, it seems like you're using the wrong fuel. Don't be surprised if it's a bit harder to get in touch with your emotional state. Your feelings are playing tricks on you. Do your best not to be thrown off balance by this energy. It gets easier from here.",
    "virgo": "Dec 26, 2025- You might find your emotions stifled today. You have a great deal to say, but for some reason there's a bit of hesitation when it comes to saying it. Don't be surprised if you feel anxious in such a way that makes it difficult to communicate. Much of today's talk may be filled with fluff and not much substance.",
    "libra": "Dec 26, 2025- You might not feel especially motivated today. Nonetheless, whether you want to or not, it's important that you attack the mountain of tasks. Understand and respect the constraints of the ticking clock. As long as you're disciplined about accomplishing one small task at a time, you won't have a problem reducing the mountain to a small pile.",
    "scorpio": "Dec 26, 2025- You may be very busy today. This is a good time to get things done. There's a feeling of discipline that's helping you stay focused. Emotions are stifled, which may work to your advantage. Keep everything limited to the facts at hand, and work can proceed much more efficiently than if simple issues become big soap operas.",
    "sagittarius": "Dec 26, 2025- You're having a difficult time connecting with your emotions today. Things will run more smoothly if you don't try to force yourself to act cheerful if you aren't. Be honest about your emotions. If you're feeling restless or negative, keep it to yourself. Go for a walk, preferably near water, and indulge in a good healthy meal.",
    "capricorn": "Dec 26, 2025- Take some emotional time off today if you feel you deserve it. You're getting so wrapped up in other people's dramas that you're feeling drained when it comes to your own concerns. Calm down and relax physically and mentally. Getting too stressed about a certain issue isn't healthy. You may end up foiling the situation much more than if you left it alone. Come back to it later.",
    "aquarius": "Dec 26, 2025- You may get more emotional than usual when it comes to work. Do your best to keep your emotional life separate from daily responsibilities. If you feel overwhelmed by a certain job to the point where you can no longer do it effectively, it may be a sign that you need to make some changes. This is a time of heightened sensitivity. Do your best to stay afloat.",
    "pisces": "Dec 26, 2025- People are hesitant to deal with deep emotional issues today. They're erecting protective barriers so the things they hear, see, and feel don't hurt them. Respect these boundaries. Do your best to stay rooted in your inner sanctuary. Try to keep a positive attitude even though the prevailing mood may be somber."
}