{
    "aries": "Apr 25, 2025- You may be a bit unclear about your professional direction today, Aries. Your motivation has disappeared without warning. What happened? It may be that you need to become involved in projects that have more universal resonance. Projects of a narrow scope that concern only your interests no longer hold your attention.",
    "taurus": "Apr 25, 2025- It could be that you see mirages, Taurus, most notably in the environment around you. You may have the impression that people are lying to you or hiding something from you. Or it may be you're the one who lies about certain things or hides what you do. Why are you making things so complicated? Don't be afraid to express your feelings today.",
    "gemini": "Apr 25, 2025- Hold tight to your money, Gemini, because you may have some strange {though noble) impulses to give it away or spend a large amount on something completely useless. You should think about spending your money in a better way or, better yet, not at all. Why not consider donating some time rather than money to those in need?",
    "cancer": "Apr 25, 2025- Today isn't a good day to sign contracts or make any substantial purchases. Go to the grocery store, by all means, but buy hamburger not tenderloin. Keep your money in a safe place and save your reserves. Don't negotiate anything today, Cancer. No matter how good the offer sounds or how compelling the deal, just walk away.",
    "leo": "Apr 25, 2025- Are you certain that you can't modify your current situation, Leo? Are you a prisoner of a lifestyle that isn't of your own making or that may be a throwback from the past? People have been asking you to take on too many responsibilities and this is what weighs you down. Don't be afraid to be alone and distance yourself from these situations. Learn to say no and make your own life!",
    "virgo": "Apr 25, 2025- The forecast for you is excellent, Virgo. You can rely on today's aspects to restore your confidence, which has been sorely tried in the past few days. The warrior of seduction within you can swagger forth, certain of conquest. However, don't go too far. Wait a few days for reality to dispel the cloud of ecstasy and you will be able to see the future more clearly.",
    "libra": "Apr 25, 2025- You may have some trouble communicating today, Libra. It's as though something is distorting your perception. Don't be surprised if, once evening comes, you feel like forgetting about all of your responsibilities and traveling to the other end of the world. Tomorrow you will see clearly again, but doubtless there are adventures in store for you!",
    "scorpio": "Apr 25, 2025- You're radiant and glowing with happiness today. This is a refreshing change after the gloom and doom of the past few weeks. Apparently the decisions you made worked out for the best. Or, even better, perhaps you're in love? In any case, Scorpio, it will be even easier than usual for you to communicate with others and share your joy. Let the good times roll!",
    "sagittarius": "Apr 25, 2025- Your goal for the day seems to be to enchant your mate. There's no reason not to try. Indeed, today is excellent for love. But don't exaggerate your romantic wiles, Sagittarius. Since the day's aspects tend to distort your perception of things, you may be betrayed by what you see in the mirror. Be careful of what you do and how you do it!",
    "capricorn": "Apr 25, 2025- You're in splendid shape today, Capricorn! Did a fairy godmother conjure away all the little difficulties of the past few weeks? Enjoy this moment of relief from your worries. As for your love life, some exciting opportunities may arise. Be on the lookout for them, and whatever you do, don't let them escape!",
    "aquarius": "Apr 25, 2025- It's certainly clear that you have faith in your actions, Aquarius! You feel no fear or doubt as you progress toward your goals, cruising along on calm seas under clear skies. This new atmosphere is likely the product of your renewed commitment. Reward yourself for your accomplishments, by all means, but you should wait a few days before launching a full-fledged celebration.",
    "pisces": "Apr 25, 2025- This is a moment to start being creative in your life and stop being afraid of not having any talent. Who's to say what talent is? And in the romance department, the love of your life might be right in front of you. Try lifting your eyes from the romance novels and look around, Pisces. The perfect mate could be any number of people in your daily life. You just have to let yourself see."
}