{
    "aries": "Jan 6, 2026- A close relative may be ill or otherwise troubled, Aries, and you might worry a bit too much today because of a lack of communication from this person. Attempts to phone might result in no answer or repeated voicemail messages. However, take care to stay focused and objective. Your relative is probably recovering from whatever has been bothering him or her. Remember, no news is good news. Hang in there.",
    "taurus": "Jan 6, 2026- This is not the day to make financial investments of any kind, Taurus, although someone may present you with some possible opportunities. They may sound good, but caution is called for. If the information appeals to you, look into it and try to learn the facts, but make no commitment today. If it's truly a good opportunity, it won't disappear within a few days. If it isn't, you'll want to know. Wait!",
    "gemini": "Jan 6, 2026- You should be looking especially attractive today, Gemini, but you may feel that it's wasted because your beloved isn't around to appreciate it. Cheer up! It will only be for a few days, and you'll still look pretty good by then. Try to keep yourself busy, preferably doing something you love to do, so your enthusiasm will enhance your good looks. Your friend won't be away forever. It only seems that way.",
    "cancer": "Jan 6, 2026- Your ingenuity and imagination may seem to have deserted you today, Cancer, and this isn't making it easy for you to produce the high level of quality you're used to at work. Perhaps it might be best to busy yourself with routine tasks you can do automatically and, if you can, put off the more creative endeavors until your brain gets back in gear. Don't be too proud or too shy to ask for help. Hang in there.",
    "leo": "Jan 6, 2026- Money matters might require your attention today, Leo. Unusual expenses may have depleted your reserves, so you might have to cut a few corners. Your income, however, is probably the same if not slightly higher. This is, therefore, only a temporary situation, and your accounts should be back to normal in time, although some caution with regard to spending may need to be observed for a while. Work creatively on your budget and try to relax.",
    "virgo": "Jan 6, 2026- A lack of contact with a romantic partner could have you feeling a little down right now, Virgo. You may be wondering if you've said or done anything that offended your beloved one in some way. Your friend, however, is apt to be totally oblivious to the idea that you're upset. Your partner is probably taking care of some family obligations and may have lost track of time. Hang in there! Your honey should get in touch with you soon.",
    "libra": "Jan 6, 2026- Excesses in food and drink yesterday may force you to cancel a social engagement today, Libra. You probably aren't feeling up to it. This might be a bit irritating, and somewhat embarrassing as well. However, you just might have needed the rest even if you hadn't eaten too much. Make the most of your evening alone. Soak in a tub and go to bed early. In the morning, you'll be glad you did.",
    "scorpio": "Jan 6, 2026- Tension between a married couple who are both your friends could have you situated in the most uncomfortable place of all, Scorpio: right smack in the middle. Both may want to recruit you to their side, but you'll want to avoid allying yourself with either party. The best you can do is mediate by trying to get each of them to see the other's point of view. Whether you succeed or not, you'll have tried your best.",
    "sagittarius": "Jan 6, 2026- Gloom over the absence of a family member or romantic partner could come upon you today, Sagittarius, and your usually exuberant nature could be far more subdued than is normal for you. You might even spend the entire evening watching whatever happens to be on TV. It would be far more productive if you treated yourself to a trip to the bookstore and picked up some new reading material. At least you'll learn something while your partner is away!",
    "capricorn": "Jan 6, 2026- Too much food and drink could have you feeling a little out of sorts today, Capricorn. Some friends might have taken you out and exposed you to the most tempting of food and drink. This is always fun, but today you have to face the consequences! A workout fueled with water could help burn off any toxins or extra calories, and a nap just might complete the process so you're feeling like your old self again. Get going!",
    "aquarius": "Jan 6, 2026- Right now you might be in the process of moving from one job to another, Aquarius. This might even be a total change in career. Your hard work is paying off, though it may not show up in your bank account for a while yet. There might be contracts to be executed first. Your social life may be put on hold until all facets of this transition are worked out. Don't be intimidated, however. You've made the right choice.",
    "pisces": "Jan 6, 2026- Pisces, right now you could be overwhelmed by conflicts among your own needs, the needs of your family, and your responsibilities toward your job. As a result, you may be feeling tense and stressed out, and wondering if the situation will ever be resolved. Don't panic. It will, and you'll be none the worse for it. The keyword is balance, and the solution lies in finding it. Get to it! You'll want to put this behind you."
}