{
    "aries": "Jan 19, 2026- Important projects, either job related or personal, might need to be completed today in order to meet a deadline or fulfill a promise. This could require a lot of mental and physical effort on your part, Aries, which could prove somewhat stressful. Others might lend a hand, however. It's very important for you to remember to pace yourself. If you work when you're exhausted, you might not like the results.",
    "taurus": "Jan 19, 2026- A long-awaited vacation may be coming up soon for you, Taurus. The study of travel books might be on your agenda for today. You could spend much of your day making the necessary arrangements, making phone calls, completing paperwork, and running errands. You might need to set up the care of pets or plants for your absence. Excitement runs high and so does enthusiasm. You have a lot to look forward to, so go out and celebrate! Have fun!",
    "gemini": "Jan 19, 2026- This could prove to be a very busy day, Gemini. Someone close to you might come to you for advice on how to manage their resources, perhaps because of successes you've had in the past. This might take up more time than you'd planned for, but you'll enjoy helping your friend. Information received from TV or newspapers could bring a new interest into your life and spur you on to do some research on the subject.",
    "cancer": "Jan 19, 2026- Social events, probably family related, could take up a lot of your time today, Cancer. They might involve outings, perhaps to parks or other recreational areas. You'll enjoy it, but your mind may be on other matters, possibly projects you're involved with. Some stimulating conversations with someone close to you could take place. By day's end, your mind could be going a thousand miles an hour. Be sure to get a little exercise so you can sleep.",
    "leo": "Jan 19, 2026- Your home today could be like Grand Central Station, with lots of people coming and going and a lot of activity taking place within the house itself. The phone could be also ringing off the hook, Leo. You might wonder if your sanity will remain intact, but you'll make it through without going nuts. The problem is that there could be so much stimulation that you'll be too geared up to sleep. Take a walk before going to bed.",
    "virgo": "Jan 19, 2026- This is probably going to shape up to be a busy and rather chaotic day. You might find yourself spending a lot of time out and about, Virgo. You may need to run a lot of errands and see a number of people. A friend might accompany you. Phone calls might need to be made in order to make arrangements for future events, and someone might take up too much of your time calling to chat. Pace yourself!",
    "libra": "Jan 19, 2026- Today you should be feeling very energetic, Libra, both physically and mentally, and you're likely to feel rather anxious for some physical activity. Go for a workout if you have time or for a short walk if you don't. A lot of your time is likely to be spent working on challenging tasks that keep your mind active. You should be pretty keyed up by the evening. Unwind by having a glass of wine and watching a favorite video.",
    "scorpio": "Jan 19, 2026- A lot of physical and mental energy could be channeled today into artistic projects of some kind, Scorpio. Your intuition is running rather high, so you might know instinctively what friends, lovers, and children are feeling before they tell you. You could also pick up a lot of their anxieties as well. You'll need to relax a little. Go for a workout and then attend a concert or sporting event. You deserve a little fun!",
    "sagittarius": "Jan 19, 2026- Some boring paperwork regarding money, which you may have been putting off, might need to be executed today. Bills may need to be paid, deposits put in the bank, and new accounts opened. You could spend some time formulating new plans for the future. This probably will take up a lot of your time, Sagittarius, but there will still be enough for you to go shopping and make a few necessary purchases. Friends might accompany you. Enjoy!",
    "capricorn": "Jan 19, 2026- Your level of physical and mental energy should be very high today, Capricorn, and so you could feel restless throughout the morning. As a result, you might spend your afternoon and evening out and about, shopping, paying visits, or attending classes or lectures. Some stimulating discussions could take place. At some point, you might find yourself admiring a park or garden. Don't try to do too much, and enjoy your day.",
    "aquarius": "Jan 19, 2026- Your level of imagination and inspiration should be operating at a very high level today, Aquarius, so if you've been planning to start a new artistic project, this is the day to do it. You're also likely to be feeling quite intuitive, so don't be surprised if you find yourself tuning acutely in to the thoughts, feelings, needs, and desires of others, even strangers. Your higher mind is very close to your conscious mind. Make the most of it!",
    "pisces": "Jan 19, 2026- A group with which you're affiliated could ask you to take care of a few tasks. This might involve making phone calls, running errands, or both. Your energy and enthusiasm are high, Pisces, so this is a good day to prove how valuable your work is and how efficient you are. Make sure that you don't take on too much, however. You won't be helping anyone if you tire yourself out."
}