{
    "aries": "Jan 18, 2026- It's very difficult for you to reconcile your desire for creativity and originality in your life to the constraints that society puts on you to be an efficient, productive person, Aries. This is one of the great dilemmas facing a lot of people these days. It's as if you have to hide your real personality in order to live up to what other people expect of you. Some advice for today: don't be so hard on yourself. You're only human.",
    "taurus": "Jan 18, 2026- You seem to have a lot of resentment toward someone who may have hurt you. Don't keep these feelings inside or they'll eat away at you, Taurus. Take advantage of your day today to put all your cards on the table and forget about revenge, because it could just turn against you. Instead, why don't you try to reach out to that person and explain your feelings to him or her? The good energy you get from this experience could be very beneficial to you tomorrow.",
    "gemini": "Jan 18, 2026- Today, Gemini, you may feel like hiding yourself away in your ivory tower and watching the performance that is going on before your eyes. And why not, if this allows you to get the perspective you need on things? Use this period in your life to give things their real value and to see where certain people actually fit into your world. You're a very lucky person to be able to find this kind of balance in your life.",
    "cancer": "Jan 18, 2026- Have you been wanting to talk to your partner about something important, Cancer? Well, it's up to you to make the first move. In fact, that's just what your partner is waiting for you to do. Take advantage of your day today to tell your partner exactly what you expect from him or her and to share some of your worries. You're someone who is lucky enough to know what you want, but it isn't always easy for you to tell other people what that is. Be strong.",
    "leo": "Jan 18, 2026- You enjoy your freedom, Leo. You're a very independent person and you hate it when anything gets in your way. That's all right, but you may want to take a look at your financial situation even if that's not really your thing. You tend to resent having to deal with these lowly material questions, but if you don't, you could severely restrict your freedom to live life to its fullest. Be reasonable about things.",
    "virgo": "Jan 18, 2026- Today is a good day to take chances, Virgo. You may be quite successful if you're ready to defend the things you really care about. Pretend that you're the director of a film and that you've just met a potential producer for your movie. You just happen to have your script in hand. Are you ready to move up in the world? Are you ready for success?",
    "libra": "Jan 18, 2026- You have a kind of creativity that knows no bounds today, Libra, and a kind of originality that knows no limits. How are you going to go about expressing this rich creativity that abounds inside of you? If your environment doesn't allow you to express this creativity, change environments and try to make a new reality for yourself. This is the only way you'll be able to use this incredible energy productively.",
    "scorpio": "Jan 18, 2026- This is an ideal day to take a look at your financial situation, so get out your bank statements or dividend reports. Try and pretend that you're with your banker and describing your situation as objectively as possible, without overestimating what you bring in or underestimating what you spend. You won't regret this process, since it could prevent you from making some big mistakes later on.",
    "sagittarius": "Jan 18, 2026- You may have been worrying about something you did recently that you aren't very proud of. Today you'll discover that all that worrying was for nothing. The reality you've been trying to run away from lately will be right before your eyes and you'll see that it isn't so bad after all. You'll be rewarded for all your hard work, as if life were trying to give you a lesson about being optimistic. So don't be so negative!",
    "capricorn": "Jan 18, 2026- Not all friendships are the same, Capricorn. You may have learned that the hard way, but that's OK. Today you could feel like putting your friendships in some kind of order and getting a bit of perspective on things. It's time to figure which of your friends are really there for you when you need them, which of them show you how much they care about you, and which ones do not. Each kind of friendship can be useful to you in its own way. Don't be afraid to admit this.",
    "aquarius": "Jan 18, 2026- Not only do you want to live life to the fullest every second, you also feel the need to leave your special mark on the world you live in. You just have to be creative in life, Aquarius. You can't help it. That great project you've been thinking about for a while is just beginning to take shape. Today you may find some of the materials you needed to really get things going! A financial gift or the gift of someone's time? Someone's generosity could really make your day!",
    "pisces": "Jan 18, 2026- Your mind is in a period of great activity, and your curiosity about the world around you is practically insatiable. You're interested in anything and everything. You want to be able to understand everything from the simplest to the most complicated. Nothing could get in the way of your thirst for knowledge. So get a good supply of books about the things you would like to learn about and try and meet some new people."
}