{
    "aries": "May 18, 2025- Do you have some drawings in a drawer, Aries? Since last month, or possibly before, you've been thinking about your creative ability. You have a habit of turning your back on your skills, whether in drawing, photography, or writing, but they're in you nonetheless. People will expect more of you! All you have to do is take out a brush or pen and you will be on your way.",
    "taurus": "May 18, 2025- One last, concerted effort and you will be able to get to the root of a problem that has been on your mind for a while now. The answer to the question concerning your identity isn't entirely to be found in your family history, Taurus. You're part of a generation as well as a family. Both influence your responses.",
    "gemini": "May 18, 2025- You've been doing a lot of cleaning up and clearing out. Since this project has been going on for several years now, you must be doing a particularly thorough job. Finally, it seems as if you're getting things straight with your karma. Today will be a big day, Gemini. You may be able to leave part of your childhood behind, as at last you understand that it's ancient history.",
    "cancer": "May 18, 2025- Sometimes you have to go back to square one if you want a situation to get better, Cancer. This can be frustrating or even humiliating, but if the goal is to have a solid foundation on which to rebuild, it's well worth it! Don't get too attached to your professional past. You have to advance and you're too weighed down now. Let go!",
    "leo": "May 18, 2025- A moment will come when you can no longer fight against the current transformation you're going through in your professional life, Leo. The system that you live in will soon put you at a kind of impasse, but this won't necessarily be unpleasant. However, you will be obliged to change paths whether you like it or not. You will probably want to!",
    "virgo": "May 18, 2025- You won't allow yourself to get sidetracked by minor things today, Virgo. You will get straight to the heart of the matter. There's some likelihood that you haven't considered your working conditions and instead you're concentrating on the goal you've set for yourself. When you set a goal, you're a force to be reckoned with!",
    "libra": "May 18, 2025- About two weeks ago, it may have occurred to you that you should be making more of an effort to advance your career, Libra. If so, it will be easier for you to accept today's constraints, as there is some probability that you will need to perform at your highest level. Be careful not to lose yourself in the attempt!",
    "scorpio": "May 18, 2025- Your light, breezy spirit may have some trouble harmonizing with today's prevailing mood. Usually when you're cornered, you're able to find a way to squirm to safety. Today you may run out of clever maneuvers. Even though you face the day's challenges alone and unaided, you survive them the same way. Good for you!",
    "sagittarius": "May 18, 2025- What a day, Sagittarius! Whether at work or at home, you may find yourself choosing between two options, both of which stem from anxiety! You may decide to vanquish your doubts by burying yourself in your work. If so, you can expect to expend a great deal of energy. Or you may react with indifference, and the apathy will cost you just as much. The situation will improve in a few days.",
    "capricorn": "May 18, 2025- It's often said that your energy feeds on strong emotions. Situations that require some daring are an excellent source of such excitement. This is the key to understanding the day ahead, Capricorn. True, you can expect some hair-raising encounters, but how better to show off your skills as either an employee or passionate partner?",
    "aquarius": "May 18, 2025- You will have to rely on your analytical skills and steely self-control to navigate the stormy seas you find yourself in today, Aquarius. And there's no way to escape the stress. The worst pitfall facing you in your career or studies would be to doubt in your abilities. This is an opportunity to put your confidence to the test. Just make sure you pass it.",
    "pisces": "May 18, 2025- The astral configuration indicates that you may be interested in pursuing some kind of training, Pisces. Assess where you are in your professional life. Are you up to persuading people with your expertise? Don't think that you have to know more in order to be a good teacher. In fact, it's often by teaching that the teacher learns the subject."
}