{
    "aries": "Dec 2, 2025- News of illness or employment problems on the part of someone you care about can have you feeling a bit down in the dumps today. A warm, loving letter or call from someone far away might cheer you. This is a good day to write newsy letters or visit or call people you haven't heard from in a long time. Don't let sad news or a bad mood get the better of you.",
    "taurus": "Dec 2, 2025- Overspending on luxury items might have you feeling the need to tighten your belt a little. This could make you feel downhearted. Don't blame yourself too much. We all do this from time to time. Get out of the dumps by getting together with a close friend or lover. Go to a play, concert, or movie. Make time for any projects you have in the works.",
    "gemini": "Dec 2, 2025- Minor family problems might make you gloomy today. Perhaps a family member is away, or there may have been some petty squabbles in your household. Others might want to invite friends over, but you may not feel all that sociable. Throw yourself into projects of your own. It could give you a feeling of accomplishment, defusing your downhearted mood and firing your enthusiasm. Try it!",
    "cancer": "Dec 2, 2025- The illness of a relative or neighbor might have you feeling downhearted today. The news is likely secondhand, so it might not be as bad as reported. Work may be slow on your own projects, as you could have a temporary mental block about what to do next. Perhaps you should put them aside for now. Once they're out of your conscious thoughts, the solution may come spontaneously.",
    "leo": "Dec 2, 2025- Friends or groups could make excessive demands on your time today. As a generous and service-oriented person, you tend to go along with what others want. This is OK, but you're not serving anyone by letting them step over the line. You can also delegate. Keep busy, but don't overextend yourself. You need to save some energy for tomorrow.",
    "virgo": "Dec 2, 2025- Though you're usually outgoing, today you might feel more shy and reserved, perhaps because of melancholy thoughts about love or friendship. Someone you care about may be away and you miss him or her. People may try to take unfair advantage of you. Because you're feeling especially vulnerable, you're more likely to let them do it. Be discriminating.",
    "libra": "Dec 2, 2025- Information regarding spiritual or philosophical matters that may not be all that trustworthy may come your way. Don't take what you hear today at face value. A close friend or lover may be far away, and you could feel lonely. The best way to get through the separation is to keep busy, perhaps with study, research, or artistic activities.",
    "scorpio": "Dec 2, 2025- Group activities or get-togethers with friends may not go as well as usual today. You're feeling more reserved and perhaps preoccupied about a friend or romantic partner with whom you might be on the outs. Oddly enough, getting out with others is probably the best therapy in spite of your increased shyness. Maybe the best thing to do is to go out alone where people congregate.",
    "sagittarius": "Dec 2, 2025- A separation from the special someone in your life, perhaps because of a minor disagreement, could have you feeling melancholy today. You could receive an invitation to a get-together but be unlikely to want to go. You're feeling more reserved and introverted than usual. Oddly enough, being with others is probably the best way to get your mind off your friend.",
    "capricorn": "Dec 2, 2025- A touch of melancholy and moodiness might have you feeling distanced from your entourage and so you could throw yourself into solitary activities. Your concentration may not be what it should be. Get out and take a long walk or treat yourself to a meal at your favorite restaurant. Your mood will pass by tomorrow. You   need to get through today!",
    "aquarius": "Dec 2, 2025- You feel romantic and sexy today, but you won't have the opportunity to do anything about it. You may be temporarily separated from the special someone in your life, or a potential romantic partner might not be available. Cheer yourself up by shopping or reading or watching movies. The separation will pass and then you can make up for lost time.",
    "pisces": "Dec 2, 2025- Today you may extend an invitation to someone close to visit you in your home, but don't count on the person being able to make it. Something may come up. Disappointment could make you melancholy, but don't let it get the better of you. Invite someone else or channel that energy into creative or artistic projects. That way you can enjoy the day anyway."
}