{
    "aries": "Sep 15, 2025- Have you been doing a lot of walking lately? If so, Aries, your feet may be sore. This could affect your energy level considerably, not to mention your ability to get any work done. Concentrate on routine tasks that require little thought and can be done sitting down. Stay out of any squabbles! Relax in a hot bath tonight.",
    "taurus": "Sep 15, 2025- An event could find a current or potential love partner paying a lot of attention to others, Taurus. You might feel neglected and unloved, as though your friend is doing this to hurt you. This probably isn't the case. Your partner is just trying to be sociable and doesn't realize that it upsets you. Do some mingling. Your friend might have the same reaction as you and come running!",
    "gemini": "Sep 15, 2025- Do you sometimes go about things backward, Gemini? Are you caught up in the rat race of trying to have more money and security with the idea that eventually you'll earn the freedom to do what makes you happy? The happiness factor actually works in reverse. You must first be who you are and then take the necessary actions in order to have what you really want.",
    "cancer": "Sep 15, 2025- An angry call from someone who lives far away might catch you off guard today, Cancer. In your mind, the person has no reason to be angry and is blowing things out of proportion. They probably won't listen to reason. Say as calmly as you can that you'll get in touch tomorrow and then hang up. Give this person time to calm down before even trying to straighten things out.",
    "leo": "Sep 15, 2025- Today you might spend a lot of time looking for a lost object, Leo. This item may only have sentimental value. Still, it's important to you that you find it. This isn't a good day to search. You're in a rather frenzied state and could look right at it without seeing it. Wait until tomorrow to look. What you seek is probably nearby and just hidden in some way.",
    "virgo": "Sep 15, 2025- A minor quarrel or separation could take place with a love partner, Virgo, probably over something that seems trivial. It's likely to get your dander up to the point where you may never want to see this person again. Go for a workout or brisk walk to clear your head, get the endorphins going, and view the situation more objectively. Then phone your friend and work it out.",
    "libra": "Sep 15, 2025- Too much stress from overwork could have your nerves on edge today, Libra. When someone makes an offhand remark, you might see insult where none is intended. Don't get so jumpy that you imagine traitors behind every door. Work alone if you can, and take a walk to clear your head. This will put you in a better frame of mind and a more relaxed space.",
    "scorpio": "Sep 15, 2025- Squabbles may break out among members of your group, Scorpio. You might wonder what the big deal is since what they're arguing over seems rather silly. Apparently it's important to them! If you feel up to it, get your friends out of their emotional chaos and view the subject more objectively. It might not calm them down, but at least you'll have done something!",
    "sagittarius": "Sep 15, 2025- Someone may skip out on responsibilities today, Sagittarius, causing extra tasks to fall to everyone else, including you. This might stir up some anger and resentment and it's definitely going to cause more stress. Delegate tasks if you can. Put yours in order of urgency and then take them one at a time slowly and carefully. If the less important ones have to wait until tomorrow, so be it!",
    "capricorn": "Sep 15, 2025- If you've been planning to set off on a trip soon, Capricorn, make a list of what you need to do beforehand and check off each task as you complete it. Otherwise you might panic at the last minute because you've forgotten something important. Stay calm even if it seems impossible. You're less likely to forget anything if you stay focused.",
    "aquarius": "Sep 15, 2025- You may have been worried about money lately, Aquarius. Today a family member could make an expenditure that you view as unnecessary and irresponsible. Before you become angry know that all may not be as it seems! If you look at the situation objectively, you may see that you aren't in dire financial straits and the expenditure didn't take that much out of the family coffers.",
    "pisces": "Sep 15, 2025- Today you might find it necessary to turn down an invitation to a social event, Pisces, and the host might for some reason seem offended. Your friend is probably overworked and stressed and apt to overreact to just about any situation. Relax a little. Explain things to your friend and then propose that you get together at another time. That's all you can do now."
}