{
    "aries": "May 21, 2025- Is it possible you're too demanding, Aries? Today's planetary aspects may be asking you this question. You're choosy about the people you spend time with, and you have a tendency to ask them to go too far for you. Sometimes you have trouble knowing your limits where other people are concerned. You might want to think about this.",
    "taurus": "May 21, 2025- Today's a day to daydream, although this may not be an activity you usually do. You may even feel as if you're on vacation. Let's just hope people don't ask you a lot of difficult questions, because your answers will be anything but clear. But you shouldn't have to carry the weight of the world on your shoulders every day, Taurus.",
    "gemini": "May 21, 2025- If you have someone special in your life, Gemini, today is a perfect day to stop playing at being your partner's parent, as you sometimes seem to do. Reverse roles, and let other people take care of you. The world won't fall apart if you let go for a while. No matter what happens, a day like today should open your eyes.",
    "cancer": "May 21, 2025- You won't be able to fix your indecisiveness, Cancer. You just need to give yourself some time. The direction your life is taking isn't clear at the moment. There are great changes going on inside you. So, even though it may sound like strange advice, don't do a thing about it! Let the situation get clearer before you act.",
    "leo": "May 21, 2025- You have a strange and wonderful day ahead, Leo. Once you've finished your work, you may want to either draw or write something that will help you remember today for a long time. You're beginning to see the results of recent changes in you, and you're looking for a way to express them. It may be difficult to find just the right words. But aren't you a natural-born writer?",
    "virgo": "May 21, 2025- You have a nice day in store, Virgo. People may seem more attentive to your needs and generally very pleasant. You may not be used to this kind of treatment! You feel more outgoing and sociable than ever. You could take advantage of the day's tolerant atmosphere to meet people you may have been too afraid to introduce yourself to. They will surely have some new things to teach you.",
    "libra": "May 21, 2025- Today is a day for healing and reconciliation. You may have been feeling abused and mistreated lately by someone (or a few people) in your family over the past few weeks. You're now ready for a new start, because you were able to work things out and you've learned something from what happened. Take the time to savor the moment, and spend some time with the people you love.",
    "scorpio": "May 21, 2025- You may feel living your life is like crossing a desert, but fortunately, Scorpio, today brings your oasis. Take advantage of it! Some people you've met over the past few weeks could turn out to be more interesting than you originally thought. It's up to you to change those parts of your personality that have been holding you back.",
    "sagittarius": "May 21, 2025- Certain questions about your family life aren't as cut and dried as you might think, Sagittarius. This can be the case when emotions are involved. Yet more than anyone else, you need to be careful not to hurt anyone's feelings. Today something could happen that will let you control the situation while controlling your emotions.",
    "capricorn": "May 21, 2025- Capricorn, you may have had some confused emotions about your relationship or family over the past few days. You may not have been able to fully express your worries to others. But today these emotions will find a way to come out. Look around you. There might be someone right next to you who can help with your problems.",
    "aquarius": "May 21, 2025- If every day were like today, life would be heaven, Aquarius! This is potentially a wonderful time for you. You may find the answers to problems that have been bothering you for a few weeks. Keep your eyes and ears open in all conversations. You could come across the piece you've been waiting for.",
    "pisces": "May 21, 2025- Pisces, you don't have to be at everyone's beck and call all the time. This is exhausting, and you lose contact with yourself. You should try to take some time out today. Take a good look at your life to see where you're going. Go for a walk or take a long bubble bath. Things will be much clearer after a relaxing day of reflection."
}