{
    "aries": "Jan 11, 2026- Today you might play detective, Aries. Something or someone, perhaps a pet, has gone missing in your neighborhood and you'll be out there leading the charge. The object of your search could prove elusive, but will probably turn up none the worse for wear. The only caution: when searching, don't look too far afield. Whatever you seek is probably no more than a block or two from you. Stay close to home and all should be well.",
    "taurus": "Jan 11, 2026- Worries about money that plague you today could well be misplaced, Taurus. To all appearances, the financial road might temporarily get a little rough, but probably all is not as dire as it seems. Let go of your panic for a moment and sit down and actually go over your figures. You'll probably find that some careful budgeting and a little belt tightening are all that are needed to get you through. You can do it.",
    "gemini": "Jan 11, 2026- Rational thought gets muddled today as everything seems to be happening to you at once, Gemini. Everyone wants your advice, lots of people need favors, and those in authority have new tasks for you. Stay calm and don't react by getting short with people. Play triage officer and help those in the most need first. Warn the others you might not get to them. This way you won't make yourself crazy. Hang in there!",
    "cancer": "Jan 11, 2026- A strange communication could come from a person who doesn't leave a name and whose voice you don't recognize, Cancer. It might, however, sound important and therefore could bother you throughout the afternoon. How can you return a call when you don't know who the person is? Don't make yourself crazy. This isn't worth agonizing over. If it's important, the person will call back. Remember that as you move through the day.",
    "leo": "Jan 11, 2026- This is not the day to do in-depth research of any kind, Leo, whether it's an intellectual subject or how to put together a new computer system. Your mind is not as focused as it usually is, and it might temporarily be difficult for you to grasp new concepts that you've never encountered before. This is no reflection on your intelligence, just one of those vague days we all have. By tomorrow, all should be normal again.",
    "virgo": "Jan 11, 2026- A friend you've known for years might suddenly shock you by saying some unkind things that you would never have expected of him or her, Virgo. If they're said about you, you might be very upset because it isn't fair or justified! Sometimes it's hard to forgive these things, but make the effort. Your friend is going through some rough times that you may not know about. Try to put yourself in the other's shoes. Forgive and forget.",
    "libra": "Jan 11, 2026- Have you just recently reached a cherished goal, Libra? If so, you might temporarily be confused as to what you're going to pursue in the future. You may be toying with a number of options but not be sure which one is right for you. Perhaps it's none of them. Maybe your perfect goal is still over the horizon. Don't feel you have to get started on something right away. Be patient and have faith.",
    "scorpio": "Jan 11, 2026- You might be introduced to a new colleague, Scorpio. Don't be surprised if this person makes your flesh crawl. This could be a warning signal or it could simply mean that this person is absolutely terrified and therefore acting defensive. Don't jump to any conclusions about this person until you get to know him or her better. Remember, always give others the benefit of the doubt whenever possible.",
    "sagittarius": "Jan 11, 2026- Perhaps it's best if you stay away from your current love partner today, Sagittarius. Your friend is having some very draining hassles with family and on the job and won't be in the best of moods. If the two of you get together, you might find your partner in a surly and uncommunicative mood, and you might be the recipient of some unkind words. Either be prepared to deal with it or do something else tonight.",
    "capricorn": "Jan 11, 2026- Today you might want to concentrate on one of your private projects for which you have a lot of passion, Capricorn. If one of your family members keeps you from working on this project, explain just how important this is for you. Usually you work very hard, so you deserve to do whatever you want to do in your off time. Just try to be tactful! They will understand!",
    "aquarius": "Jan 11, 2026- Memories from the distant past, perhaps as far back as early childhood, could keep popping into your conscious mind today, Aquarius. You may feel really silly, crying over a fairy tale your grandmother read to you when you were five years old, but as embarrassing as this can be, it's actually a positive form of release. Old pain from the past, even as inane as this, can actually limit you in your current situation. Let it go and learn from the process.",
    "pisces": "Jan 11, 2026- An object that you treasure, perhaps a family heirloom, could be missing, Pisces. Don't panic. It's probably somewhere in the house, although it may have slipped behind something or had a pile of other stuff put on top of it. At any rate, it's among other objects. Searching too much, however, could make it more elusive than it should be. Keep looking when you have time and the item will probably turn up in a very strange place!"
}