{
    "aries": "Nov 7, 2025- The extreme passion that rules you may meet opposition today as more information appears. Communication may color the scene differently than you pictured in your head. Be patient and wait for all the spaces to fill in before you make any decisions about how to proceed. What is usually malleable and easy to affect may be a bit stubborn and rigid.",
    "taurus": "Nov 7, 2025- You may feel pressured to make an important, decisive move today. Expansive options are coming into focus. You may experience opposition as you stand up for what you believe. Your desire for freedom gives you a positive outlook that others find inspiring. Don't lose your adventurous spirit by thinking you need to tie yourself down to solid commitment.",
    "gemini": "Nov 7, 2025- Try not to approach everything negatively. By doing so you may cut yourself off from incredible opportunities. This is a time to be expansive. Spread your wings and feel free to lift off the ground. Take greater pride in your work. You'll reach the goals that you strive for. Enjoy the path you're on. The journey is the reward.",
    "cancer": "Nov 7, 2025- Long-term trends are lining up in your favor. You're at a pivotal point in which you can latch onto something big and take off with it. Let your dreams expand. Telling people how to run their lives will get you nowhere. Lead by example. Follow your creative intuition and explore more of the things that make you truly happy.",
    "leo": "Nov 7, 2025- There's an incredible activation urging you to take hold. You may have many different projects brewing and be unsure where to focus your energy. Don't feel like you need to make a decision now. Go with the flow, but don't lose control. It's important to maintain control while events unfold around you. Be flexible and adaptable.",
    "virgo": "Nov 7, 2025- There's a powerful tension in the air today. This is a great force you can tap into and capitalize on. Communication can help expand key aspects of your life. Stretch beyond your current boundaries and don't sell yourself short. Concentrate on inviting in wealth and prosperity. Long-term cycles and trends are lining up in your favor. It's up to you to make them work for you.",
    "libra": "Nov 7, 2025- You won't have any idea how to fight if you don't know who your enemies are. Keep an eye out for people who try to bring you down. Their energy may be subtle so you might not even notice their influence at first. Today's powerful planetary energy creates a manipulative power struggle that may hinder your expansion and prosperity. You have the willpower to overcome these challenges.",
    "scorpio": "Nov 7, 2025- A strong transforming force may be pulling you in opposite directions now. Long-term trends are coming to a climax. Karma that you haven't resolved over the past few years may come back to haunt you. Today's planetary lineup is turning up the heat on your present situation. You're going to need your flameproof suit.",
    "sagittarius": "Nov 7, 2025- You may be indirectly affected by a struggle. A heated debate having to do with mistaken communication and extreme emotions might devastate your psyche unless you keep up your defenses. The acting planetary energy is forming an arena for emotional turmoil. Whether you want to or not, you're probably going to get sucked into it.",
    "capricorn": "Nov 7, 2025- Use today's electric feeling to fuel your passion. A subtle tension has been building for some time. You've reached a critical turning point. Don't shy away from adventure because you fear failure. Change and open up your heart to the world. You may hesitate to make a move because you don't want to make waves, but how else are you going to advance in life?",
    "aquarius": "Nov 7, 2025- Don't let other people's arguments get in the way of your truth. Don't doubt yourself. Stop worrying. Don't be disgruntled if you aren't fitting in with whatever is going on around you. This indicates that you may need to take another route. If you don't like the music being played, start your own band. You have everything in your power to make it happen.",
    "pisces": "Nov 7, 2025- You may work hard today to balance powerful forces. You may be torn between a lust for adventure and a need for communication. Either way, the bottom line is freedom to do and say the things you want. This is an important time to spread your wings despite any opposition. You can't go wrong with anything involving higher learning, religion, or spirituality."
}