{
    "aries": "Mar 21, 2025- Increased enthusiasm for your favorite project may take you in a new direction, Aries. You could even decide to change careers in order to devote yourself more fully to doing what you've discovered you love the most. Your physical, emotional, and spiritual health should be very good right now. Your quality of life is likely to be improving. Go with the flow.",
    "taurus": "Mar 21, 2025- If you're in a committed relationship, expect to feel a new sense of mutual purpose and make some new friends. If you aren't involved, Taurus, love could come into your life today. You may just think it's about time, but changes in you are attracting interesting people. Children who come into your life now might prove to be natural gurus who help you in your spiritual quest.",
    "gemini": "Mar 21, 2025- Positive emotions like love, enthusiasm, or optimism that have been repressed for years could surface today, bringing a new sense of joy and anticipation for the future, Gemini. This could involve activities that you enjoyed as a child. Don't feel silly if you want to ride a merry-go-round or go to the circus. You should indulge your inner child from time to time. Have fun.",
    "cancer": "Mar 21, 2025- Group activities like rallies or festivals could take place in your neighborhood today. You may attend, Cancer, and you could learn some new concepts that give impetus to your spiritual growth. You may run into some old friends you haven't seen for a while. Talking with others could start your mind in a new direction. Take a walk before you go to bed tonight or you might not be able to sleep.",
    "leo": "Mar 21, 2025- The development of a talent that you've neglected could have surprising results, Leo. You could find that it's just what you need in order to expand your horizons and catapult you into whatever situation you want to be in. This could lead to an increased income. You're changing inside, and these changes are mostly positive. They may also be reflected in your outer life.",
    "virgo": "Mar 21, 2025- A period of great inner transformation and powerful upheaval in your outer life is coming upon you now, Virgo. A part of you wants to welcome it and charge ahead, while another part holds back, possibly out of fear or lack of self-confidence. While resistance can delay the change, it can't stop it. It might be best to continue forward in spite of misgivings. Hang in there!",
    "libra": "Mar 21, 2025- Your intuition should be growing by leaps and bounds. Today you may get psychic messages from everywhere, both personal and universal. This can be a bit overwhelming, Libra, particularly if you aren't used to it, but don't fight it. It's a symptom of your inner growth. It should be a very positive development in the long run. It can help turn your dearest dreams into reality.",
    "scorpio": "Mar 21, 2025- A number of new and exciting relationships could appear in your life now, some of them showing promise of becoming close. Old ones seem to be fading. This can make you a little sad, Scorpio, but it's a process that you can't stop. As you change inside, so your relationships change. You might attract friends who share new interests. Go with the flow.",
    "sagittarius": "Mar 21, 2025- Rewards from hard work and dedication could finally be in the offing, Sagittarius. You experience the warm feeling that comes from deep satisfaction and knowing that you deserve everything wonderful that's happening. You will want to bask in your happiness with your loved ones. Plan a celebration and share your good fortune with the people who have supported you.",
    "capricorn": "Mar 21, 2025- Educational or spiritual growth on your part is likely to attract new friends who could become close companions. There could even be a new romantic partner in the bunch. This comes from the expansion of your mind, Capricorn. The new people should share your interests and turn into companions on your quest for enlightenment. Accept their friendship and move ahead. Don't look back - you can't go back.",
    "aquarius": "Mar 21, 2025- An increase in your financial status could lead to changes in your household. You might choose to redecorate or purchase new furniture or move to a better place. A household member might move out. Although it seems illogical, Aquarius, the changes in your surroundings reflect the transformations taking place within you. Don't let fear or inertia hold you back. Go with the flow.",
    "pisces": "Mar 21, 2025- Inner transformation is likely to make a big difference in your communications right now, Pisces. Your relationships could improve because you're more open and honest without being too blunt. You seem to have a greater understanding of the needs and desires of those closest to you. Unfortunately, this process could also involve leaving some old friends behind. Don't fight it."
}