{
    "aries": "Nov 22, 2025- There might be one aspect of your nature that you ignore. You always need to be the one in charge in a relationship. It would be wise to change this. The planetary configuration can help you do that now. People will be much more receptive to your natural charms if you can change your controlling attitude!",
    "taurus": "Nov 22, 2025- Don't let your emotions get the better of you today. If you can harness them, you'll have the vital force of ten people. You can be invincible. You can do whatever you feel like doing and no one can stop you. If you share this energy with others, they might end up feeling like you do - the best in your whole life.",
    "gemini": "Nov 22, 2025- Finally, today, you'll know what it feels like to be in charge of things. You'll even feel that you were born to do it. In any case, you'll beautifully coordinate the day. You're the maestro conducting a full orchestra. You'll tell those around you what to do all day long. Isn't it fun to feel such personal power?",
    "cancer": "Horoscope not available.",
    "leo": "Nov 22, 2025- Your behavior is about to improve your love life. You're no longer hung up about your body. You're no longer distracted by it during passionate moments. You'll focus on and enjoy the here and now, and you won't be lost in your thoughts like usual. You're a new person about to experience the pleasures of life.",
    "virgo": "Nov 22, 2025- You'll have a lot of stamina in the weeks to come. Your energy will increase, thanks to the prevailing planetary transits. You thrive on your romantic desires and your creativity. You should try to stay in control of situations. Don't let your or anyone else's emotions take over your life.",
    "libra": "Nov 22, 2025- You're a sensual person. You have a strong emotional force. Today that energy will increase and express itself vigorously. The people you encounter will be astonished by your power. You could easily seduce the entire world. Try to keep this energy under control. You could be thrown off balance and into a situation you might regret.",
    "scorpio": "Nov 22, 2025- You love to meet new people and talk to them, but you rarely get personally involved. You keep a certain distance between you and the person you're talking to. Today you'll wonder if you're missing out on interesting experiences by controlling your emotions so tightly, or if your defenses are high for a good reason.",
    "sagittarius": "Nov 22, 2025- You'll probably feel a little lost today. You'll have to come to a decision in the near future, and your life will be greatly affected by it. Should you listen to your desires? Should they be in charge of your life? Or should you try to rein in your feelings and take the more practical route? It's something to think about.",
    "capricorn": "Nov 22, 2025- Today you'll change your approach to relationships. In the past, they were based on feelings, but now you'll decide that they should be more rational. You might feel that this sudden change of attitude could detract from your happiness, but it could also lead to stronger, more stable relationships.",
    "aquarius": "Nov 22, 2025- You've decided to let yourself go. You're tired of being a perfectly controlled person. You don't want to restrain your urges anymore! Something in the air is different. You can express your needs freely. Talk to your partner about your desires. Your relationship can only benefit from your current frame of mind.",
    "pisces": "Nov 22, 2025- The present planetary aspects could change your approach to life. Almost compulsively, you'll need to deepen your relationships with the people you've recently met. You'll probably be attracted to one of them, but be careful, as this person might not feel the same way about you. Look on the bright side. Why would you want to waste your energy on someone who doesn't care about you?"
}