{
    "aries": "Sep 28, 2025- You could be feeling energetic and driven. There's something you feel you absolutely must work on today. Chances are you won't be able to shake this conviction, so it's best if you just roll up your sleeves and get going on it. You'll undoubtedly get more accomplished than usual and be proud of the results.",
    "taurus": "Sep 28, 2025- Do you have the uncomfortable feeling that there's something you ought to be doing but can't think what it is? This feeling could bother you all day. It's best to try to remember. Try sitting in a hot tub. Lean back, close your eyes and let the water flow around you. You may not recall it right now, but it will probably come to you later.",
    "gemini": "Sep 28, 2025- Are you involved in an important group activity, possibly with close friends? If so, you might be working on a vital task, probably involving communication. A love partner might also be involved. You can be rather intense at times like this, so don't come on too strong with those around you. Use all your people skills, be a good listener, and you should accomplish what you want.",
    "cancer": "Sep 28, 2025- Career matters may force you into the public eye just when you'd prefer to sequester yourself and work alone. This could be frustrating, but significant financial benefits could depend on it. So come out of your shell and meet your public! In the end, you'll be glad you did. You could make some great contacts and even some new friends.",
    "leo": "Sep 28, 2025- Romance with someone from far away who shares your spiritual inclinations could arise today. This could be a very intense, loving, and supportive relationship. Don't be shy, and don't let your insecurities get the better of you. There's never any guarantee that a love relationship will last, but don't hold off because of that. Get to know this person.",
    "virgo": "Sep 28, 2025- You may have a very busy day ahead, but you might not be able to concentrate. Too many issues could churn up from the past. Old emotional traumas, money problems from years ago that still haunt you, even past dreams could be on your mind. Don't fight it. This is a healing process. Clear the psychic space to make way for more positive input.",
    "libra": "Sep 28, 2025- A business or romantic partner could be gloomy today. Don't ask. Your friend might lash out at you. Your concern isn't unappreciated, but sometimes people prefer to work things out on their own. Be a good listener, but back away if necessary. Do something by yourself. Your partner will speak when he or she is ready.",
    "scorpio": "Sep 28, 2025- Have you been putting off some work? It may be weighing on your mind. You could work extra hard today to get it out of the way. Afterward you'll feel relieved, but don't push yourself too hard or you won't have any energy left for tomorrow. If some of the tasks don't get done, that's OK. They've waited this long, so another day won't hurt.",
    "sagittarius": "Sep 28, 2025- A powerful creative urge may come upon you today. Your intuition should play a strong role in whatever you produce. You may feel driven to finish your project. The only downside might be that your partner may not understand why you want to work instead of go out. Follow your heart and keep working. Your friend will see it differently when you show the results.",
    "capricorn": "Sep 28, 2025- A couple, perhaps friends, could visit today. Perhaps you've moved into a new home or redecorated and want to show them around. They'll be impressed and you'll enjoy the company. Do they share an interest in dreams with you? The subject of dreams may come up in the conversation. You could be surprised at the insights your friends have.",
    "aquarius": "Sep 28, 2025- Romance blossoms for you today. If you're single, a walk around the neighborhood could put you in touch with someone new and exciting. If you're involved, you and your significant other could plan a trip out of town, perhaps a weekend getaway. The trip may be partly related to business. This is a great time to write, even if it's only a letter to a relative.",
    "pisces": "Sep 28, 2025- Are you attracted to someone connected with your work? If so, romance with this person could be in your immediate future. Don't be surprised if your colleague suddenly seems to express an interest in you. What you do about it depends on your situation, but at least you'll be flattered. You could make a new friend."
}