{
    "aries": "May 29, 2025- Confidence and efficiency are the day's themes. Do you long to bring your romantic involvement to the next level? Do you wish your partner would consent to a more profound commitment? You can take advantage of the energy from today's aspects to give your future a gentle nudge in the right direction, Aries.",
    "taurus": "May 29, 2025- The relative tranquillity you enjoy today lets you listen more attentively to your inner self. You're well aware of the toll you pay when you try to ignore those nudges of intuition you sometimes feel. If you're alone at some point today, Taurus, take advantage of the time to evaluate the events of the past few days. You may gain some insight into what's troubling you.",
    "gemini": "May 29, 2025- You can look forward to an enjoyable day, Gemini. Neither family matters nor career issues will cloud your spirit, as everything seems to be proceeding smoothly and according to plan. Moreover, the day's aspects seem to be inviting you to be a little more adventurous than usual. Any artistic or romantic undertaking will be especially fulfilling.",
    "cancer": "May 29, 2025- There's no doubt that today will be excellent, Cancer. You can find satisfaction that puts a smile on your face and boosts your morale. There's the likelihood that you're challenging some of your core values. While it's true that these values have stabilized your life, you may be starting to feel they're less relevant. Approval from loved ones gives you the assurance that anything is possible.",
    "leo": "May 29, 2025- The forecast is wonderful today, Leo. You may have been asking yourself a thousand questions about what will become of you, especially in terms of your career. It's as though all your experience so far no longer make sense. The positive aspect of that observation will energize you today. Live for the moment, be in the present, and know that anything is possible in the future.",
    "virgo": "May 29, 2025- Admit it, Virgo. You have a tendency to run away from conflict in relationships. This can get you into some complicated situations. You don't always dare say what you think, and this can block your energy and determination. Try to stop yourself from running away today. Take responsibility for your opinions. Don't be afraid to voice them.",
    "libra": "May 29, 2025- Do you feel that your power has increased, Libra? You may not know what to do with this newfound strength. Try looking at how you relate to your friends. Could you improve your relationships? Using power is something that one learns over time. If you let it stagnate, it will create some stubborn obstacles. \"Use it or lose it\" applies in this instance.",
    "scorpio": "May 29, 2025- You may feel that your current relationships are more complicated than ever, Scorpio. This is because you're going through a period when many planets are trying to shed light on your hidden motivations. When you're finished analyzing and have an understanding of what really drives you, your relationships will seem much simpler.",
    "sagittarius": "May 29, 2025- You finally understand that the force of your will can't always determine everything, Sagittarius. Your ego is taking a beating, no doubt, but this will help you mature. You accept being wrong and willingly revise your judgment when necessary. In a way, you've just finished your first year at a university for wisdom!",
    "capricorn": "May 29, 2025- You're currently stuck between two strong desires - the desire to create for your own pleasure and the desire to please others. You come by this latter urge naturally, as it's part of your character. It will understandably be difficult for you to resolve this dissonance. The solution for you comes from asking why you feel such a strong need to be appreciated.",
    "aquarius": "May 29, 2025- You may feel more of an urge than ever to search for your family roots. Your search could be so deep and intense that you may even go beyond genealogy and study archeology as a way to learn how to bring some cohesion to the odd bits and pieces of family remnants that you uncover.",
    "pisces": "May 29, 2025- Today you may be impressed by the powers of concentration and self-discipline of one of your friends. There's a lesson to be learned from your admiring stance, though. The fact that you recognize these qualities in others means that you're making progress. Don't be shy, Pisces. Strut your stuff!"
}