{
    "aries": "Jan 22, 2026- Your opinions are apt to be strong today and you may feel on top of the world, Aries. Remember, however, that there are other people who share the world with you, so don't disregard them as you plow though the day. Expressing your thoughts should be no problem, but expressing your emotions could be a whole different matter. Don't push it if it doesn't feel right to share them with others at this time.",
    "taurus": "Jan 22, 2026- Realize that you may be controlling other people's actions without even consciously knowing it, Taurus. This is one of those days in which emotional outbursts could explode in your face as a result of other people's reactions to your pressure. Don't feel like you need to take on the responsibility of everyone else's actions. You may be having a hard enough time dealing with your own personal issues.",
    "gemini": "Jan 22, 2026- Beware of unexpected circumstances today, Gemini. The good news is that your flexible attitude is perfectly suited to deal with the twists and turns that this day is likely to offer. While other people may get upset when their plans go awry, you'll find that you can surf the waves easily and turn any situation into a positive one, regardless of the way in which you planned things to work out originally.",
    "cancer": "Jan 22, 2026- Come out of your shell today and try not to be so aloof, Cancer. You will never find the exact path you want to be on until you explore the different options. The good news is that you should be feeling quite strong emotionally, giving you the confidence to approach people with authority, thereby earning their respect and faith in whatever project you're involved with now.",
    "leo": "Jan 22, 2026- You may be wondering why everyone is getting so touchy when you see this as being just a normal day, Leo. Cut other people some slack when you think they aren't wearing as big a smile as you are. If you want people to trust you, you need to prove that you can bring yourself to the same level that they're on. Show a greater understanding of other people's needs.",
    "virgo": "Jan 22, 2026- It could be that you don't feel as if you can begin your day until you've made it clear to someone that you have an issue that needs to be dealt with, Virgo. You have a greater amount of emotional strength than usual, and you'll find that it's important that you hold on to this feeling against all odds. Other people may try to strike you down with their words, but pay attention to what they're saying. Are they really focusing on the facts or just blasting you with their opinions?",
    "libra": "Jan 22, 2026- Don't let another person's small, thoughtless comment ruin your entire day, Libra. People may be a bit stingy with everything from money to emotions to time spent with loved ones. The more you tell someone else that they're wrong, the more that person is going to reject your advice. In general, this is a good time to simply stay out of other people's way.",
    "scorpio": "Jan 22, 2026- You may be feeling a bit tired and worn out lately, Scorpio. Don't push yourself to do things when you know that your body needs rest. It could be extremely tempting to roll with the crowd and participate in all the fun. You don't want to miss out on a single thing going on around you. Resist the temptation to disregard the important messages that are coming from your body. Slow down.",
    "sagittarius": "Jan 22, 2026- Don't fritter away your time with a person who isn't going to change his or her mind about something, Sagittarius. This is one of those days in which you may end up wasting your time and everyone else's by continuing to insist that things be done a certain way. If you want to do something your way, then do it. If someone else wants to do something his or her way, then let that person do it.",
    "capricorn": "Jan 22, 2026- More than likely there is a person in your world who desperately wants to get closer to you, Capricorn. Conflict is apt to arise tonight if you don't open up and let this person in a bit closer. It could be that you're quick to snap back with a forceful opinion, but be careful that you don't scare them away entirely. This person wants to share more of an intimate space with you, but perhaps they just don't know how.",
    "aquarius": "Jan 22, 2026- It may be easy for you to show up at a party or answer the phone when you know that it's your best friend calling with good news, but where are you when the going gets rough, Aquarius? Make sure you show your support to people in all situations. Don't be just a fair-weather friend. Your loyalty to others may be tested today when conflict arises and tempers get high.",
    "pisces": "Jan 22, 2026- Realize that your inner state of mind is quite apparent to people just by the look on your face, Pisces. Don't think you can hide things from others, especially today. You're better off just saying how you feel even if you think someone may be put off by it. Your emotional state should be strong, so use this to your advantage."
}