{
    "aries": "Nov 23, 2025- Today someone might ask what you're thinking about. You often think about things that are inaccessible to others. Today it will be like you've gone inside yourself on your quest for answers to spiritual questions or the secrets of life. Just tell him or her you're trying to rest, as they probably won't understand what you're thinking about anyway.",
    "taurus": "Nov 23, 2025- You love to have very serious discussions about important issues well into the night. You rebuild the world the way you'd like to see it with your friends. But now you start yawning around ten and are in bed within the hour. This is true today, too. Are you tired or do you need to be alone to think about things?",
    "gemini": "Nov 23, 2025- Do you often act as if the world is static and nothing ever changes? Sometimes you may think that humankind is a certain way, the world is a certain way, and so this is what you're going to do. Have you ever heard of evolution? The human race is constantly evolving, and so is the world. Look around!",
    "cancer": "Nov 23, 2025- Today let your emotions mingle with your thoughts. What good is telling yourself that you must like something if you really can't stand it? What good are grand principles if your heart isn't in them? Take the time to put your head in sync with your heart today.",
    "leo": "Nov 23, 2025- Today you may feel like going into your past. One half of you feels nostalgia for the \"good old days.\" The other half lives for the future and is unafraid to project into the unknown. Even though this sounds a bit contradictory, both these sides of you help the world move forward. Think about this today.",
    "virgo": "Nov 23, 2025- You're sensitive to the world around you. It's like you're thinking with your heart. It's possible you'll be more impressionable and less objective when your emotions get the better of you in your relationships. If you'd hoped to hide something from someone, it won't work. Even if you say nothing, it's written on your face.",
    "libra": "Nov 23, 2025- If you had to take a test today and had a choice between poetry and physics, you wouldn't hesitate. Poetry. Today is about interpretation, not analysis. A change in the atmosphere over the next few days is going to affect your thinking. You should expect some confusion in your contact with the people closest to you.",
    "scorpio": "Nov 23, 2025- Do you have a talent for writing? You seem to have a precise and clear way of expressing yourself. And it's possible you use this gift of yours in your career. Today you might want to use it to express your feelings about someone. Whether you write to a family member or compose a love letter, you'll be particularly inspired.",
    "sagittarius": "Nov 23, 2025- You have a pleasant day ahead. People may be a little less playful, but they'll be all the more caring in their relationships. That's just how you like them! Everything is on your side for you to express your feelings to someone close. Do it now! This atmosphere will only last a few days.",
    "capricorn": "Nov 23, 2025- You should expect to feel warmth in your contact with other people today. Your relations will have something particularly tender and caring about them. It's like people are suddenly much more attentive and sensitive. The universe is like one big, happy family. You can confide in other people. Don't be afraid to talk about your most intimate feelings with a friend.",
    "aquarius": "Nov 23, 2025- You won't be disappointed today. Over the next few days you're going to put your analytical way of thinking aside and let your feelings guide you. You'll be attentive to the people you love. If someone needs your help, you can be counted on to come to the rescue. You'll spare them the lecture about what they've done wrong!",
    "pisces": "Nov 23, 2025- Today is great for creativity, especially the kind that shows your special style. You're productive, although what you've been creating is just a reflection of the latest fashions. This is one of your drawbacks, as it keeps you from being true to your special style. Today you should use your feelings as your inspiration."
}