{
    "aries": "Aug 21, 2025- Stay busy today, Aries. Keep your mind occupied with basic tasks that need doing. You can accomplish a lot by multitasking, writing down a plan, and sticking to it. There is no shortage of things that need to be done so stop procrastinating. If you feel stuck on something, don't be afraid to ask for help. Friends and co-workers are your greatest resources right now.",
    "taurus": "Aug 21, 2025- You're at an emotional climax now, Taurus. Things are coming to a critical point. Little issues in your relationships that you've ignored are coming back to haunt you. Someone could be trying to cross you at this time, or maybe it just feels that way. Don't get overly paranoid. The whole world isn't out to get you.",
    "gemini": "Aug 21, 2025- You may feel confused, Gemini. If so, take a breath and slow down. Being frantic will only run you in circles. Your heart and mind are buzzing in all directions, so try to settle down. Don't feel like you need to come up with any particular solutions. Trying to pin things down will only frustrate you and waste your time.",
    "cancer": "Aug 21, 2025- Embrace your loved ones, Cancer. Let your heart lead the way. Things will flow your way if you let them. Don't try to fight the good fortune that comes. If you try to force the door open, it won't budge. Knock gently and it will open by itself. You mind is quick today. Get things moving in a positive direction. Jump on the uphill spiral to success.",
    "leo": "Aug 21, 2025- Listen to the birds today, Leo. They have a song for you, telling you to be happy. Take time to do things that make you feel good. Connect with creative people and projects that get your artistic juices flowing. Keep things light and uplifting. It may be hard to make a decision about anything right now, but don't let that keep you from being productive.",
    "virgo": "Aug 21, 2025- There is power behind your heart, Virgo, and you might come across more forcefully than usual in the love and romance department. This is a good day to make a bold move toward someone. Your internal fire burns more brightly than ever. Share this warmth. Spreading your love will ensure that people are happy to keep you warm on days when your fire sputters out.",
    "libra": "Aug 21, 2025- You might feel like your heart requires a bit more attention than usual, Libra. There could be a close loved one who is even needier than you. Either way, this situation is going to cause tension in an important relationship. If you're not currently involved with someone, this is probably for the better. Things aren't always as they seem.",
    "scorpio": "Aug 21, 2025- Things go well in your love life today, Scorpio, but only if you let them happen. You must first open your arms to give and receive. If your arms are full of laundry, it will be harder for people to hug you. Take your clothes to the cleaners and keep your arms free to receive the love you need. Remember that giving is as important as receiving.",
    "sagittarius": "Aug 21, 2025- Spend time with someone you love today, Sagittarius, but keep things light and easy. Don't go too deep, and don't expect others to necessarily feel the things you feel. You might feel slighted when others don't give you the attention that you think you deserve. Don't take it personally. Others may be unfocused and short of attention. Don't expect any major commitments or deep conversations right now.",
    "capricorn": "Aug 21, 2025- Love is in the air for you, Capricorn. You will be rewarded handsomely because you have so many things to offer. Spread your love everywhere. Skip from place to place and person to person, receiving smiles of pleasure. Put your worries aside. There's every reason to be happy. Laughter keeps you young.",
    "aquarius": "Aug 21, 2025- You feel indecisive when it comes to a romantic situation, Aquarius. You might ask yourself questions about how to proceed. Don't get overwhelmed by all the possibilities. Take things one step at a time. The more you read into each small gesture, the crazier you will drive yourself. Don't run around in circles. Confront the issues.",
    "pisces": "Aug 21, 2025- Things should go quite well in the department of love today, Pisces. Pursue creative projects in social environments. The more time you spend with others, the more fulfilled you'll be by sundown. You're fueled by others' energy. Spend time with the people you love and you'll feel a solid sense of self-worth."
}