{
    "aries": "Jun 14, 2025- You may be a bit unclear about your professional direction today, Aries. Your motivation has disappeared without warning. What happened? It may be that you need to become involved in projects that have more universal resonance. Projects that concern only your interests or that are of narrow scope no longer hold your attention.",
    "taurus": "Jun 14, 2025- You could be seeing mirages at the moment, Taurus, most notably in the environment around you. You may have the impression that people are lying to you or that they're hiding something from you. Or it may be that you're the one who lies about certain things or hides what you do. Why are you making it all so complicated? Don't be afraid to express your feelings.",
    "gemini": "Jun 14, 2025- Hold on to your wallet, Gemini, because you may have some strange {though noble) impulses to give away your money or spend a large amount on something useless. You should think about spending your money in a better way or not at all. Why not consider donating some of your time rather than money to those in need?",
    "cancer": "Jun 14, 2025- Today isn't a good day to sign contracts or make any substantial purchases, Cancer. Go to the grocery store, by all means, but buy hamburger, not tenderloin. Keep your money at home and safeguard your reserves. Don't negotiate about anything. No matter how good the offer sounds or how compelling the deal, walk away.",
    "leo": "Jun 14, 2025- Are you certain you can't modify your current situation, Leo? Are you a prisoner of a lifestyle that isn't of your own making or is a throwback to the past? People have been asking you to take on too many responsibilities and this is weighing you down. Don't be afraid to distance yourself from these situations. Learn to say no.",
    "virgo": "Jun 14, 2025- The forecast for you is excellent, Virgo. You can rely on today's aspects to restore your self-confidence, which has been sorely tried during the past few days. The charismatic seducer in you can swagger forth, certain of conquest. However, don't go too far. Wait a while for reality to dispel the cloud of ecstasy and you will be able to see the future more clearly.",
    "libra": "Jun 14, 2025- You may have some trouble communicating today, Libra. It's as though something is distorting your perception. Don't be surprised if once evening comes you feel like forgetting about everything and traveling to the other side of the world. Tomorrow you will see clearly again. Without a doubt, there are adventures in store for you!",
    "scorpio": "Jun 14, 2025- You are radiant and glowing with happiness today, Scorpio! This is a refreshing change after the gloom of the past few weeks. Apparently, the decisions you made worked out for the best. Or even better, perhaps you're in love? In any case, it will be even easier than usual for you to communicate with others and share your joy. Let the good times roll!",
    "sagittarius": "Jun 14, 2025- Your goal for today is to enchant your mate. There's no reason not to try. Indeed, it's an excellent day for love. But don't exaggerate your seductive wiles, Sagittarius. Since the day's aspects tend to distort your perception of things, you may be deceived by what you see in the mirror. Be careful about what you do and how you do it!",
    "capricorn": "Jun 14, 2025- You're in splendid shape today, Capricorn! Did a fairy godmother brandish a magic wand to dispel all the little difficulties of the past few weeks? Enjoy this moment of relief from worries. As for your love life, some exciting opportunities may arise. Be on the lookout for them. Whatever you do, don't let them pass you by!",
    "aquarius": "Jun 14, 2025- It's certainly clear that you have faith in your actions, Aquarius! You feel no fear or doubt as you progress toward your goals at a fast clip, cruising along on calm seas under clear skies. This new atmosphere is likely the product of your renewed commitment. Reward yourself for your accomplishments, but you should wait a few days before launching an all-out celebration.",
    "pisces": "Jun 14, 2025- This is a moment to start being creative and stop worrying that you don't have talent, Pisces. Who's to say what \"talent\" is? In the romance department, the love of your life might be right under your nose. Try lifting your eyes from the romance novels and look around. The perfect mate could be any number of people in your daily life. You just have to open your eyes."
}