{
    "aries": "Jan 24, 2026- Love blossoms today as communication with your beloved is enhanced by an increased understanding on both your parts, Aries. You feel more at ease in each other's presence, and you project a united front in the company of others. At some point, both of you will probably go out with a group of friends. Expect some exciting and fascinating discussions with the others, which you'll probably continue once you're alone together. Have fun!",
    "taurus": "Jan 24, 2026- A number of visitors might come to your house today, Taurus, perhaps to discuss matters of interest to all of you. Some intense disagreements could arise, but you'll be able to keep it all together. An intellect enhanced by intuition enables you to understand and explain complex ideas, and you'll also be able to derail misunderstandings before they even happen. Providing tasty treats could also help smooth ruffled feathers.",
    "gemini": "Jan 24, 2026- If you're into computers and the Internet, Gemini, you can expect to spend a lot of time today staring at a screen. You may be doing some writing or web design or animation, but whatever it is, you'll probably find it noticeably better than what you usually produce. Intellect joins with intuition to produce inspiration and insight. Make the most of it now and you might develop some new and lasting skills!",
    "cancer": "Jan 24, 2026- Using computers either to increase your income or manage your money may have seemed like Greek to you, Cancer, but today you'll probably catch on very quickly. Your natural practicality joins with an enhanced intellect and heightened intuition to give you an advantage you don't usually have. If you concentrate on learning it all today, it'll probably continue to be useful for you for a long time. Go to it!",
    "leo": "Jan 24, 2026- Intellect and feelings are totally joined today, Leo, especially when dealing with friends. Your basic understanding of others is also enhanced by a keener sense of intuition. You might become interested in a cause of some kind, perhaps metaphysical, social, ecological, or humanitarian in nature. There could well be more than one that you find appealing right now. Use your expanded mental and emotional capabilities to discern which are best for you.",
    "virgo": "Jan 24, 2026- A focused and enhanced practical turn of mind, strengthened by intuition, may be of great help to you today when considering career matters, Virgo. A change is in the wind and you might want to give considerable thought to different options that may be opening up to you. Don't think you have to rush into making a decision, however. It might be a good idea to let different possibilities simmer in your subconscious for a day or so.",
    "libra": "Jan 24, 2026- You probably won't want to spend much time at home today, Libra. Most likely you'll want to be out and about, perhaps at a large gathering, perhaps just strolling down a city street watching the people go by. Insights and revelations come to you that you'll probably be able to make more sense of than you usually do, because mind and feelings are joined in a very effective partnership. Write your ideas down! Enjoy your day.",
    "scorpio": "Jan 24, 2026- Your imagination is flying high today, Scorpio. Intellect and intuition join together in a vivid and explosive union where the whole is definitely greater than the sum of the parts. Don't waste this energy. Get busy and work on whatever creative projects you're involved with, or start one if there aren't any. This energy may not come around again for a while and you'll want to make the most of it. Have fun!",
    "sagittarius": "Jan 24, 2026- Thoughts of travel could be on your mind today, Sagittarius, and you might tinker with the idea of actually taking time off and going somewhere that you've always wanted to visit. A friend or love partner might want to accompany you. The only problem might be figuring out what place you want to see the most. This could involve a rather difficult decision. Don't let it become obsessive. Follow your heart.",
    "capricorn": "Jan 24, 2026- Some unusual dreams may come to you tonight, Capricorn, and you might awaken with the idea that they're very important. The images should be very clear, however, and you probably won't have much trouble working out what they mean. Intellect joins with intuition today in a rush of insightfulness. Make the most of this advantage now, and later decide how best to act on your revelations.",
    "aquarius": "Jan 24, 2026- Relationships of all kinds should be thriving at this time, Aquarius. Mind and emotions join together in a beneficial partnership, enabling you to increase your understanding of those close to you. Romantic involvements strengthen in particular, as an understanding of your partner's values, attitudes, and motivations becomes clearer to you. Make your new insights known to everyone around you, preferably in a subtle rather than verbal way. The latter might sound patronizing.",
    "pisces": "Jan 24, 2026- Work of all kinds gets done a lot faster, Pisces, as friends or family members join in assisting you in getting it out of the way. You've made this possible because your intellect has joined with your emotions in strengthening your communication with others. The old saying, \"You can catch more flies with honey than with vinegar\" is very true, and you'll learn all about it today! After the tasks are complete, throw an impromptu party!"
}