{
    "aries": "Aug 23, 2025- Recent overindulgence may have you to feel a bit under the weather this morning, Aries. Avoid coffee and other stimulants. Try to sleep in if you can. Too much stress in your life certainly isn't helping. This malaise could pass by noon, but if you've been doing this a lot lately, you need to ask yourself why and find a way to quit doing it.",
    "taurus": "Aug 23, 2025- Feelings of love for a romantic partner could be so overwhelming today you might be moved to tears, Taurus. You will experience a lot of sensual passion, so an intimate evening together is definitely called for if you can arrange it. If it isn't possible, don't jump to the conclusion that your friend doesn't desire you anymore. If your friend claims to be busy, it's probably true.",
    "gemini": "Aug 23, 2025- Today the walls may seem to be closing in around you, and you're anxious to get out for a while, Gemini. Your significant other could want nothing more than to stay in. Don't let this turn into a major issue. Find a compromise. Go out to dinner and then come home and watch TV. Enjoy your time together! If single, get out and mingle.",
    "cancer": "Aug 23, 2025- Some wonderful news may come to you today, Cancer, and this could send you into such excitement that it's difficult to concentrate on the situation at hand. This is OK for a while. Your friends and loved ones will probably understand. But at some point you need to come down to Earth! Take a walk and work off the excitement. That might be just what you need.",
    "leo": "Aug 23, 2025- A friend or colleague may pay you back a small sum of money that's owed to you, Leo. You'll be thrilled, but you might feel a little guilty that you plan to spend it on something frivolous instead of putting it toward your bills. This isn't worth the guilt. It isn't that much money, and you're entitled to a little frivolity now and then. Go for it!",
    "virgo": "Aug 23, 2025- Your home may seem lonely today, Virgo, and love may seem to be absent. A family member, perhaps your love partner, could be away for the night, making the place seem far colder and emptier than it is. This isn't a good night to stay home. Go out and visit a friend or go to a movie. You need to keep yourself occupied until your partner returns.",
    "libra": "Aug 23, 2025- Are you preoccupied today, Libra? Something that means a lot to you could require some careful consideration so you might be quieter than usual. Loved ones may think that you're ill, upset, or even angry. Talk to them about what's on your mind. Let them know why you're quiet. That should relieve their fears and they might even be able to help.",
    "scorpio": "Aug 23, 2025- Money worries may plague you today, Scorpio. There might not be any real reason. You may just be fretting over possible troubles that could come up. This is a pointless exercise. Cross that bridge when you come to it. Take steps to avoid this contingency if you wish, but don't waste time worrying. The stress isn't worth it.",
    "sagittarius": "Aug 23, 2025- A friend could seem distant today, Sagittarius, and probably won't be communicating with you much. Don't jump to the conclusion that your friend is upset with you. If anything, this person is probably worried about his or her job. Just be your usual friendly self, don't push, and go about your business. Your friend will talk when the time is right.",
    "capricorn": "Aug 23, 2025- Are you picking up on some unsettling feelings from a friend who lives far away, Capricorn? You may wonder if there's something wrong in this person's life. Perhaps you'd better give your friend a call. You'll probably find out that whatever is troubling him or her is minor and nothing that can't be dealt with. Anyway, it will be good to catch up!",
    "aquarius": "Aug 23, 2025- Is the stock market taking a nosedive again, Aquarius? Is this causing you to worry about your investments? Relax! The situation is likely temporary, and your stocks and bonds will probably regain their former value, if not surpass it. However, this isn't a good day to make new investments or even to open a bank account. Wait a few days.",
    "pisces": "Aug 23, 2025- Your love partner may be experiencing some minor conflicts with colleagues today, Pisces, and may seem distant and preoccupied. The problem could well pass by tomorrow, but your friend isn't likely to listen to any reassurance. Just make it clear that you're there if needed and then do something else. Your beloved may have to come to terms with this alone."
}