{
    "aries": "Jul 14, 2025- Today you may put a lot of energy into your romantic relationship, Aries. The astral energy is encouraging you to focus on romance. Give your significant other a special gift to show how much you care, and spend some time alone together. Any romance initiated or advanced today is likely to prove stable and long lasting. Don't let fear stand in your way. Move ahead.",
    "taurus": "Jul 14, 2025- Too much work and the resulting pressure over the past few days may have you feeling too tired to do anything more, Taurus, although your optimism and enthusiasm are still intact. Don't be too hard on yourself if you're dragging by the end of the day. If you take care of yourself, you will soon recharge and be your old self again. In the evening, read a good book.",
    "gemini": "Jul 14, 2025- Romance blossoms for you, Gemini, perhaps after a long standstill. A new stability and security may settle on love relationships as well as close friendships. Children could be a great source of warmth and pleasure. You might want to channel some of this blossoming positive energy into a creative activity of some kind, which should increase even further your sense of contentment and well-being.",
    "cancer": "Jul 14, 2025- You might host a social event in your home tonight, Cancer. You may be nervous at first, wondering if all will go well. Your efforts should produce the results you want. You might be introduced to new contacts, which could lead to increased professional opportunities. Take a walk after everyone has gone. Your mind will be going a thousand miles an hour and you will want to clear your head.",
    "leo": "Jul 14, 2025- Paperwork, perhaps contracts or other legal documents, might need attention so you can move ahead with your projects, Leo. These projects could involve writing or speaking. Your mind is in just the right space to participate in anything involving communication, so doors of opportunity may open for you in this area. Lift your chin and get going. You will be glad you did.",
    "virgo": "Jul 14, 2025- Your financial picture continues to improve. At some point during the day, Virgo, you might have the feeling that you aren't working hard enough to keep up your current forward motion, and you might worry. This could be a good motivator, but you don't need to push yourself much harder than you are now. You're on a roll and it's likely to continue. Keep moving, but pace yourself.",
    "libra": "Jul 14, 2025- Even though all continues to go well for you, Libra, your mood may vacillate today. In spite of all the great things in your life, at some time during the day you might feel a little blue. Don't read too much into it. It's probably just the result of low biorhythms. Try to distract yourself with physical activity. Go out with some friends and have a good time this evening.",
    "scorpio": "Jul 14, 2025- Trying to get too much work done in the course of the day could prove self-defeating, Scorpio. Your energy isn't what it usually is, and you're probably operating on adrenaline. Consider the situation carefully and list your tasks in order of urgency. The world won't come to an end if you don't get them all done by the end of the day. In the evening, watch a movie and order a pizza.",
    "sagittarius": "Jul 14, 2025- A despondent friend may need some cheering up. Your ability to nurture and listen sympathetically will definitely prove beneficial, Sagittarius. Take care not to absorb any of this person's dejection. Your life should continue to go well with professional successes leading to new friendships and goals. Hang on to your enthusiasm and optimism while showing compassion for others.",
    "capricorn": "Jul 14, 2025- Many projects to complete before a deadline might have you feeling pressured, Capricorn, but your determination is likely to drive you to try to get it all done even if it seems impossible. Don't try to do it all yourself. Ask for a little help. You can accomplish your ends without putting undue pressure on yourself. Try to relax today.",
    "aquarius": "Jul 14, 2025- You've been doing very well, Aquarius, but today you might feel more focused than ever. The path ahead seems clear and well defined. You're anticipating the future with motivation. You might be considering a long trip abroad or perhaps going back to school for an advanced degree. This is a good day to research and finalize your plans.",
    "pisces": "Jul 14, 2025- Some kind of settlement, grant, or bonus that you've anticipated for a long time may finally show up, Pisces. This should make your day! You may want to celebrate. A chance to attend a large social gathering might come your way. Have fun! Tonight don't be surprised if vivid dreams - some great, some sad - come your way. Keep a notebook and pen by your bed so you can write them down."
}