{
    "aries": "Nov 20, 2025- New learning and improved communication with friends and family add greatly to your sense of self-esteem. A task into which you've put some effort over the past several weeks has been completed successfully. You're now basking in the glow of others' admiration. You may even have a few extra dollars to spend. You've worked hard for this and deserve it.",
    "taurus": "Nov 20, 2025- An improvement in your relations with a love partner or close friend has you feeling optimistic about the future and even more so about the present. Your sense of self-worth is strong and you're formulating positive ideas about your life in the months ahead. Don't make any definite plans now. Write them down and go back to them later when the rosy glow has faded a little.",
    "gemini": "Nov 20, 2025- An unexpected raise could have you feeling especially generous toward those you love. Your gifts will be appreciated, but take care that you don't wipe out all you've gained. Romantic ideals could permeate your consciousness, and you'll be thinking wonderful thoughts about a passionate encounter with your love partner. Go for it. Hang onto the memory in the days and weeks to come.",
    "cancer": "Nov 20, 2025- Falling in love at first sight is something you never thought would happen, but it could happen today. A romantic involvement may follow or not, but the high you get from meeting a new person will make you feel better about yourself and life. A sense of adventure may have you longing to take a trip to a distant land. If you've wanted to plan a vacation, do it today.",
    "leo": "Nov 20, 2025- Movies that involve a lot of special effects might be especially appealing to you now. You may decide to learn more about how such effects are produced. You might also want to try your hand at computer graphics. The far reaches of your imagination might surprise you. Have fun with this. You could make it work for you in the future.",
    "virgo": "Nov 20, 2025- Life is an adventure. At least, that's the attitude you take today. Flush with past success and basking in the affection of friends, you're feeling especially confident and enthusiastic. You'll consider if not adopt any possible option for your future, even if it involves taking off for an exotic land! It will involve learning and meeting new people who share your interests.",
    "libra": "Nov 20, 2025- A new unity and purpose could create a more positive atmosphere regarding your career. Recognition and an increased income are just over the horizon. Don't be surprised if changes lie in store. You could end up in an entirely different profession! The support and affection of friends can see you through the transition.",
    "scorpio": "Nov 20, 2025- Optimism and excitement permeate any get-togethers that you're involved in today. You and those around you tend to see only positive trends for the future - success with few obstacles. You need to hang onto that attitude because there are always obstacles. You might forge a new support group with some of these upbeat individuals. Make the most of it!",
    "sagittarius": "Nov 20, 2025- Today you might be in the right mood to organize. High-tech equipment may be of help in this project, and so could the help of friends. An optimistic, enthusiastic attitude will sustain you through any tasks. You will be more than happy with what you've accomplished by day's end. Treat yourself. Go out and celebrate - you deserve it!",
    "capricorn": "Nov 20, 2025- You could feel especially amorous today. If you're romantically involved, you could have an overwhelming urge for an intimate dinner with your significant other. If you're uninvolved, expect that status to change shortly. A new person could cross your path and sweep you off your feet. Or you could see an old friend in a new light. Be prepared for anything.",
    "aquarius": "Nov 20, 2025- Necessary cleaning or repairs in the home could inspire you to go a bit further and do some redecorating. Get rid of old furniture or other castoffs to make room for new objects that make your home look more attractive. Friends and your special someone could volunteer to help you. Make a party of it! Everyone will have a good time.",
    "pisces": "Nov 20, 2025- Important new information could come your way, perhaps through classes, books, or conversations with friends. This might open new personal and professional doors for you. You could learn new skills with technology, enhance your artistic ability, or both. Whichever you choose, this is a great day to train your talents. In doing so, you could form some powerful new friendships."
}