{
    "aries": "Nov 30, 2025- Be careful about blaming yourself for something that you aren't responsible for. Maybe you influenced someone to act a certain way and now that action is backfiring negatively. Remember that everyone makes his or her own decisions. Ultimately, you aren't responsible for decisions that someone else makes, regardless of any advice you may have given him or her.",
    "taurus": "Nov 30, 2025- You're at an emotionally climactic time, and your feelings are erratic and perhaps unmanageable. Don't feel pressured into making logic out of anything. Your job is to take a deep breath and relax. Remember that life is an exciting adventure full of twists and turns. Erratic, roller-coaster emotions are a reminder of that. Enjoy the ride.",
    "gemini": "Nov 30, 2025- Don't box yourself into a corner and shut out everything around you except your immediate concerns. The more you isolate yourself and insist that you don't need anyone else's help, the more frustrated and sad you'll become. If you're lonely, scared, or angry, admit this to yourself and others. Extend yourself outward instead of drawing further in.",
    "cancer": "Nov 30, 2025- You're likely to take things to heart a bit more than usual. Dramatic changes in your environment and attitude will keep you on your toes. The wonderful thing about this is that you'll gain a great deal of insight and understanding of other people. You'll be more aware of other people's feelings and perspectives, helping you make more educated decisions in your affairs.",
    "leo": "Nov 30, 2025- Unexpected people, especially women, will surprise you with what they say. Your mother may bring up an issue that you hadn't even considered. Perhaps your emotions get stirred when you recall something that a significant woman in your life said. Your feelings are bouncing from your heart to your head and back again. Take the feelings into account, but don't let them dominate your decisions.",
    "virgo": "Nov 30, 2025- Today you want things done your way and your way only. Your mood is quite stubborn and others would be foolish to think they could change your mind about anything. You're the only person allowed to have that job. The truth is that you may change your mind several times today, and that's fine. Just don't expect anyone else to keep up with you!",
    "libra": "Nov 30, 2025- You may run up against a brick wall early today. Things should ease a bit by evening. Remember that the harder you push against that wall, the more your head will pound, the more bruised your shoulder will become, and the more energy you'll expend. You'll be surprised at how easy things get when you step back. You'll see that you can go around the wall without charging through it.",
    "scorpio": "Nov 30, 2025- You may feel like a racehorse crammed in the starting gate. You're stuck in a small spot, stomping your feet, and anxiously waiting for the starting bell. You may feel powerless since you have no control over when the gate will open. Be patient. Don't waste all your energy fidgeting. The gate will open soon enough and you'll be up and running.",
    "sagittarius": "Nov 30, 2025- Your mood will be up and down and back and forth over the course of the day. You're riding high from the past couple days, and you feel more bonded with the people at your side. You feel a nurturing love from someone who's keeping your heart happy and your mind at ease. Toward the end of the day you may feel that people aren't as sincere as they seemed at first. Stay on guard.",
    "capricorn": "Nov 30, 2025- Be careful about opening your mouth in situations in which it   isn't appropriate. When the conversation lags, you feel it's your duty to pipe up. By doing so, you may launch the conversation onto an inappropriate topic. You may want to say something just so you can shift the focus to you. The better choice is to allow the silence to sit peacefully.",
    "aquarius": "Nov 30, 2025- Get organized in the morning because later you're going to be more scattered. If you start with a solid plan for how to tackle the day's tasks, you're more likely to accomplish everything. If you don't remain strong and on task, other people will take advantage of your generous nature. You could end up doing more favors than work.",
    "pisces": "Nov 30, 2025- There may be a frenzy of activity around you, but you'll be able to handle it. Your charm will get you through any door. You should be able to juggle many things at once, and others will look to you for support. You'll have a level head and calm demeanor and handle things diplomatically and honestly. Don't be surprised if things get more insane as the day wears on, but this shouldn't faze you."
}