{
    "aries": "Mar 29, 2025- Unexpected visitors could wake you up to the possibility of new work opportunities, Aries. This could advance your current job or be work you can do on your own - maybe on a volunteer basis. Whatever it is, you will probably find it exciting. You might even be impatient to get on with it. Pace yourself. If you tire yourself out, you won't be able to continue.",
    "taurus": "Mar 29, 2025- If you aren't romantically involved, an errand, walk, or other foray into your neighborhood might bring an exciting new person into your life. This encounter may or may not lead to something lasting, Taurus, but you will enjoy it anyway! If you're currently involved, a casual outing with your partner could result in intimate conversations that bring the two of you closer.",
    "gemini": "Mar 29, 2025- Money that you may have been hoping to use to better your living or working condition could suddenly come your way today, Gemini. Ideas for how to put it to work in the most efficient, satisfying way could pop into your mind quickly. You will probably want to write them all down, consider your options carefully, and then choose the ones that suit your needs best. Go to it.",
    "cancer": "Mar 29, 2025- When you run errands today, check the bulletin boards in local businesses. You may have been longing for adventure and dreaming about getting away from it all, Cancer, but today you might find the excitement you crave right in your community. New events, people, and businesses that you will enjoy could be moving in. You might also discover a group that shares one of your interests.",
    "leo": "Mar 29, 2025- Information received today excites your imagination and encourages you to start a new artistic or creative project, Leo. Stories, pictures, abstract concepts - all could come together in your mind and form an inspired idea that could change your life. Gird your loins, write down your thoughts, and see where it all takes you. You might be surprised by what you produce!",
    "virgo": "Mar 29, 2025- Adventure is the word for today, Virgo. A lot of physical and mental energy, as well as enthusiasm, might lead you to aim for goals that others consider too risky or unrealistic. Don't let their opinions stop you. After giving each idea an objective assessment, if you still believe you want to try, start looking into it seriously. People have probably made stranger dreams than this come true!",
    "libra": "Mar 29, 2025- New career goals may come your way with the current aspect, Libra, opening up possibilities you may not have considered. This could be very exciting. It might even work toward the fulfillment of childhood dreams that you abandoned long ago. They may involve the arts, modern technology, or both. The only downside is that you might work too hard and get exhausted. Pace yourself.",
    "scorpio": "Mar 29, 2025- Fascinating new information could arrive today from TV or the Internet, opening up new educational opportunities. The possibility of making contact and perhaps visiting new friends in other countries might come to your attention. You will probably find this very exciting, Scorpio, and make plans immediately. This is fine, but be careful to consider all contingencies. Be practical and objective.",
    "sagittarius": "Mar 29, 2025- A sudden burst of physical energy and determination could lead to additional income for you, Sagittarius. This is probably due to an unexpected opportunity to do some extra work outside the scope of your usual employment. It could also be a long overdue payment for past work. You could also receive acknowledgement of some kind for work well done, further firing your enthusiasm. Go for the gold!",
    "capricorn": "Mar 29, 2025- Friends or a group with which you're affiliated could propose a trip. This might seem like a great adventure, Capricorn, so you're likely to go for it. You will probably have a wonderful time. You might make some new friends while you're away, or even fall in love. A little break might fire your enthusiasm for pursuing career or educational opportunities when you return. Go for it!",
    "aquarius": "Mar 29, 2025- An opportunity to do some extra work outside the scope of your regular job could present itself to you. Take it, Aquarius. Not only could you earn some extra money but you might also open new doors that expand your professional horizons. The only danger is that you might work too hard and tire yourself out. It's OK for a while, but don't make a habit of it. You need to conserve your strength.",
    "pisces": "Mar 29, 2025- You might be extremely busy now. Invitations to large parties, small gatherings with close friends, and intimate evenings with romantic partners might come up today. Be discriminating in those you accept, Pisces. Concentrate on seeing people who share your interests. This may bring new friends your way, as well as opportunities to expand your horizons. Romance looks great now."
}