{
    "aries": "Sep 17, 2025- Don't spread the good news too quickly, Aries. As exciting as it is, nothing is confirmed yet. Keep the information under your hat until plane reservations have been made or you have the job offer in writing. Whatever the good news is, it's exactly what the doctor prescribed to give your self-confidence a boost.",
    "taurus": "Sep 17, 2025- If you receive a financial windfall, spend it wisely, Taurus. Your tendency might be to buy gifts or treat a crowd to a lavish night on the town. But where is the enduring value? Invested carefully, a small chunk of money can grow into a much larger one, which will give you many more options. Be prudent.",
    "gemini": "Sep 17, 2025- You're energetic and enthusiastic today, Gemini, and those around you respond favorably. It seems everyone wants to be in your orbit. Work at home and the office goes quickly and smoothly. Because you have so much energy, why not take on a new project? Normally this would send you over the edge, but today you feel you could take on anything. Go for it.",
    "cancer": "Sep 17, 2025- There's tension all around you, so you'll be happiest spending as much time by yourself as possible, Cancer. If you must interact with people, keep your communication clear and concise. There's room for misunderstanding, which could result in a major blowup over a minor event. It simply isn't worth the trouble being with people today. Seclusion is the only place where you'll find peace.",
    "leo": "Sep 17, 2025- You're ready for a change, Leo, there's no doubt about it. As you grow older your interests broaden, and you're considering pursuing some of these new interests in earnest. Perhaps school beckons, or some adult education courses. You're ready to make a new place for yourself in the world. Go ahead and get started!",
    "virgo": "Sep 17, 2025- You've never looked better, Virgo. Your partner notices, too, and showers you with extra affection and perhaps even an unexpected gift. This should put a smile on your face! At work, you may be given responsibilities beyond your usual job. Take care to do this special assignment well. If you do, other advancements are likely to follow.",
    "libra": "Sep 17, 2025- Sometimes a little indulgence has value far beyond its price, Libra. A bubble bath in the middle of the day, a luxurious hour spent browsing in a bookstore, a special outfit you've wanted for a long time - these are a few of the ways you could perk up your spirits. Why not? You could use a boost.",
    "scorpio": "Sep 17, 2025- You feel as though you've turned a financial and professional corner, Scorpio. Recent accomplishments have you feeling energized and on top of the world! You exude confidence. It's a good feeling, isn't it? Members of the opposite sex are especially attracted to you right now. And who could blame them? You're looking great!",
    "sagittarius": "Sep 17, 2025- Who knew you were so talented, Sagittarius? A creation done long ago suddenly takes on a life of its own. A short story written and submitted long ago is pulled from the bottom of the slush pile. Or a portrait you painted gets a second admiring look. Whatever the circumstances, you enjoy the recognition. Your work isn't the only thing receiving admiring glances. Your partner appreciates you, too!",
    "capricorn": "Sep 17, 2025- Loving care is prescribed for someone in your family, Capricorn. Offer a bowl of soup and some tea, but beyond that try and stay out of the way. Sometimes uninterrupted quiet is the best cure of all. You could use a bit of this yourself. Why not curl up with a good book? Even if it's the middle of the day, draw the shades and pretend it's night.",
    "aquarius": "Sep 17, 2025- There's tension in the air, Aquarius, but there's little you can do about it. The harsh atmosphere is in stark contrast to the frivolity you felt over the last several days. It seems you received some good news. Perhaps you were finally recognized for your hard work? Don't brag about your accomplishments. It would only exacerbate the situation. Be patient. Avoid confrontation.",
    "pisces": "Sep 17, 2025- You might be in a financial jam right now, Pisces. The stress of the situation has you considering some radical solutions. Would it really benefit your family if you took a second job? Confide in a friend and see if he or she can help you find a more agreeable solution. Perhaps a relative could give you a low-interest loan."
}