{
    "aries": "Dec 27, 2025- Today you feel especially imaginative, and you might want to try writing, painting, or composing. The past is especially appealing, so you may want to stroll through an art gallery or museum or attend a concert. Use your intuition, as it's operating at a high level. Messages might come through art that bring insight and perhaps revelation. Write down your impressions!",
    "taurus": "Dec 27, 2025- You're always intellectually curious, but today you might be especially so. Although you're usually idealistic, today your imagination is in full swing. You might want to try writing or painting. It will be better to go with fiction or impressionism   than history or realism. Study of spiritual or esoteric subjects is likely to clear a path between intellect and intuition.",
    "gemini": "Dec 27, 2025- Your usually dependable judgment may seem clouded by emotion today. Perhaps you're unable to decide between different courses of action. Or perhaps you're feeling distracted and can't focus on what needs to be done. Don't be afraid to put things off and work on something less taxing. Things will seem clearer tomorrow. Spend your day relaxing. Forget about work for a while.",
    "cancer": "Dec 27, 2025- Optimism and foresight are important today, as you take charge of your life and seek new opportunities. Conversations lead to ideas for possible personal and career expansion, and you're likely to send out and receive a number of messages. You could even be considering a move, perhaps to another city. Don't rush. Plan carefully and all should work out as you wish.",
    "leo": "Dec 27, 2025- New ideas and opportunities for advancing yourself financially may come your way today, yet this isn't the day to act indiscriminately or make any definite changes in your financial structure. Your judgment may be a bit clouded. You could have difficulty deciding among different options. Write down all the information, study it, and sleep on it for a few nights before committing to anything.",
    "virgo": "Dec 27, 2025- Today, you may feel especially sociable. You might want to look up old friends you haven't seen for a while, perhaps to release past quarrels or hurt feelings. Take care to release them instead of bringing them up again. You could feel more sensitive than usual, and so any sort of explanation may lead to friction. Be aware of your friends' good qualities so you can enjoy their company.",
    "libra": "Dec 27, 2025- Your biorhythms may be low today, so you might not be feeling quite up to par. This could make you feel restless and a little blue. Most likely your malaise is related to stress. Play some soft music. Surround yourself with flowers or other colorful objects. If possible, get a massage. This will help you relax. You'll feel like your old self by tomorrow.",
    "scorpio": "Dec 27, 2025- Matters of love seem to be taking a turn for the better. Discuss your relationship with your partner. Your friend may or may not share your opinions, and a compromise may need to be reached. Don't let this dampen your enthusiasm. Romance looks bright for the near future as long as you keep the lines of communication open.",
    "sagittarius": "Dec 27, 2025- Have you been thinking about remodeling or redecorating your home? If so, this is the day to do it. Your energy and aesthetic sense are high today. Enlist the aid of family members in planning colors, styles, and arrangements. A lot of activity may go on in and around your home, and you'll be enthusiastic. Make sure on one works to the point of exhaustion.",
    "capricorn": "Dec 27, 2025- An unexpected visit or call from a friend could bring exciting news. You might decide to get together with this person and celebrate. Good fortune comes your way from an unforeseen source, but don't waste time wondering about it. Make the most of it. Future successes may hinge upon it. By day's end you might be aiming for entirely different goals than you were this morning.",
    "aquarius": "Dec 27, 2025- The morning could find you somewhat worried about finances. Past reckless spending may be on your mind. Go through your records and look at them objectively. You'll probably find that things aren't as bad as they seem. Write down a plan for handling whatever does need attention. You'll be able to take care of business without making yourself crazy.",
    "pisces": "Dec 27, 2025- Romance and marriage are always important to you, and today they're especially so. You should feel particularly warm, loving, and attractive, and matters of love and partnership should be especially romantic. Today bodes well for other forms of partnership, as an increased level of understanding passes between you and others. Casual acquaintances could become friends."
}