{
    "aries": "Dec 3, 2025- A group encounter, perhaps spiritual or metaphysical, could take place at your home tonight. This group will probably manage to do whatever it aspires to do. Intuition, energy, and imagination are all around you. You'll get closer to whomever you choose to spend time with today, be it friend, lover, or colleague. Tonight write down your thoughts and insights so you can remember them.",
    "taurus": "Dec 3, 2025- Group activities concerning spiritual, metaphysical, or humanitarian interests could take place in your area today. You'll meet some new friends. If you aren't currently involved, this could provide a chance to meet someone special. Look your best! Your mind is buzzing and your thoughts are more intense by day's end, so a short exercise session before bed might help you get to sleep.",
    "gemini": "Dec 3, 2025- New business contacts could bring the possibility of pursuing a new career in the psychic, spiritual, or healing arts, or perhaps in painting, writing, or another of the fine arts. Think seriously about it. Your own talent should be especially acute today. You could be thinking seriously about training to be more effective. The support of friends and groups could prove invaluable.",
    "cancer": "Dec 3, 2025- Spiritual matters come to the forefront today. You'll want to throw yourself into the study of a spiritual or metaphysical discipline that appeals to you the most. Friends or a group may want to join you. Getting together with others might stimulate your intellect, imagination, and spirit. At day's end, write down your thoughts. Take a long walk to clear your head so you can sleep.",
    "leo": "Dec 3, 2025- You're a spiritually inclined person, but today your mind is on other planes. Insights and revelations could come thick and fast, and you might want to express them through art. Romantic and other relationships take on a new karmic aura. Meditation could help you make sense of it all, as could a process like past-life regression or rebirthing. In the absence of that, write down your thoughts.",
    "virgo": "Dec 3, 2025- Other people take on special importance today. Romance is very much on your mind, whether in friendships, business partnerships, or relationships of all kinds. Your interactions are warm, cordial, and supportive. Romantic feelings approach fairytale intensity. Make the effort to see everyone as they really are and not as idealized images.",
    "libra": "Dec 3, 2025- Today you might try to secure the perfect job, possibly in an artistic field or one connected with the healing arts. You might have a specific position in mind, or you could consider several. It's important to think of all the ins and outs of every position before charging ahead. What you think might be perfect today could have hidden aspects you don't know about.",
    "scorpio": "Dec 3, 2025- A new or existing romance could take on a spiritual aspect that creates a stronger bond between you. The works of past great masters, perhaps some from exotic lands, inspire your creative drive. Spirituality could take on new importance to you. You might want to spend time meditating or studying. Past-life regression or guided meditation could prove enlightening.",
    "sagittarius": "Dec 3, 2025- Dreams and meditation could bring up deep-seated emotions from the past that have been blocking your growth without your realizing it. Both seeking and giving forgiveness may take on new importance. Romantic passion should be at an all-time high. These emotions are also likely to provide artistic inspiration that you want to turn toward decorating your home.",
    "capricorn": "Dec 3, 2025- If you aren't romantically involved, don't be surprised if romance comes your way today, perhaps in your neighborhood. Even if you are involved, you'll make a new friend. You're likely to meet someone special outside in the open air and close to a crowd of people. Therefore, this isn't a good day to stay inside, even if the weather's bad. Go see what the Universe has in store for you.",
    "aquarius": "Dec 3, 2025- Your value system may take on new spiritual and idealistic aspects today. Mundane affairs could assume new meaning for you. You might even see spirituality in your job. You could set some idealistic but unrealistic goals as far as your health is concerned. If you want to start a new health program, take it one step at a time. Don't try to accomplish everything all at once.",
    "pisces": "Dec 3, 2025- Other people are important to you. Today your relationships could take on even more significance than usual. You could meet some interesting people, and if you're not involved, you might even fall in love. Old and new friends could seem more wonderful and idealized. Romantic relationships could assume fairytale qualities. Try to make an effort to see people as they really are."
}