{
    "aries": "Jun 21, 2025- There may be a great deal of opposition in your way today, Aries, but try not to dwell on it. The key is to stay levelheaded and maintain a positive outlook. This is a day in which you can bring a great deal of balance to issues by understanding and respecting the other side. Have charity for those who are making sacrifices so that you may have a more comfortable ride.",
    "taurus": "Jun 21, 2025- The pieces of today's puzzle may not fit into place, Taurus, and it's possible that you have no idea why. Don't stress over something you don't quite understand. The key to making things work out is listening. Adjustments will definitely be needed on both sides, but this can only happen if both parties are willing to open their ears and understand one another's perspective.",
    "gemini": "Jun 21, 2025- Today can be an extremely productive day, Gemini. You're in a good space from which to work and this will aid you in all your endeavors. Today is also excellent for looking at some of the long-term trends moving through your life now. Consider the next five or ten years and think about how your actions will affect your future. Plan ahead to get ahead.",
    "cancer": "Jun 21, 2025- There may be a battle between old and new in your world today, Cancer. A reserved and old-fashioned perspective has a strong hold on the prevailing sentiment. This feeling is likely going to hit you square in the face as you lean toward the unconventional and more revolutionary approach to life. See what sort of past lessons you can learn from as you build the future.",
    "leo": "Jun 21, 2025- People may seem a bit stubborn today. Your powers of adaptation may be put to the test, Leo. The people around you are likely to call on your tender, sympathetic nature. Offer a nurturing ear and strong shoulder for others to cry on. Keep things low key and steady. The more grounded you are, the easier it will be to get along with the energy of today.",
    "virgo": "Jun 21, 2025- When you go up a flight of stairs, take one step at a time today, Virgo. Skipping up the staircase two at a time could result in you falling back to the bottom. Trying to rush things today will leave holes in your projects. Finish jobs completely by making sure that every step is thoroughly taken care of. Don't ignore the details.",
    "libra": "Jun 21, 2025- Today is a terrific day for taking the plunge or making an investment, Libra. Luck and prosperity are in your favor, and you have the opportunity to make some very profitable financial decisions. Your intuition is right in line with what you need to do. Make the best deal possible and provide a fair and secure future for you and your investment.",
    "scorpio": "Jun 21, 2025- The key to being successful today is to maintain an air of stability. If others see you as too flighty and off the wall, they will hesitate about putting their trust in you. Make sure you do those things in your power that will help boost your clout. You will need this support from others later. Make a solid base to build on.",
    "sagittarius": "Jun 21, 2025- Today is a very expansive day for you, Sagittarius. Your emotions can lead you into favorable situations with others. The pace of the day may seem a little slow, but this can be used to your advantage. Examine every detail with care and try not to leave any piece of the equation unaccounted for. You should enjoy a stable, caring mood that radiates out and draws others toward you.",
    "capricorn": "Jun 21, 2025- You may feel like you're coming up against a brick wall, Capricorn. Your emotions are a bit stifled and you may find that you're more stubborn than usual. There is a large and beneficial force that you can tap into today, as long as you keep your intuition open. The less you search for it, the more likely it will come to you. Something may spur you to act.",
    "aquarius": "Jun 21, 2025- Smile at the world today, Aquarius. Be thankful for the things you have and the people around you. Amplify the cozy, warm feeling inside and spread this love to others. This is a very expansive time for you in which you can get quite a bit accomplished if you set your mind to it. Radiate your true nature through every cell in your body and watch as the opportunities come your way.",
    "pisces": "Jun 21, 2025- Today isn't the best day to play practical jokes, Pisces, so put away the disappearing ink. Stick close to home. Find security in doing things you know how to do best. Hang a painting and cook a scrumptious dinner. You can inspire others with your smile, so use it. Don't get down if your thoughts aren't flowing well with the group. This is a sign that you should spend some time alone."
}