{
    "aries": "Jun 2, 2025- Aries, today's your chance to stand up to family members who want to exert too much control over your love life. It's time to bang your fist on the table and say, \"Enough's enough, I'll love who I want to.\" When you insist that well-meaning relatives respect your choices, you'll tap into a new well of self-respect.",
    "taurus": "Jun 2, 2025- It's up to you to strut your stuff, Taurus. As long as you're bashful about showcasing your innate gifts, it will be difficult to find meaning in your life. Today's planetary alignment gives you the challenge to take your talents more seriously. You could easily profit from them, provided you look deep inside to discover how.",
    "gemini": "Jun 2, 2025- You don't have to answer to society's cultural values, Gemini. If most of your work is organized around an activity that's considered fashionable, you will never succeed in feeling good about yourself or your creations. You're too motivated by meaningful activities to spend your time with frivolous ones. Today's aspects will push you to cut yourself off from all that doesn't resonate deeply.",
    "cancer": "Jun 2, 2025- You may have noticed for some time now to what an extent your ambitions wear you out and to what point they have become outdated. If you aspire to live an ambitious life, but also one that is calmer and more balanced, the celestial energy is indicating the moment has come to make some important decisions, Cancer.",
    "leo": "Jun 2, 2025- Are you hesitating, Leo? Do you feel caught between the desire to participate fully in the world and the equally strong desire to remain in your dream world, even at the risk of feeling a little out of it? Who says that these two worlds are incompatible? If you look closely, you will see that you don't need to choose one or the other.",
    "virgo": "Jun 2, 2025- You can expect to have to make a choice today related to your intimate relationships. You may have become aware that something is missing, either in your partner or yourself. Today you will act on that awareness, but it may not be easy. The root of the problem could be an issue of independence and self-sufficiency. Try to figure out the source of the problem before acting on it, Virgo.",
    "libra": "Jun 2, 2025- You're being called upon to make a commitment or promise, most likely relating to your love life. Will you take that decisive step? That's the question today. Over the next few days you will doubtless have to prove what you're made of. The challenge most likely emanates from your romantic relationships. There is no running away this time, Libra. It's time to take a stand.",
    "scorpio": "Jun 2, 2025- There are times in your love life when you may feel somewhat inhibited, as though something is holding you back from total fulfillment. Perhaps the emotions overwhelm you or the idea of commitment frightens you. In any case, Scorpio, you're well aware that your reluctance to take the plunge is detrimental to your relationship. The day will call on you to take a few more risks.",
    "sagittarius": "Jun 2, 2025- The forecast today is stormy. You may have sensed that there was some tension clouding the conversation at home. Resentments were left unsaid and subtle power games were played without resolution. Today, Sagittarius, it all becomes too unbearable for you. Regardless of the risks involved, you will take measures to clear things up.",
    "capricorn": "Jun 2, 2025- The day is likely to be somewhat challenging, and it contains some disappointments. You're liable to feel dejected if you receive a lackluster response from the world. Apparently, Capricorn, your performance has lost some of its ability to captivate an audience. Whether you accept this or try to shine up your act is the question of the day!",
    "aquarius": "Jun 2, 2025- Aquarius, you can expect the day to be a bit bumpy. If you were an Olympic athlete, today you'd be standing at the starting line, wondering if you had trained enough for a topnotch performance. Have you had enough practice? Will you make the grade? Issues related to your material resources will certainly be on the agenda.",
    "pisces": "Jun 2, 2025- A planetary configuration like today's often makes people afraid to start anything that challenges the status quo. This is true for you in your professional life. You should dare to take on more responsibility. The aspects speak of fear only, not of being incapable of succeeding. The saying about fear being the only thing to fear is something you should take to heart right now, Pisces."
}