{
    "aries": "May 23, 2025- It's time to stop acting like you think others want to see you act, Aries. The planetary configuration confirms that it's time to express yourself - your emotions, desires, and point of view - to take a firmer stand and define more clearly who you are to others and to yourself. Second-guessing potential reactions will ultimately get you nowhere.",
    "taurus": "May 23, 2025- Your energy is high and your stamina particularly strong today. Working out or playing sports could appeal to you now. Running or aerobics could offer valuable exercise and clear your head to allow for new ideas. You also should feel particularly passionate. If you're involved with someone, Taurus, expect a great evening. If not, don't be surprised if you get some admiring glances.",
    "gemini": "May 23, 2025- A reunion with a family member who has been away or out of touch could generate some powerful emotions, Gemini. Memories could come flooding back, making you both nostalgic and maybe a bit angry. Take care to curb the latter. You don't want to spoil your reunion. Take a long, objective look at the memories and try to figure out what they mean to you now. Then let them go.",
    "cancer": "May 23, 2025- Today your mind is likely to be on travel, Cancer. You might have to spend a lot of time running errands in the car. You could also be planning a long vacation, perhaps one centered on a group function or seminar of some sort. Your physical energy is high, but there's still a danger of tiring yourself out. Relax at home this evening.",
    "leo": "May 23, 2025- Today you might decide to put in some extra hours on the job or take on an extra project of some sort in order to bring in a little more money. Since you're feeling strong and energetic enough to move mountains, Leo, you need to take care not to overexert yourself. Work hard and earn your money, but pace yourself. Try to get a little exercise before going to bed.",
    "virgo": "May 23, 2025- Passion and determination mark today. Your energy should be high, Virgo, and you should feel strong and powerful. This is the perfect day to give whatever goals you've been trying to accomplish that one last push toward completion. You may surprise yourself with the power and quality of your work and the positive attention your efforts receive.",
    "libra": "May 23, 2025- Your inner power and awareness should be acute today, Libra. Some intense dreams and revelations could come from deep within, allowing you to release old traumas and phobias, and enabling you to move ahead with more confidence. Physical energy is high, though you may feel you need more sleep than usual. Your intuition is also sharp, enabling you to be more in touch with others. Use it!",
    "scorpio": "May 23, 2025- Working toward goals you share with others could bring you closer together as friends and lovers, Scorpio. The whole is definitely more than the sum of the parts. You're likely to produce better results as a group or partnership than you would have otherwise. This is an \"all pull together\" sort of day. Romantically, you may have an exciting, passionate encounter!",
    "sagittarius": "May 23, 2025- Today you might face a task that seems as workable as emptying the ocean with a teacup. But with help from others, you will not only be able to handle it but also produce exceptional results. Physically, you're likely to feel full of strength and stamina, ready to move mountains. Don't be too surprised if you actually manage to budge a few!",
    "capricorn": "May 23, 2025- The desire to travel, perhaps to visit a close friend, may come up today, Capricorn. You may put a lot of energy into exploring the possibilities. You might also want to travel to places where you can get some artistic inspiration for creative projects. Your energy and enthusiasm are high, so you should be able to accomplish this without neglecting your other chores.",
    "aquarius": "May 23, 2025- Expect a lot of activity in your home today, Aquarius. A group, perhaps a large one, hosted by you or a family member could meet there and provoke stimulating conversations. You could get caught up in the energy, putting you in touch with a new awareness of your feelings. Tonight, expect vivid dreams of travel, strange places, or flying.",
    "pisces": "May 23, 2025- The desire to meet with a romantic partner and look and feel your best could give rise to a lot of short journeys in your area. Perhaps you will want to work out, buy some new clothes, or get a haircut. This might be a good idea. Passions promise to run high today. Stimulating conversations could bring fascinating information to light."
}