{
    "aries": "Mar 25, 2025- Increased communication with a close friend or lover, more on a subtle than verbal level, could bring you closer and enrich your relationship. Quiet time spend together today could generate a new sense of closeness. Images and ideas that come from deep within you can contribute to your creative self-expression. Write down any insights so you can refer to them later. Work from the heart.",
    "taurus": "Mar 25, 2025- Today you might crave solitude, Taurus, perhaps for meditation or to contemplate your current situation. You may feel you're at a crossroads and need to decide which way to go. This could involve the next step in your material progress or self-expression, or it might involve your spiritual path. Emotions from the past could well up, but this is a positive development. Don't fight it.",
    "gemini": "Mar 25, 2025- You might spend a lot of time in conversation with friends who share your interests. Their insights could lead to new insights on your part, Gemini, and vice versa. This process could bring all of you closer together. Good news could come through the mail, email, or phone regarding goals you've been trying to reach. You're also likely to send out a lot of communications yourself.",
    "cancer": "Mar 25, 2025- Paperwork involving finances, Cancer, perhaps personal, perhaps involving your employer's funds, or both, is likely to need some intense attention during the day. This doesn't necessarily imply anything negative. In fact, just the opposite. It does mean that some careful planning or budgeting is going to be required in order to make the most of your current situation.",
    "leo": "Mar 25, 2025- Today you may want to spend your free time alone, contemplating various ideas, Leo. Spiritual or metaphysical philosophies from ancient cultures or foreign lands might be more appealing than usual. Reading about them at this time could approach obsession, but this is OK. Whatever you learn today is likely to contribute greatly to your personal growth and perhaps self-expression.",
    "virgo": "Mar 25, 2025- Today, Virgo, your mind may turn toward deep subjects. You could explore the sciences, psychology, the occult, or metaphysics. You will probably discover some new facts or ideas that could keep your mind occupied for hours. Needless to say, you will spend much of your time alone exploring these themes. You might also want to write down your insights and revelations to study later.",
    "libra": "Mar 25, 2025- A sudden upsurge in your intuition could have you feeling more in tune to the thoughts, feelings, and desires of others, Libra. Your communication is going to be clear and open as a result. You're likely to grow closer to everyone dear to you, especially your romantic partner. Don't expect everything you pick up to be positive. Others have their issues. Let them know you understand.",
    "scorpio": "Mar 25, 2025- Your mind is strong and focused today, Scorpio. As a result, you're probably feeling especially physically robust. Sudden insights could earn you some satisfying acknowledgement, not to mention the respect of someone important to you. Your intuition level is high and apt to serve you well now, particularly where work and health are concerned. Make the most of it!",
    "sagittarius": "Mar 25, 2025- Expect to spend much of your day alone, Sagittarius. Information obtained from books or videos, perhaps involving history, philosophy, or religion, might inspire you to look deeper into a subject and turn it to your own advantage. You might decide to take a trip or return to college. There's also the chance that you could be inspired to write or otherwise express your ideas and feelings. Go to it!",
    "capricorn": "Mar 25, 2025- Some strange dreams could stimulate your imagination and start you on new avenues of exploration. You might at some point play detective. What you seek is likely to be within your psyche. Don't be surprised if you learn new things about yourself that you hadn't been aware of before. You could also find your psychic faculties increasing.",
    "aquarius": "Mar 25, 2025- Reading could take up a lot of your time today, Aquarius. Books on psychology or the occult sciences might seem interesting, particularly as your intuition is operating on a higher level than usual. You might not want to talk about what's coming up for you, but that's OK. You will need to make sense of it first before you can share it with clarity.",
    "pisces": "Mar 25, 2025- Your mind is likely to be on your finances today, Pisces, and you may be searching for previously unknown ways to advance yourself. Colleagues or friends could help steer you in the right direction. When it comes to jotting down possibilities, trust your intuition, as it's operating at a very high level. List your possibilities and then let it stew for a few days before going over them again."
}