{
    "aries": "Aug 27, 2025- Have you invited some friends over for a celebration tonight, Aries? If so, your guests are going to keep you hopping! That's all right. The day is filled with love and joy. Entertaining them is your way of expressing your appreciation. If you're romantically involved, you and your partner can celebrate privately after all your visitors are gone. Relax, let go, and enjoy your party!",
    "taurus": "Aug 27, 2025- Other responsibilities might keep you away from your loved one today, Taurus. If you have plans for tonight - or even if you don't - you might find this rather depressing. Where is the one you love? Is your partner out carousing and having a good old time while you're working like crazy? Don't torture yourself with thoughts like this.",
    "gemini": "Aug 27, 2025- The absence of direct expressions of love might make your life seem rather empty today, Gemini. If you're single, there may be nobody around to have fun with. If you're involved, chances are your current love interest is unable to get together. Don't waste time fretting over this. Make some other plans.",
    "cancer": "Aug 27, 2025- You may decide to duck out of extra responsibilities today, Cancer, perhaps to have a private celebration at home with your love partner! The fun might be delayed if your beloved is unexpectedly called away for a while. Just remember that quality is better than quantity!",
    "leo": "Aug 27, 2025- You may feel neglected and unloved today, Leo. If you're single, you may feel worse. Cheer up. If you're running around with such a depressed and dramatic expression on your face, nobody will feel like asking you out. Try to make yourself happy by doing things you like to do. If you smile, you'll be a magnet for someone who has love to give.",
    "virgo": "Aug 27, 2025- Are you worried that your romantic partner doesn't love you as much as you love him or her, Virgo? Love has many facets. Not everybody can verbally express love or feel comfortable with public displays of affection. If someone loves you, there are ways you can tell. It might be the way they look at you, how they touch you, or little favors. If you're uncertain, why not ask?",
    "libra": "Aug 27, 2025- If you're single, Libra, you might feel a little down today. All your friends who are in relationships may have plans while you go home alone. Relax. Many people in relationships aren't necessarily happy. They have their own problems and sometimes feel lonely and frustrated. There are certain advantages to being single. Make the best of it today and enjoy yourself!",
    "scorpio": "Aug 27, 2025- Today you may substitute chocolate for a lack of love because you feel tempted to treat yourself to something good. This is fine, but confine yourself to a small amount. Overindulgence in sweets could have you regretting it when you get a stomachache, not to mention step on the scale! Remember, moderation is the key.",
    "sagittarius": "Aug 27, 2025- If you're not married or engaged, Sagittarius, you may feel that your current love interest is avoiding you. However, this is just your imagination. Relationships always go through ups and downs, so don't worry. If you have serious doubts whether there's something wrong, ask your partner.",
    "capricorn": "Aug 27, 2025- You may be a bit depressed today if you and your partner are going through a difficult time. Maybe there's something unspoken that brings tension and awkwardness into your life together. Try to find the root of the problem. It will only get worse if you don't talk about it. Don't get too emotional when you bring it up. Just ask if your partner is bothered by something.",
    "aquarius": "Aug 27, 2025- A short trip might be necessary today, Aquarius. This could be disheartening, as it takes you away from your current love interest, but perhaps it's just as well. A phone call on this emotionally charged day might advance your relationship more than a forced evening together. Acknowledge that you're looking forward to seeing your friend again and then get on with the job!",
    "pisces": "Aug 27, 2025- The strange behavior of a romantic interest may have you confused, Pisces. Is your partner avoiding you? Do phone calls go unanswered? Forget it. Sometimes people see too much intimacy as a threat to their independence and choose to ignore it. The best way to deal with this is to not press any sensitive issues. Just go out for dinner and act like a friend. Keep romance out of the equation for now!"
}