{
    "aries": "Jan 4, 2026- Travel in the company of a close companion might be looming over the horizon, Aries. In fact, you might be leaving pretty soon, and you're probably growing excited. Some surprising developments could come up during the course of this journey, and thus it's likely to shape up to be more than a simple vacation. Make sure you look your best, don't hold back on what you want to do, and have fun.",
    "taurus": "Jan 4, 2026- An unexpected lucky break could come your way today, Taurus - something you would never have expected in a hundred years. It could seem like a dream come true, yet it could disrupt your life in some way. You might find yourself facing a choice: go for it and change your entire way of life or let it go and take the risk that another great opportunity might never appear. Who said life was easy? Think about it!",
    "gemini": "Jan 4, 2026- If you aren't currently romantically involved, Gemini, today you could meet someone who shows a lot of promise. Work might be involved in some way, and it's also possible that this person has been living in your neighborhood for a long time. A friend could introduce you to each other. You'll probably spend at least an hour talking, and will probably make arrangements to meet again.",
    "cancer": "Jan 4, 2026- Some kind of unexpected shakeup could take place today, Cancer, and you could find yourself suddenly being offered more money or responsibilities. This might be just the break you've been waiting for, but it could take you so much by surprise that you might ask for time to think about it. Don't think for too long, however, because they might give the break to someone else!",
    "leo": "Jan 4, 2026- Today you might attend at least one festive social occasion, Leo, and therefore you may meet some very interesting people in unusual professions, such as film or TV. Expect to hear some bizarre stories, some of them true, others that are clearly exaggerated. Out of all this friendly banter and tale telling, however, you could acquire some useful information. Make a note of it so you'll be able to remember it later.",
    "virgo": "Jan 4, 2026- Your level of health and physical well-being is likely to be very high, Virgo, and thus you're probably glowing. As a result, you might find that those around you pay more attention to what you're saying than they usually do. You'll also find that your mind is especially sharp, and you're apt to be exceptionally quick on the uptake. Therefore, you might absorb a lot more from what you hear than you normally do. Make a note of it!",
    "libra": "Jan 4, 2026- You might be feeling especially adventurous today, Libra. The same old streets and buildings in the same old town might suddenly seem to be closing in on you. Therefore, you might just grab a close friend or significant other, hop in the car, and take off for the mountains or the ocean. You probably need a break. You've been working very hard and probably could benefit from some time in open country. Go for it!",
    "scorpio": "Jan 4, 2026- An intense dream or vision could result in a spiritual breakthrough of some kind, Scorpio, and you might spend much of the day in a bit of a daze, trying to make sense of it. You might see if you can find a few books on the subject, because all signs suggest that reading could bring a lot of useful information your way today. You might also want to write down an account of your experience.",
    "sagittarius": "Jan 4, 2026- You're apt to be in a very joyous mood today, Sagittarius, and it's going to show on your face. This isn't going to go unnoticed by the people you meet. You could make some new friends, and, if you aren't currently romantically involved, you might actually meet an interesting potential love partner. This person is apt to be very polite and polished, not to mention smart! Be cordial, be nice, and enjoy your day.",
    "capricorn": "Jan 4, 2026- Today you might host a gathering of people interested in psychic or metaphysical matters, Capricorn. A very special guest could give a talk or lead a discussion group. This could be fascinating for everyone present. You'll gain a reputation as a wonderful host, even though all you really do is pass out cookies and pour the coffee. You, above all, should have a great time and enjoy talking with your friends. Have fun!",
    "aquarius": "Jan 4, 2026- Writing may be one of your main focuses for today, Aquarius. You have a lot of information to impart to anyone who might be interested in what you have to say. You could try your hand at a magazine article or perhaps fiction or poetry. However, even if all you write at this time is a letter to your cousin, what you say will undoubtedly be bright, gripping, and certainly very interesting. Go to it!",
    "pisces": "Jan 4, 2026- Professional interests continue to expand, Pisces, and you're managing to keep very busy. Your income is rising, and you could be achieving a certain prominence in your field. Nonetheless, you could be looking for new opportunities. The field you're in now may not be one that you want to continue for the next 20 years. This is therefore a good day to put out a few feelers and test the waters. You might be surprised at the opportunities out there."
}