{
    "aries": "Dec 13, 2025- A gathering of psychics, artists, and spiritually oriented people could take place in your home today. This may be a fascinating and stimulating meeting, but there may be someone who likes to stir controversy and debate. Be aware of this possibility and short-circuit it if you can or this promising encounter could end with battered egos and bruised feelings.",
    "taurus": "Dec 13, 2025- A class you've wanted to take may open up, and you'll want to register right away. You might have a few difficulties. If you try to sign up by phone, the line may be busy. If you enroll online, the website might crash. Don't get discouraged and give up. These are only temporary delays. You won't want to miss the class. Keep trying!",
    "gemini": "Dec 13, 2025- Do you have a lot of money in investments? Even if you have only a savings account or home equity, you could be a bit disconcerted when the stock market takes a nosedive. A lot is going on behind the scenes that the general public doesn't know. The situation is temporary. The market should be back to normal before too long.",
    "cancer": "Dec 13, 2025- A love partner may seem distracted. Don't jump to the conclusion that your friend has found someone else. The problem is more likely to center on obstacles that your partner has encountered in achieving a cherished goal. When your friend decides to share this with you, you might be able to shed some light on the situation.",
    "leo": "Dec 13, 2025- Equipment could give you trouble today. You're probably good at working with it, but when it comes to troubleshooting, you might not know as much as you should. Don't make yourself crazy worrying about it. Get a friend or colleague to assist you, or better yet, call a professional. You'll feel more confident and get a lot more done.",
    "virgo": "Dec 13, 2025- A friend's lack of communication and perhaps even shortness with you could bring up your insecurities and have you wondering if this person still cares about you. Don't worry. Your friend is upset, but not about you. He or she may be too caught up in difficulties to realize the problem. Hang in there and you'll be in touch again when they're ready.",
    "libra": "Dec 13, 2025- A member of your group may have gone away without telling anyone where he or she was going. This could be worrisome for the rest of you, but don't fret. Your friend is probably OK, but may just need to do some thinking alone. You have to accept that you won't hear from this person today. Have faith and don't worry.",
    "scorpio": "Dec 13, 2025- A strange, unexpected call or email could puzzle you. You may not know the caller, the information might not make sense, or it might bring news that doesn't feel right. Whatever you hear may be exaggerated if not false. If it's important to you, check out the facts before jumping to conclusions and before passing it on to others.",
    "sagittarius": "Dec 13, 2025- Is your financial situation confusing? Are you starting to panic about it? You may be getting worked up over nothing. Get all your paperwork together, focus on the facts, and see what's really happening. Once you consult the actual figures and go over them a few times, you should find that you can handle the situation.",
    "capricorn": "Dec 13, 2025- Ideas for creative projects may be flooding your mind, but they may be too general or vague to grasp. Make a list if you like, but don't feel you have to start anything today. You may need a few days to let the ideas churn around before settling on the best one to start. Be patient.",
    "aquarius": "Dec 13, 2025- Have you been getting strange vibes from someone close to you? Chances are this person isn't upset with you. He or she may be worried about upcoming changes in the professional environment. All signs are that these worries are groundless. Offer to take your friend out to lunch and just listen. You'll be able to lighten the load and provide some much-needed perspective.",
    "pisces": "Dec 13, 2025- A current or potential love partner may drop out of sight and not return your calls. You could panic, wondering if your friend has lost interest. Don't jump to conclusions. Your partner may be involved in other matters. Remember the old saying, \"If you love something, let it go.\" If you cling, it was never yours in the first place."
}