{
    "aries": "Jul 29, 2025- You have a romantic soul, Aries. Today your thoughts are on love and romance. You may be thinking of that special someone in your life, grateful that you've found each other. Or you may wish you had someone important in your life and spend a good part of the day plotting how to find a mate. If you're serious about settling down, draw on all of your resources to make it happen.",
    "taurus": "Jul 29, 2025- Something big could be occurring close to home today, Taurus. It would be advisable to stay inside, if possible, or at least not stray too far. Traffic may be gridlocked and the sidewalks crowded with pedestrians anxious for a closer look. Use this self-imposed \"house arrest\" to do some neglected chores. Play music and have fun while you organize bookshelves and clear the clutter from your closets.",
    "gemini": "Jul 29, 2025- You have hidden talents that may be revealed to you today, Gemini. Perhaps collaboration with someone new has you doing things you never thought you could. Perhaps you discover a talent for writing, graphic design, or money management. You can't help but delight in this discovery, as it opens up a world of new possibilities. You don't need to take action now. Revel in your untapped potential.",
    "cancer": "Jul 29, 2025- You're a kind, caring individual, Cancer. Today your concern for others may be so strong that you take steps to do something concrete to save, if not the world, at least a few of the individuals in it. You may hear of a worthy cause that's about to fold for lack of volunteers. You could turn out to be just the savior they need. One person truly can make a difference. You can prove it today.",
    "leo": "Jul 29, 2025- Today you may develop a deeper understanding of what's really important to you, Leo. You may be surprised by what you discover. The material means far less to you than the spiritual. It may have taken you a while to learn this, but now there's no going back. Your possessions feel like dead weight. The mere thought of your family and friends fills your heart with love and light.",
    "virgo": "Jul 29, 2025- Your life is likely to enlarge today, Virgo, either through a new group affiliation or people you meet. You may be invited to a party where a whole world of new and exciting events opens up to you. You may be reunited with a good friend from your past who can open all sorts of professional doors for you. Be receptive to anyone and everyone you meet.",
    "libra": "Jul 29, 2025- Sometimes it's better to be lucky than smart, Libra. You'll learn this today as good fortune puts you in the right place at the right time. You may meet someone who makes a big difference to your career. Perhaps he or she turns you on to a good job prospect or introduces you to someone who ends up being a business partner. Your life may change if you're open to possibilities.",
    "scorpio": "Jul 29, 2025- Be open to any invitations that come your way or any new people you meet. Change is in the air for you, Scorpio, and you need only be receptive in order for it to come about. You may even meet someone at a social event who winds up being your partner for life. Explore all your interests and trust your intuition, for it will be a reliable guide.",
    "sagittarius": "Jul 29, 2025- Today you may wake up and realize that there is serious room for improvement, Sagittarius. If decorating isn't your strong suit, why not call in the professionals? In the meantime, there's a lot you can do by simply clearing away the clutter and reorganizing your bookcases in a more attractive way. Mingle some artwork and knickknacks among the books for a more interesting visual effect.",
    "capricorn": "Jul 29, 2025- You tend to keep to yourself, Capricorn, but today you could be inspired to join a group activity. Perhaps some friends have invited you to come out for drinks. Or maybe a neighbor asked you to consider joining a neighborhood organization. Whatever the scenario, all signs indicate that any group activity you join will be worthwhile. You will do some good and likely make new friends, too.",
    "aquarius": "Jul 29, 2025- Technology is highlighted for you today, Aquarius. It could be that you install a new phone or computer system, which will make life just a bit easier. Or perhaps you decide to take a course to learn to master a technical area that has been difficult for you to grasp. Whatever you do or learn today is bound to make you happier and more productive.",
    "pisces": "Jul 29, 2025- You're a social creature, Pisces, and today you can expect to attract a lot of attention. You're feeling good and looking even better - and don't think that people don't notice! Make it a point to get out and mingle with others. You're a talented, capable person in your own right, but you really shine when you're with others. This is especially true today."
}