{
    "aries": "Aug 2, 2025- Romantic desire tempers spiritual passion today, and you may want to pursue both, Aries. Perhaps your romantic partner is as spiritually inclined as you, and you aspire toward the same ends. Much of the passion you feel wells from deep within. So if you're creatively inclined in any way, you may want to memorialize these feelings through writing, painting, or music.",
    "taurus": "Aug 2, 2025- If you're currently romantically involved, your relationship could move to the next level of commitment. You and your partner could agree to be monogamous, get engaged, or set a wedding date. If you're already married, you might decide to have a child. If you aren't currently involved, Taurus, expect to attract someone soon. You're ready and signaling your availability loud and clear to potential partners!",
    "gemini": "Aug 2, 2025- An invitation to an important social event could come today, Gemini. This may be a chance to meet important people who could advance your career in some way or who might be involved in a field that interests you. Your own energy and enthusiasm won't be lost on them. You will obviously be speaking from the heart when you discuss what's on your mind.",
    "cancer": "Aug 2, 2025- A previously untapped talent may emerge today, Cancer. You could decide to train this talent and create a new skill that can help you with just about any type of work you'd be doing. This is the day to do this. You should be full of energy and enthusiasm, capable of assuming any formidable task. You should be feeling physically strong and well. This is a day of challenges and new enterprises.",
    "leo": "Aug 2, 2025- Romantic passion might motivate you to improve your physical appearance, Leo. You might decide to exercise, change your diet, and experiment with new clothes or haircut. You're likely to produce the results you want. With the vast amounts of energy and enthusiasm churning within you today, you might surprise yourself - with this task or anything else you decide to do.",
    "virgo": "Aug 2, 2025- You might take on the world, Virgo. Excitement, enthusiasm, and purpose could fill your soul, yet you may wonder where it comes from, as nothing has really changed since yesterday. Don't waste time wondering - just harness it! Tackle a class or exercise program. Start a project. This energy comes from deep in the unconscious. It should be channeled into the conscious world!",
    "libra": "Aug 2, 2025- Information gleaned from friends could find you focusing on a new goal, Libra. You may have a lot of ideas about projects you want to take care of, and today you may realize which one has top priority. Start moving! Whatever you do, find out what you need before you start. There's a chance you might waste time running from place to place looking for necessary materials.",
    "scorpio": "Aug 2, 2025- A possible change in direction might arise today. You could meet someone new or run into someone you haven't seen in a while who offers you a chance to change careers. Or it could become clear that you need to pursue your art or hobby full time. Whichever it is, Scorpio, this is a great day to pursue it, even if you have doubts. Your past accomplishments afford you an advantage.",
    "sagittarius": "Aug 2, 2025- You may feel especially emotional today, Sagittarius, reacting strongly to just about every image you see, whether it's a war photo or a kitten on a doorstep. Spiritually, you're highly motivated and longing to know more about the world. You might find yourself thinking of making a pilgrimage. If you're serious, make your plans now.",
    "capricorn": "Aug 2, 2025- Dreams and visions might come and go today, Capricorn, as unconscious images surface. Some of these impressions could represent old traumas and phobias that have outlived their usefulness and need to be released. You could draw creative inspiration from these perceptions and use them as a basis for artistic projects. By day's end you may feel emotionally lighter.",
    "aquarius": "Aug 2, 2025- Social events or group activities could put you in touch with many people, Aquarius, both close friends and casual acquaintances. A new person may come into your life who makes a difference. Issues may come up that you feel strongly about. You aren't likely to refrain from expressing your opinions. This is fine if you're tactful. Others will appreciate your honesty.",
    "pisces": "Aug 2, 2025- Physically, Pisces, you should feel strong and energetic and ready to take on just about anything that comes your way today. This is good, as some powerful challenges may come up that bring new purpose to your life. Enthusiasm permeates your being right now. You're likely to face with determination anything that comes your way, undeterred by the enormity of the task."
}