{
    "aries": "Jun 10, 2025- The astral energy says there's a time for everything. We tend to repeat certain tasks we like doing, while those we dislike we try to get out of the way as quickly as possible. It seems reasonable, but the Universe reminds you that you should make as much space in your life for what you don't like as for what you do, because each task is related to the other in some way.",
    "taurus": "Jun 10, 2025- Reality isn't always as exciting as you'd like it to be, Taurus. But isn't this because you interpret reality in a particular way? You rarely look at things in detail, because fundamentally, details don't interest you. But if you look around, you will discover that the details of a truly epic event are currently unfolding before your eyes. Put some new lenses in your glasses!",
    "gemini": "Jun 10, 2025- The planetary energies are encouraging you to make some adjustments regarding your social ambitions. You may desire to change professions or your circle of friends. This is trickier than you might think, as the culture of your current world is an extension of you. You're drawn to what's familiar. Your natural tendency will be to go back to where you came from.",
    "cancer": "Jun 10, 2025- This planetary energy is going to test your recurring desire to go to the other side of the world or have a ready exit in any relationship. You do this so you won't feel trapped and, above all, so you won't be dependent. This is one of your strengths, Cancer, but it's also one of your weaknesses. Throughout the next few weeks you will be pushed to involve yourself more intimately with others.",
    "leo": "Jun 10, 2025- Why do you find relationships difficult, Leo? You know interactions with others help you learn and grow. This is the case for everyone. But for you, especially, relationships are important because they help keep you grounded. Too often you dream about reality rather than confront it. Today's aspects are going to insist that you make a greater effort with the people closest to you.",
    "virgo": "Jun 10, 2025- The end of one cycle signals the beginning of a new one. Today, you will embark on a new period of understanding that harmonizes your energies. You may have taken more risks than usual lately as you exposed emotions you normally keep hidden. Did you overdo it or could you have gone even further out on that limb? You have a period of clarity ahead to think about it.",
    "libra": "Jun 10, 2025- Have you noticed a certain strain on your emotions, Libra? You're resilient, but even you have found all the recent intensity a bit too much. You can relax now. The next few weeks promise to be calmer. Sunnier skies will gradually return. Your efforts will concentrate on your love life. You know you need security and stability. If you work steadily, you will attain those goals!",
    "scorpio": "Jun 10, 2025- The past few weeks may have seemed Earth shattering, Scorpio. You may still be trembling slightly as you head into the coming weeks. Fortunately, the current astral configuration promises to be calmer, although not necessarily less intense. You will be able to apply recent decisions regarding your domestic life and finally settle some important matters.",
    "sagittarius": "Jun 10, 2025- You may be sensitive, Sagittarius, but you're also persistent. The waves you've surfed in the past few weeks have only strengthened your resolve. However, you will have to be satisfied with this past period of thrills. The weeks ahead will be much quieter. Use the time to regain some control over your life and work hard to simplify your attitudes.",
    "capricorn": "Jun 10, 2025- Perhaps the last few weeks impressed you as one of the most intense periods yet in this year. You will certainly admit that anything related to affairs of the heart was endowed with profound and lasting meaning. It's now time for a physical and psychological rest in order to let you fully integrate your experiences. The weeks ahead offer a calm and quiet oasis.",
    "aquarius": "Jun 10, 2025- The day ahead will suit you, but you mustn't expect miracles. Now is a time of healing. In the weeks ahead you will restore harmony to your energies and regain your fitness with improved diet and lifestyle. Your emotional life gets an overhaul as well, as you find the courage to confront certain unsettling issues.",
    "pisces": "Jun 10, 2025- Yes, Pisces, you haven't finished all the cleaning up that remains in many areas. You're going to have to get your papers in order, pay off old debts, face physical or moral obligations, and fix technical problems. That's a lot of work! Fortunately, once it's done, your emotional baggage will be considerably lighter, enabling you to go farther and faster."
}