{
    "aries": "Feb 1, 2026- Are you into abstract art forms, Aries? Today you could find yourself irresistibly drawn to them, whether blank verse, abstract painting, or New Age music. If you're into the arts yourself, you might want to try your hand at whatever discipline appeals to you the most. If you aren't, attend a concert, stroll through an art gallery, or go to a poetry reading. Whatever you do, enjoy your day!",
    "taurus": "Feb 1, 2026- Have you been toying with the idea of redecorating your house, Taurus? If so, you might actually come up with a few solid ideas, although you'll have a difficult time deciding among them. Sometimes making a list can help you work out the details of each and discern which is the most workable at this time. Look at home decorating magazines and furniture catalogs. Write down what appeals to you. You'll decide something. What fun!",
    "gemini": "Feb 1, 2026- Emotions run high today as a love partner calls on you to discuss some troubles, Gemini. These don't directly concern you, but you’d still like to see them straightened out, as you tend to feel helpless when someone you care for is upset. At times like this, it's really best to listen rather than try to give advice. Your partner probably just needs to talk it out. Be patient and all will be well.",
    "cancer": "Feb 1, 2026- A close friend or your love partner may present you with a gift, Cancer. You'll be touched but you'll also feel uncomfortable. Maybe the present is costly or not something you really like. You might also feel that your friend is too eager. What you do in this situation is, of course, up to you. Tip: don't refuse the gift unless you genuinely feel it’s totally inappropriate. And definitely don't give it back because that's what your mother would do!",
    "leo": "Feb 1, 2026- Love matters may seem to be far worse than they really are, Leo. Emotion runs high as your current love interest seems preoccupied and uncommunicative; however, it wouldn't be a good idea to let your insecurities get the best of you and lash out. Your partner's heart is with you, though the mind is another matter. Family or career problems are getting in the way of your enjoyment of each other. Bite your tongue, be patient, and hang in there.",
    "virgo": "Feb 1, 2026- Is your imagination brimming over with ideas for new projects, Virgo? Are you drawing upon old memories for inspiration? Your past can be a very fruitful resource; however, today you may find that some of these recollections make you feel more emotional than you should. Let them all go. This is a necessary release. Channeling your feelings into creative work could prove cathartic. By the end of the day you should feel great. Go with the flow.",
    "libra": "Feb 1, 2026- Are you suddenly falling for an old friend, Libra? This may have you confused and a little frightened since you've never viewed this person in this way before. However, this person probably does reciprocate the attraction, so don't completely write it off. Consider this: could this person be a strong part of your future? How well do you know each other? Do you respect this person the way you should? If the answers to these questions are positive, give it a try!",
    "scorpio": "Feb 1, 2026- Are you in love, Scorpio? You might find that thoughts of your beloved haunt you today, even while you're apart. Desire and passion could be practically obsessive, and they'll interfere with your other projects if you aren't careful. Try to stay focused on the tasks at hand and make a date to get together with your partner later. After all, you want to keep all departments of your life in their proper perspective!",
    "sagittarius": "Feb 1, 2026- A picture of an art object from a different culture could arouse some strange feelings in you, Sagittarius. You won't know why, but it will spark a new interest in that culture. This probably relates to events deep in your past that you don't remember. Go ahead and explore this new interest. It will be intriguing and at the same time could help you release old traumas or phobias. Enjoy!",
    "capricorn": "Feb 1, 2026- Are you worried about the psychological and emotional state of a friend, Capricorn? Don't get yourself too worked up over it. Your friend is probably more troubled about money than anything else. If this is your love partner, you should be especially careful not to push for confidences, as this could be a turn-off. Your beloved will talk to you when the time is right. In the meantime, be patient and a good listener.",
    "aquarius": "Feb 1, 2026- Your current love interest could be experiencing some family problems, Aquarius. Therefore, don't expect too much scintillating conversation this evening. Your partner may seem preoccupied and not be in the best of moods. Rest assured that this has nothing to do with you. Don't let your insecurities get the best of you. Don't demand an explanation. Be there, even if it means being silent, and let your partner think things out. This is tactful and will certainly be appreciated.",
    "pisces": "Feb 1, 2026- Is someone you know having a birthday, Pisces? If so, beware of all the great food that will undoubtedly be brought to the party! If you're trying to improve your level of health and fitness, you'll be sorely tempted to depart from the program. Be as firm as you can, but remember that we all need a little indulgence occasionally. Chocolate cake and ice cream might not be on your diet, but think of them as emotional health food. Enjoy a little bit!"
}