{
    "aries": "Jan 2, 2026- In case you do any writing or artwork today, it will seem to come from a source outside of yourself, Aries. Is this the divine muse you've heard others talk about? Possibly, or perhaps it's just your own natural talent shining through at last. Today is also auspicious for relationships, so be sure to take time for friends and loved ones both old and new.",
    "taurus": "Jan 2, 2026- Put that book down and get out of the house, Taurus! You've been by yourself long enough; it's time to start interacting with other people. In addition to having heaps of fun, you're likely to have some encounters that will prove beneficial in the long run. Group situations are great, but don't overlook the pleasures of an intimate one-on-one encounter.",
    "gemini": "Jan 2, 2026- Your hard efforts to improve your life are finally showing results, Gemini. And this is just the boost you've needed, as some people set your self-confidence a bit on edge. Just don't let others destroy your vision of happiness. Continue to walk toward your goal and don't hesitate when small obstacles appear left and right.",
    "cancer": "Jan 2, 2026- The people you meet today could be of tremendous benefit to you later on, Cancer. You have especially keen vision today, so make sure to take note of everything of interest that you observe. What you discover today, along with the people you meet, could combine in a powerful way at some future date. Your work also benefits from your attention to detail.",
    "leo": "Jan 2, 2026- This is a time of new beginnings, Leo. Whether you are aware of it or not, you are more than ready to take on some new challenges. You have allowed yourself to become complacent about your career. You have the ability to make a major step up, so why not do so? All that is required is a bit of effort on your part. Figure out what your ideal job would be and then pursue it. Or better yet, create it!",
    "virgo": "Jan 2, 2026- Romance is in the air today, Virgo. It's the perfect time to make yourself look your best and invite that certain someone to dinner. Even if you're already happily married, why not take advantage of the auspicious mood and plan a special date with your spouse? Even old married couples are entitled to romance now and then!",
    "libra": "Jan 2, 2026- Today, you crave a little style. Sensible shoes and practical clothes get the boot in favor of fashionable shoes and luxurious fabrics. Your passion and sense of romance are at an all-time high, Libra, so you might as well take advantage of it for all it's worth. You can expect to reap a tremendous payoff as a result of the extra efforts you have been making with your appearance.",
    "scorpio": "Jan 2, 2026- It isn't just royalty who gets to live happily ever after in fairy tales, Scorpio. You have this right as well. The conditions are ripe for attracting a special person into your life. There is no need to rely on \"expert\" advice for attracting a soul mate. It's your own unique qualities that will beckon to the right one.",
    "sagittarius": "Jan 2, 2026- While you may feel the urge to put on a pair of boxing gloves and duke it out with your family, Sagittarius, try putting on an oven mitt instead. Cooking a meal or performing other domestic chores will help take your mind off your troubles with your family. If you aren't the domestic sort, exchange the mitt for some reading glasses and bury yourself in your work. These tensions on the home front will pass quickly enough.",
    "capricorn": "Jan 2, 2026- You have an urge to hop on a plane and leave the country, Capricorn. It seems that this is the only way to free yourself from the mountain of professional and social obligations that are piling up. How can you ever hope to attend all of them, or even half? Have you considered that you may not need to? Send someone else in your stead, perhaps, or simply respond that you can't make it. You wouldn't be the first to say no. You are entitled to some downtime.",
    "aquarius": "Jan 2, 2026- Finally, all of your efforts are being recognized, Aquarius. That's not to say that you can now sit back and rest on your laurels - quite the contrary! Now is the time to put your original ideas to the test. But this time you have the backing of the higher-ups. Don't be nervous; just do what you had planned to do all along. If you work hard, you're likely to see tremendous professional and financial rewards.",
    "pisces": "Jan 2, 2026- You have a wonderful, nurturing nature, Pisces. Those around you reap tremendous benefit from your caring soul. Just as you are receptive to the needs of others, so too should you be aware of your own needs. You deserve to be on the receiving end of your own gentle touch. Don't hesitate to turn to others for help if you need to. You might be surprised how mere acquaintances pitch in to lend a hand."
}