{
    "aries": "Jul 22, 2025- Desire is the name of the game today, Aries. If you want it, you can get it, but it won't come easily. The prize will go to the person who desires it the most. Show the people around you how much you can accomplish. You will impress others with your incredible drive and determination. Don't fall victim to the wasp that could sting you.",
    "taurus": "Jul 22, 2025- Today is like playing a game on your home field, Taurus. You have fans supporting you and you know the territory. Take advantage of the little things that you have going for you. There is a dramatic force at work that is erratic but extremely powerful as long as you maintain control. Stay focused on your goals. True happiness is only a small step away.",
    "gemini": "Jul 22, 2025- Enlist the help of others today, Gemini. Information exchange is key to putting the last few puzzle pieces into place. Doing things on your own is important and necessary, but at some point you need to realize that the next major step requires a certain amount of input from others. Gather data and apply it to your situation. Don't become a leech or burden to others.",
    "cancer": "Jul 22, 2025- This is an excellent day for you, Cancer. Celebrate. Your ego is strong. Beautiful things are flowing your way. You should enjoy a good mood that will attract favorable people and situations to you. There's virtually no limit to the expansiveness of this day. One thing to watch out for is arrogance. Be proud but not obnoxious.",
    "leo": "Jul 22, 2025- Your emotions may be a bit erratic. It may be hard for you to focus on anything today, Leo. Things continue to shift from one topic to the next with little resolution. Others aren't apt to be very sympathetic to your feelings, so don't expect it. You will only set yourself up for disappointment. It's a better day to focus on your head rather than your heart.",
    "virgo": "Jul 22, 2025- There's an extra blast of wind ready to fill your sails today, Virgo, so make sure you have both hands on the tiller. Whichever way your rudder is pointed is the direction you will go. Once you get on course, it will be difficult for you to readjust your position, so make sure your compass is properly set. Continue with your journey, full speed ahead.",
    "libra": "Jul 22, 2025- The energy of the day is erratic, and you will probably be hopping all over the place, Libra. Don't worry about trying to firm up any plans at this time. You may feel like you're trying to grab a slippery fish with greased hands. If so, don't worry about it. Let the fish swim away for now. Relax. You can always catch another one later if you need to.",
    "scorpio": "Jul 22, 2025- Get up and get going today, Scorpio. You have no time to lose. Your mind will be busy tackling many tasks, but this suits you just fine. You're well equipped to deal with the many frantic situations that are likely to come up. There's a great deal of strength to your emotions that you can use to connect with others and communicate your thoughts in a healthy manner.",
    "sagittarius": "Jul 22, 2025- Your heart could experience some wild fluctuations today, Sagittarius. It may seem as if your emotions are on a derailing train. The best thing to do if this is the case is sit by yourself and write them down. Compose a letter, song, or journal entry. You're much less confused than you think. When in doubt, consult someone you love and trust. Go with your instincts.",
    "capricorn": "Jul 22, 2025- Suddenly things are coming to a head for you, Capricorn. The drama is escalating and you aren't sure if you can remember all your lines. Take things one step at a time. Deal with the issues as they come. If you get ahead of yourself, you might be overwhelmed by the fear that the situation will be more than you can handle. Don't sweat the small stuff.",
    "aquarius": "Jul 22, 2025- Your focus will center on your emotions today, Aquarius, although being centered in itself will be quite a challenge. You may feel like a yo-yo in someone else's hand. Don't fall prey to victimization. Stand up for yourself even if it means that others get upset. You're responsible for your feelings and no one else's.",
    "pisces": "Jul 22, 2025- Maintaining equilibrium may not be the easiest task today, but if anyone can do it, you can, Pisces. Strong opinions from others could crop up to challenge you. You have a great deal of ammunition in your arsenal. You can learn quite a bit by accepting this challenge and engaging in a heated debate. Have faith in yourself."
}