{
    "aries": "Apr 28, 2025- A dip in the stock market might cause you to worry about your own financial future, Aries. You may have some investments that could be temporarily negatively affected. Bear in mind that such events don't necessarily reflect future trends. Take steps to create some kind of safety net if you wish, but don't assume the worst. The market could go back up tomorrow!",
    "taurus": "Apr 28, 2025- Today you might find that some of your more ambitious plans finally seem to be paying off, Taurus. You should be happy about this, but you might panic a bit, fearing that everything could crash at the last minute. Don't assume the worst and don't waste your energy worrying. Keep striving! You've gotten this far. With a little effort, all should go well.",
    "gemini": "Apr 28, 2025- If you've been doing some creative or job-related writing, today you might be tired, blocked, and unable to muster the energy to turn on the computer. Gemini, you need to ask yourself how important it is to get it done today. It's far better to wait another day and do it well than grind out something that isn't up to your standards. That could be counterproductive.",
    "cancer": "Apr 28, 2025- A project of some kind you've been working on could be going well, Cancer, but today you might experience a sudden rush of inspiration that makes it a lot better than you originally envisioned. This could involve effort that seems intimidating at first, but the results should be worth it. Summon all your energy and determination and get to it. You will be very glad you did!",
    "leo": "Apr 28, 2025- A family member could be experiencing business difficulties, Leo. Your sensitivity could cause you to feel their anxieties, too. You might want to make it clear to this person that you're there for him or her, but you also need to be objective about the situation. Protect yourself psychically, perhaps by surrounding yourself with white light. It won't help your relative if you're stressed.",
    "virgo": "Apr 28, 2025- A friend or relative could be ill, out of work, or otherwise beset by problems. You may want to do whatever you can to help out. This could be frustrating, but you will feel better for having done what you can. This person needs to face and deal with his or her responsibilities. They're out of your control to fix, Virgo.",
    "libra": "Apr 28, 2025- An unexpected expense, perhaps requiring repairs to the house or car, might take a chunk out of your bank account, Libra. This may be disheartening. You've worked hard for your money and now you might have to put some of your plans on hold. Still, you need to be philosophical about it. Take care of it and move on. You built up your bank account once and you can do it again.",
    "scorpio": "Apr 28, 2025- Career changes may be on the horizon, Scorpio. Although positive in the long run, the events leading up to the change may seem catastrophic. Your employer could go out of business or move too far away for you to commute. The secret here is not to panic. Accept the situation and move on. In the end, you will probably be glad that this happened. Success and good fortune are coming.",
    "sagittarius": "Apr 28, 2025- Premonitions today might be rather disturbing, Sagittarius, and you might actually feel some fear because of them. Don't panic! Your intuitive abilities aren't quite as sharp as usual. What you feel could be distorted or untrue. This doesn't mean you've lost it, either. Try to be objective about everything you pick up psychically. You will be glad you did.",
    "capricorn": "Apr 28, 2025- Changes within a group you're affiliated with might profoundly affect you today, Capricorn. Perhaps the group is veering in a new direction that doesn't particularly interest you. You might need to reevaluate your involvement. This could make you rather sad since you've grown fond of the people and won't want to lose them as friends. You need to think. Only you can decide what to do.",
    "aquarius": "Apr 28, 2025- A scandal concerning a celebrity you admire could be in the news today, Aquarius. This might throw you for a loop. You might even suffer some disillusionment. Withhold judgment for the time being. Much of what you hear may be traced to gossip or misinformation. Shocking though it may be, you will want to hear the celebrity's side of it. Only then can you form an objective opinion.",
    "pisces": "Apr 28, 2025- Some rather shocking news could come to you from a friend who lives far away, Pisces. This probably won't affect you directly, as it most likely concerns the world economy, politics, or big business, but you still might worry about its long-term effects on society. You could discuss it with friends. You need to remain objective and see how the news develops. It might be less serious than it seems."
}