{
    "aries": "Dec 12, 2025- Frantic communications involving a project or family affairs could have you feeling scattered and unfocused. Too many important concerns have hit you at once. It can be confusing, but take them one at a time and don't be tempted to try to accomplish everything at once. Your mind is steady and analytical today. Go with the flow and all will get done.",
    "taurus": "Dec 12, 2025- Good news about money could fill you with ideas about how to spend it, particularly on your home. Maybe you need new furniture or have been thinking about painting or redecorating. This is a great time to do it as long as you're careful and not to let your exuberance get the better of you. You don't want to have to repaint or take unwanted furniture back to the store.",
    "gemini": "Dec 12, 2025- Your mind is sharp and ready to take on anything thrown your way. Family members or friends could pick up on this pretty quickly, so don't be surprised if they come to you for help and advice. You'll probably give a lot of it today, so be prepared. Paperwork might be a bit overwhelming. As long as you take it one step at a time, you'll get it all done.",
    "cancer": "Dec 12, 2025- Books and magazines on psychic, spiritual, or metaphysical matters could take up a lot of your attention today. Your inclination could be to let your routine tasks go in favor of continuing to read calling all your friends to tell them what you've learned. Save it for this evening. You're too conscientious to let your work slide, and you'd feel derelict in your duty if you did.",
    "leo": "Dec 12, 2025- A fairly recent goal that you've set for yourself might seem a bit overwhelming. You might wonder if you'll get it done. Though you could easily become distracted, you can focus when you try, and this is what you should do now. Finances may need attention, and possibly paperwork, but this is only routine work.",
    "virgo": "Dec 12, 2025- Today you should feel especially optimistic and enthusiastic about life. You'll have a lot of great ideas about what to do with your day, but unfortunately, your ability to put these plans into motion will probably be curtailed by other responsibilities. This could have you champing at the bit all day, but what the heck? Tonight you can do whatever you want!",
    "libra": "Dec 12, 2025- Discussions about religion could come up during your day. A recent rush of intuitive revelations could cause you to want to expound on your beliefs, but this could backfire. This isn't the day to try to convince others of anything. This also isn't a good day to think in terms of getting away for a while. Kick around a few ideas, but make definite plans later.",
    "scorpio": "Dec 12, 2025- Friends or a group with which you're affiliated might run into financial difficulties and ask for your advice. It wouldn't be a good idea to give it, at least not today. Your thoughts aren't as focused as they should be. You might use a little intuition to guide you. Your ability to see under the surface is good now.",
    "sagittarius": "Dec 12, 2025- Communication with family members and the special person in your life could be frustrating today. Either you aren't in accord or you keep missing each other. Don't be frustrated. It's the planetary energy running a little interference. By tomorrow this aspect will have passed and you'll once again find yourselves on common ground.",
    "capricorn": "Dec 12, 2025- Plans for travel or advancing your education could be on your mind. Your excitement might keep you from focusing on whatever tasks you have to do. Don't worry about it. Your steadfastness will enable you to get your tasks completed in spite of anything that may distract you. Either that, or the people around you will keep reminding you of your responsibilities!",
    "aquarius": "Dec 12, 2025- Thoughts of romance and dreams of a wonderful evening with that special someone are foiled by work that needs to be done right away. This might concern finances. It could involve a lot of deep thought on subjects that don't particularly interest you. Don't let this get you down. Get through the chores and then plan your evening. It won't be too late to have fun.",
    "pisces": "Dec 12, 2025- You might be planning to attend a social event today. You're   looking forward to it. Paperwork could take up so much of your time today that you wonder if you can make it. The paperwork doesn't seem to be that urgent. Do as much as you can and then take off and go to your party. You deserve it."
}