{
    "aries": "Nov 27, 2025- Something may be distracting a close friend or love partner so much that this person isn't very good company. Nor will your friend want to share the source of their preoccupation. Don't try to have a long conversation about it. Back off and let your friend come to terms with it alone. Sometimes that's all you can do.",
    "taurus": "Nov 27, 2025- Your thoughts and feelings may be vague today, and you could be preoccupied. People might talk to you but you won't hear much of what they say, and you'll remember even less. This is a temporary condition. Don't worry that people think you're rude. The ones that count know you're not. Spend the day reading escapist novels. It won't matter if you can't remember those!",
    "gemini": "Nov 27, 2025- Romantic matters should be going very well now, although today you might have some doubts. Your loved one may be quiet and preoccupied. Don't let your insecurities get the better of you! What's probably going on with your friend has little if anything to do with you and more to do with money matters. Your partner will tell you when the time is right.",
    "cancer": "Nov 27, 2025- Today you may have so much to do around the house that you don't know where to start. Family members aren't much help. Don't throw up your hands and let it all go. Look around the room, find something that needs to be done, and handle it. Keep doing this and then stop when you're tired. There's no need to work yourself to exhaustion even if you expect visitors. Their homes get messy, too!",
    "leo": "Nov 27, 2025- Today the paranormal could be on your mind. Books on related subjects may capture your interest, so you'll probably want to spend the day reading. Some of the concepts might seem strange even to you, but don't write them off yet. The important thing now is to keep an open mind. Strange things are discovered every day.",
    "virgo": "Nov 27, 2025- A strong bond of loyalty that you feel for a friend might propel you into a touchy situation today. Your friend may ask you to do a favor that's difficult if not impossible. Look into the situation and see if there's some way you can help. If not, you'll have to try to make it up later. Sometimes that's all you can do.",
    "libra": "Nov 27, 2025- Confusion may reign today, particularly if you're intuitive. You may pick up strange vibes that could be unsettling. Don't try to make sense of them. Your ESP may be a bit off, or those people whose feelings you're sensing are stressed and lacking direction. Or it could be both. Either way, you should be back to normal tomorrow.",
    "scorpio": "Nov 27, 2025- Some bizarre dreams or visions could come to you today. Don't put too much stock in them. You might find that the images are partly scenes from your past, partly information you've received lately, and partly your own fears about the future. If you view them this way, you should be able to see what they're telling you. They aren't prophesies for the future.",
    "sagittarius": "Nov 27, 2025- Information you receive from friends could have you worrying a little about your financial security. You may be trying to reach a goal that seems to be in jeopardy - if the news you've heard is true. It may not be! Check the facts before jumping to conclusions and panicking. You could find that there's nothing to worry about.",
    "capricorn": "Nov 27, 2025- Usually you have a strong intuitive bond with those close to you, but today you might feel like that part of your brain has shut down. You could get confusing messages, or you could pick up nothing at all. You haven't lost your gift so don't worry about it. You'll have to rely on words for now!",
    "aquarius": "Nov 27, 2025- It may be difficult to focus on household chores today. Your mind is on more exalted matters, such as spiritual and intellectual interests and you feel lazy. It's OK to do nothing. You don't have to knock yourself out every day! Relax at home, read, watch TV, and cook if you must do something. Your chores can wait until you feel more energetic.",
    "pisces": "Nov 27, 2025- Creative ideas may elude you today. You may have a hankering to do something artistic but with only a few vague notions, and you may not like those. This is a good day to work with others' ideas. Read, play music by a great composer, copy a painting by a master. This way you'll keep the impulses going without trying to force new ideas that won't come."
}