{
    "aries": "Jun 3, 2025- This is the beginning of a new cycle, Aries. There will be new issues cropping up over the next several days. You may have to rethink certain principles that you've adhered to in your relationships up until now. Upon reflection, you find that you no longer agree with them. It seems that the conventions and social graces required by society are weighing you down.",
    "taurus": "Jun 3, 2025- This is a pleasant day, Taurus. Indeed, the celestial aspects are predicting that it will be rather radiant, though likely less intense than the past week or so. You probably had some new perspectives to set up in your professional life, and now you will have to get to work setting goals! You were waiting for just this moment? Perfect!",
    "gemini": "Jun 3, 2025- Are you ready, Gemini? Are you in shape for what's going to happen? The celestial aspects are heralding a new cycle that will be filled to the brim with activities, new people, and new professional perspectives. Let's hope that you've been able to rest up lately. If you haven't, try to schedule in some afternoon naps!",
    "cancer": "Jun 3, 2025- Will there be change in you during the next few weeks, Cancer? This is always the question that one asks with this changing planetary environment. It's appealing to think that you may be traveling to exotic locations or perhaps changing jobs and meeting some interesting new people. Anything is possible with these aspects. Enjoy the renewed atmosphere!",
    "leo": "Jun 3, 2025- A new wind is blowing in your relationships, Leo, and you probably won't be too sorry about it! The planets are lining up to signal new beginnings. You will be able to take advantage of your recent reflections and test your new self-image. You likely won't be disappointed by the results. Be happy. You have every reason to be!",
    "virgo": "Jun 3, 2025- You will be happy to know that today contains the seeds of change for your love life, Virgo. Beginning today and for the next month or so, you're likely to be amazed by the turn of events in your relationships with others. The plot thickens as new people and groups emerge on your horizon. The aspect ahead is much less individualistic than usual.",
    "libra": "Jun 3, 2025- Last month you may have been somewhat more extroverted and sociable than usual, especially regarding your emotional relationships. But beginning today, your attitude will undergo a change, Libra. You will probably be calmer and more reasonable. Your thoughts may begin to focus more on the future than the present. You have about a month to firm up your plans.",
    "scorpio": "Jun 3, 2025- As a person who loves to experiment with new ideas and discover new people, you will be delighted with the period that is now beginning. Since communication, togetherness, and sociability will rule the next few weeks, it will be a perfect time to get out and show off your gifts. You will have a ball, Scorpio!",
    "sagittarius": "Jun 3, 2025- Today's overall outlook is positive for you, Sagittarius. You can expect to focus on giving a little more character, expression, or enrichment to your domestic life. You may redecorate a part of the house or find new leisure activities for the children. Don't be reluctant to suggest something original. They will probably enjoy it!",
    "capricorn": "Jun 3, 2025- You're embarking on a phase devoted in large part to your love life, Capricorn! Make this time completely fulfilling by introducing fresh new ideas. Don't let these pleasures grow stale. The cycle ahead is extremely auspicious for romance. It's a good time to take a trip, just the two of you. If you're single, you may meet an uncommonly interesting new person.",
    "aquarius": "Jun 3, 2025- After the emotional havoc you went through over the last few weeks, the period beginning today will be quite soothing. You can take advantage of these smoother, calmer waters to rediscover emotional harmony and improve the balance of your energy flow. Moreover, Aquarius, if your physical health isn't quite adequate, the weeks ahead should give you a chance to rest and recuperate.",
    "pisces": "Jun 3, 2025- The celestial configuration is speaking of a new period in which you focus on the way you differentiate yourself from others, Pisces. Are you aware of the aspects that make you unique? If not, meditate on the subject or ask close friends for input. The upcoming weeks are going to teach you a lot about this subject!"
}