{
    "aries": "Oct 12, 2025- Someone once said that you can't be too rich, but today you may think this statement is false, at least when it comes to a friend. This person may have just come into some money and be discombobulated by it. He or she may ask your advice, but probably not follow it! Don't feel bad about it. It's out of your hands. At least you can manage your own funds.",
    "taurus": "Oct 12, 2025- A romantic partner may appear to be more concerned with business than with you right now. Some decisions need making, and your friend could be preoccupied with them through most of the evening. Passion for you still runs strong, but it's been shoved into the background for now. Don't think that you've lost your appeal. Wait until tomorrow and all should be normal again.",
    "gemini": "Oct 12, 2025- You're likely feeling strong, healthy, and energetic. You might be inclined to take on huge tasks, some of which are more appropriate for three people than one. Be careful. You could take on more than you can handle. The strength and energy you feel now could wilt under too heavy a load. Pace yourself!",
    "cancer": "Oct 12, 2025- Today you may be obsessed with romance. Racy novels could be especially appealing, and you might try some experiments with how you look in order to enhance your sex appeal. If you try to schedule an intimate encounter with a partner, don't be surprised if there are obstacles, such as your friend's work. You might have to wait until tomorrow!",
    "leo": "Oct 12, 2025- Your household could be a happy place tonight. Good food and lively conversation heighten the atmosphere as visitors and family members enjoy each other's company. The only downside is that one of your gregarious friends may be feeling rather quiet tonight, listening when he or she is usually talking. Still, everyone's having fun, even if it's in a quieter way.",
    "virgo": "Oct 12, 2025- Too much to do around the house could have you running around like crazy. You may need to make a lot of calls, see too many people, or execute some rather tedious paperwork. This could have your nerves on edge by midafternoon, so take a few minutes for yourself every two hours or so. Step outside in the fresh air. This will calm you and help you stay sane.",
    "libra": "Oct 12, 2025- Did you celebrate last night? Happiness over a surprising turn of fortune is indicated, but so are a heavy head and hollow stomach from overindulging in food and drink! You probably would have indulged more if the conversation hadn't been so intriguing. Take it easy today if you can. If you have a hectic day ahead, stay centered. Getting flustered can exacerbate your pain.",
    "scorpio": "Oct 12, 2025- It's hard to stay centered now. Your mind is on something wonderful that's happening for you. Yesterday it was a fantasy and now it's real! You may be walking around in a daze trying to make sense of it all. Eventually you have to come down and face reality again, but there's no need to do it now. Things like this don't happen very often.",
    "sagittarius": "Oct 12, 2025- An impromptu gathering including some neighbors could take place today. Someone could start a round of gossip, and this could turn you off. You might wonder if they're going to start in on you when you leave! Don't stick around. Listening to such talk could give you a headache. Gossip is the last refuge of people who have no life.",
    "capricorn": "Oct 12, 2025- A temporary separation between you and a lover could have you experiencing mixed feelings. You may need some time to yourself, but you'll miss your friend! Your insecurity could come up, and you may start wondering if there's someone else with your partner. Concentrate on your projects and enjoy the peace and quiet. You're making mountains out of molehills.",
    "aquarius": "Oct 12, 2025- This may be one of those days in which you don't feel like doing anything and you can't force yourself. While you're out you'll shop just enough to take care of essentials, and at home you'll probably veg out in front of the TV. Don't feel any guilt over it. We all need days like this. Take it easy, relax, and you'll be your old self again tomorrow.",
    "pisces": "Oct 12, 2025- Spiritual concepts may seem elusive and incomprehensible today. You might have difficulty focusing on books and your mind could wander during lectures or meditation. Conversation should shed light on what's unclear to you. Ask friends who follow the same path. If nothing else, you'll enjoy the discussion."
}