{
    "aries": "May 14, 2025- You have some very urgent desires, but they remain a secret to everyone else. In solitude, you cultivate your interest in philosophy and mysticism. Today, it's as if you're absent from the world. Your body and actions are in the real world, but you have gone so far into yourself that it will be hard for people around you to get you out! What incredible concentration!",
    "taurus": "May 14, 2025- You're usually the life of the party, but today you may want to pull into your cocoon, far away from the world and all its noise. You need to empty yourself of all negative ideas and thoughts. It's time to do some mental housecleaning and rid yourself of notions that were planted in you as a child. Now you can start all over again.",
    "gemini": "May 14, 2025- Your judgment about people relies too much on general opinion, Gemini. As soon as you meet someone, you accept what others think about him or her without trying to find out more. This lack of curiosity could lead you to make a hasty decision about someone today. If you take the time to listen with your heart, you could be impressed by what you hear.",
    "cancer": "May 14, 2025- Do you have a tendency to give more weight to popular opinion than your own feelings, Cancer? Maybe you only want to see movies that everyone talks about, listen to the popular music, or read best sellers. In short, your tastes are exactly like most of America's. Is this what you want? Even when you don't like a movie, you may say you do if everyone else does. Listen to your ideas today.",
    "leo": "May 14, 2025- Your thoughts are leaning toward the past, Leo. You aren't moving backward, but you may want to get in touch with your roots in order to move into the future. You would also like to better understand of the mistakes of the past. You're going to be something of a psychoanalyst today.",
    "virgo": "May 14, 2025- People can read you like a book today, Virgo. Because of the current planetary positions, you're a bit touchier than usual. Your reactions to certain situations are written all over your face. You're blushing and your hands are sweating and trembling. Each of your gestures reveals emotion. This would be a great time to be in love. Watch out for love at first sight!",
    "libra": "May 14, 2025- Your excellent analytical skills may not be up to par over the next few days. You seem overwhelmed by your emotions. You have a hard time hiding your feelings and processing the information you receive. Instead of trying to understand people, you tend to interpret their actions and imagine things that aren't true. Be careful of your judgment at the moment. It's way off base!",
    "scorpio": "May 14, 2025- The planetary aspects invite you to explore strong expressions of feeling, Scorpio. A declaration of love, autobiography, spiritual confession, apology, or reconciliation. All these kinds of communication bring a kind of intimate revelation. This might be what you need in order to take advantage of the powerful inspiration of the moment.",
    "sagittarius": "May 14, 2025- This is an excellent time to share your feelings with the person you love, Sagittarius. It might seem a little scary to you. You're usually a reserved person, but you may surprise yourself with the passionate declarations that reflect your happiness now. Take advantage of this, because things could change over the next few days. You may go back into reclusive mode!",
    "capricorn": "May 14, 2025- You may feel like walking barefoot, comforting your friends, or playing with children. There's a tenderness and openness in the air that affects everyone. It will be like a wonderful day in the country, where everyone is happy to see each other, hug, and tell old family stories for the hundredth time. These days make young people laugh and old people smile.",
    "aquarius": "May 14, 2025- The current planetary aspects are heightening your natural compassion for other people. Your relationships will be at the front of your mind today, Aquarius. You feel good about yourself and other people can tell! People are attracted to you and wish to partake of your healing serenity. Listen without judgment as people pour out their hearts. That is a very precious skill.",
    "pisces": "May 14, 2025- You were born with a certain grace and beauty, Pisces. Today you will be able to cultivate your love for beautiful things. You may feel like trying on designer clothes or expressing your innate aesthetic sense by painting. Today your five senses will guide you with the help of your imagination and your artist's temperament."
}