{
    "aries": "Nov 26, 2025- You've allowed money issues to become too prominent. It's true that your financial picture isn't as rosy as you'd like it to be, but whose is? Try to put your troubles in perspective. There's no need to let these worries impact your relationships with friends and family. Ask for help if you feel you need it.",
    "taurus": "Nov 26, 2025- Your body, which usually runs at warp speed, is telling you to slow down. You need to take a break from time to time. Eating a big bowl of caramel popcorn while watching TV won't send you into a downward spiral from which you'll never emerge. On the contrary, such an indulgence may leave you feeling refreshed and even giddy. Why not try it?",
    "gemini": "Nov 26, 2025- Today is a day to rest on your laurels, literally. You've achieved a tremendous amount in the last few days. You've earned some time off. Call in sick and go see a movie in the middle of the day. Take yourself out to lunch and order a glass of the best champagne. Take this day to reflect on your accomplishments before you set your mind on the next project.",
    "cancer": "Nov 26, 2025- Flowers and fresh plants can perk up your mood as well as your home. You may feel your abode is looking a bit shabby. Simple tricks to improve its appearance will do wonders for your outlook. Go to a kitchen store and splurge on a few new items. Put a pot of herbs in a window. You'll be amazed at the change in your mood and in the room!",
    "leo": "Nov 26, 2025- You're in a spiritual state of mind today. Your dreams are vivid and you're sure they're trying to tell you something specific. It's hard to dispel the urge to travel. In particular, you're drawn to someplace where you can study a different culture. Such a trip might not be practical now, but you can manage some online research on the subject!",
    "virgo": "Nov 26, 2025- It's important to confront your troubles head on, but not at the expense of putting your life on hold. An important person, someone who acted as your touchstone, no longer figures prominently in your life. This is a difficult adjustment for you. Make an extra effort not to turn inward as is your tendency in times of trouble. Force yourself to socialize and you may find a new friend.",
    "libra": "Nov 26, 2025- Looking good is the best revenge. If you're trying to get over a failed relationship, the best way to pull yourself out of a depression is to look your very best. Get up early and go for a run or an exercise class. Buy some new clothes and take extra care with your grooming. You'll lift your spirits and attract a new, more fitting partner.",
    "scorpio": "Nov 26, 2025- As much as you enjoy being out with people, tonight is a good evening for rest. If you can, try taking the afternoon off. Curl up in your favorite chair with a good book, take a slow walk through a garden, or putter in the kitchen and cook something fabulous. You need some time to refuel your soul. You'll tackle your projects tomorrow, relaxed and rejuvenated.",
    "sagittarius": "Nov 26, 2025- You're especially attuned to the feelings of others. This gift is more blessing than curse, yet there are times when it's hard not to take on the troubles of others. Today a close friend may unload his or her burdens on you. Listen kindly, offer advice, but don't offer to do more than is realistic. After all, this isn't your problem.",
    "capricorn": "Nov 26, 2025- Delays seem to rule the day, and there's no getting around them. Traffic snarls plague the commute and calls don't get returned. You feel as though you're spending the day stuck in a revolving door, whirling around but getting nowhere. Take heart and do your best to get through with some of your humor intact. Chocolate helps. Tomorrow will be better!",
    "aquarius": "Nov 26, 2025- The bubble you've been living in for a long time may burst today. You could face some real disappointments. Try not to let this get you down. Keep the big picture in mind as best you can. Remind yourself that trips or meetings or fun days out can always be rescheduled, and then you'll have the pleasure of looking forward to these events all over again.",
    "pisces": "Nov 26, 2025- This is a day to be directed inward rather than outward. It's a good thing, too, because the outer world isn't too pleasant. Nothing seems to be going right. Checks aren't arriving and calls aren't returned. You're feeling ineffective at best. Take heart. It has nothing to do with you and everything to do with the planets. The mood will pass. Meanwhile, do something fun by yourself."
}